Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

source: Built-in User Management
ar_sa: إدارة المستخدم المدمجة
da_dk: Indbygget brugerstyring
de_de: Integrierte Benutzerverwaltung
el_gr: Ενσωματωμένη Διαχείριση Χρηστών
es_es: Gestión de usuarios integrada
fi_fi: Sisäänrakennettu käyttäjänhallinta
fr_fr: Gestion des utilisateurs intégrée
hi_in: एम्बेडेड उपयोगकर्ता प्रबंधन
id_id: Manajemen Pengguna Bawaan
it_it: Gestione utenti integrata
ja_jp: 組み込みユーザー管理
ko_kr: 내장형 사용자 관리
nl_nl: Ingebouwde gebruikersbeheer
pl_pl: Zintegrowane zarządzanie użytkownikami
pt_br: Gerenciamento de Usuários Integrado
ro_ro: Gestionare utilizatori integrată
ru_ru: Встроенное управление пользователями
sv_se: Inbyggd användarhantering
th_th: การจัดการผู้ใช้แบบฝังใน
tr_tr: Gömülü Kullanıcı Yönetimi
uk_ua: Вбудований менеджмент користувачів
vi_vn: Quản lý người dùng tích hợp
zh_cn: 内置用户管理
zh_hk: 內建用戶管理
zh_tw: 內建使用者管理

source: Calculate major scales and chords based on a root note.
ar_sa: احسب المقياس الرئيسي والكُورات بناءً على ملاحظة جذرية.
de_de: Berechne große Tonleitern und Akkorde basierend auf einer Grundtonnote.
el_gr: Υπολογίστε μεγάλες κλίμακες και χορδές βασιζόμενοι σε μία βασική νότα.
es_es: Calcula escalas mayores y acordes basándote en una nota raíz.
fi_fi: Laske suuria sävelmäskaloja ja akkordien perustuen juurisäveliin.
fr_fr: Calculez les gammes majeures et les accords à partir d'une note de base.
hi_in: एक रूट नोट के आधार पर मेजर स्केल और चोर्ड की गणना करें।
it_it: Calcola scale e accordi maggiori in base a una nota fondamentale.
ko_kr: 루트 노트를 기준으로 메이저 스케일과 코드를 계산합니다.
nl_nl: Bereken grote toonladders en akkoorden op basis van een grondtoon.
pl_pl: Oblicz skale i akordy majorowe na podstawie nuty podstawowej.
pt_br: Calcule escalas e acordes maiores com base em uma nota tônica.
ro_ro: Calculează scale și acorduri majore pe baza unei note de bază.
sv_se: Beräkna durskalor och ackord utifrån en grundton.
tr_tr: Ana notaya göre major ölçekleri ve akorları hesaplayın.
uk_ua: Обчислити великі лади та акорди на основі основного ноти.
zh_cn: 根据根音计算大调音阶和和弦。
zh_hk: 根據基音計算大調音階及和弦
zh_tw: 根據基準音計算大調音階與和弦。

source: Calculate minor scales and chords (natural, harmonic, and melodic).
ar_sa: احسب المقياس الصغير والشُّرُوط (الطبيعي، التوافقي، والموسيقي).
de_de: Kalkulieren Sie Moll-Tonleitern und Akkorde (natürlich, harmonisch und melisch).
el_gr: Υπολογίστε μικρές κλίμακες και χορδές (φυσικές, αρμονικές και μελωδικές).
es_es: Calcular escalas y acordes menores (natural, armónica y melódica).
fi_fi: Laske pienet sävellajit ja akkordit (luonnollinen, harmoninen ja melodiainen).
fr_fr: Calculez les gammes et accords mineurs (naturelle, harmonique et mélodique).
hi_in: छोटे स्केल और अक्षर (प्राकृतिक, हार्मोनिक, और मेलोडिक) की गणना करें।
it_it: Calcola scale e accordi minori (naturale, armonica e melodica).
ko_kr: 미ajor 스케일과 화성(자연, 하모닉, 멜로딕)을 계산합니다.
nl_nl: Bereken majeur toonladders en akkoorden (natuurlijk, harmonisch en melodisch).
pl_pl: Oblicz skale i akordy małych (naturalne, harmoniczne i melodyczne).
pt_br: Calcular escalas e acordes menores (natural, harmônico e melódico).
ro_ro: Calculați scalele și acordurile minore (naturale, armonice și melodice).
sv_se: Beräkna mindre skalsystem och ackord (naturliga, harmoniska och melodiska).
tr_tr: Küçük ölçekleri ve akorları (doğal, harmonik ve melodik) hesapla.
uk_ua: Розрахувати мінорні гамі та акорди (природні, гармонійні та мелодичні).
zh_cn: 计算小调音阶和和弦（自然小调、和声小调和旋律小调）。
zh_hk: 計算小調音階及和弦（自然小調、和聲小調及旋律小調）。
zh_tw: 計算小調音階與和弦（自然小調、和聲小調與旋律小調）。

source: Calculate musical intervals between two notes.
ar_sa: احسب الفواصل الموسيقية بين ملاحظتين.
de_de: Berechne musikalische Intervalle zwischen zwei Noten.
el_gr: Υπολογίστε μουσικά διαστήματα μεταξύ δύο νότων.
es_es: Calcular intervalos musicales entre dos notas.
fi_fi: Laske musiikillisia välejä kahden nuotion välillä.
fr_fr: Calculer les intervalles musicaux entre deux notes.
hi_in: दो नोट्स के बीच संगीत अंतराल की गणना करें।
it_it: Calcola gli intervalli musicali tra due note.
ko_kr: 두 음 사이의 음정을 계산합니다.
nl_nl: Bereken muzikale intervallen tussen twee noten.
pl_pl: Oblicz odstępy muzyczne między dwoma dźwiękami.
pt_br: Calcular intervalos musicais entre duas notas.
ro_ro: Calculați intervalele muzicale dintre două note.
sv_se: Beräkna musikaliska intervall mellan två toner.
tr_tr: İki nota arasındaki müzikal aralıkları hesaplayın.
uk_ua: Обчислити музичні інтервали між двома нотами.
zh_cn: 计算两个音符之间的音程。
zh_hk: 計算兩個音符之間的音程
zh_tw: 計算兩個音符之間的音程。

source: Challenge your musical memory by repeating melodies.
ar_sa: تحدّي ذاكرتك الموسيقية من خلال تكرار اللحن.
de_de: Fordere dein musikalisches Gedächtnis heraus, indem du Melodien wiederholst.
el_gr: Προκάλεσε τη μουσική σου μνήμη επαναλαμβάνοντας μελωδίες.
es_es: Desafía tu memoria musical repitiendo melodías.
fi_fi: Haastele musiikillista muistiasi toistamalla sävelmää.
fr_fr: Mettez votre mémoire musicale à l'épreuve en répétant des mélodies.
hi_in: ध्वनि स记忆 को चुनौती दें बार-बार धुनों को दोहराकर।
it_it: Metti alla prova la tua memoria musicale ripetendo melodie.
ko_kr: 메로디를 반복하면서 음악적 기억력을 시험해 보세요.
nl_nl: Test je muziekmemory door melodieën te herhalen.
pl_pl: Wypróbuj swoją pamięć muzyczną, powtarzając melodie.
pt_br: Desafie sua memória musical repetindo melodias.
ro_ro: Provocă-ți memoria muzicală repetând melodiile.
sv_se: Utmana ditt musikminne genom att återge melodierna.
tr_tr: Melodileri tekrarlayarak müzik hafızanızı zorlayın.
uk_ua: Викличте свою музичну пам'ять, повторюючи мелодії.
zh_cn: 挑战你的音乐记忆，通过重复旋律来锻炼。
zh_hk: 挑戰你的音樂記憶，重複旋律。
zh_tw: 挑戰你的音樂記憶，重複旋律。

source: Comes with Docker support for simplified and consistent deployments.
ar_sa: يأتي مع دعم دوكير لDeployment مبسطة ومتزنة.
da_dk: Kommer med Docker-understøttelse til forenklet og konsekvent implementering.
de_de: Kommt mit Docker-Unterstützung für vereinfachte und konsistente Bereitstellungen.
el_gr: Διαθέτει υποστήριξη για Docker για απλοποιημένη και συνεπή μεταφορά.
es_es: Incluye soporte para Docker para despliegues simplificados y consistentes.
fi_fi: Sisältää Docker-tukea yksinkertaistettuun ja johdonmukaiseen käyttöönottoon.
fr_fr: Fourni avec le support Docker pour un déploiement simplifié et cohérent.
hi_in: डॉकर समर्थन के साथ आता है सरल और समान डिप्लॉयमेंट के लिए।
id_id: Datang dengan dukungan Docker untuk penyebaran yang disederhanakan dan konsisten.
it_it: Viene fornito con supporto Docker per distribuzioni semplificate e coerenti.
ja_jp: Dockerサポートを備えており、シンプルで一貫性のあるデプロイが可能になります。
ko_kr: Docker 지원이 포함되어 있어 배포를 간소화하고 일관성 있게 할 수 있습니다.
nl_nl: Kom met Docker-ondersteuning voor vereenvoudigde en consistente implementaties.
pl_pl: Dostarczane z obsługą Docker dla uproszczonych i spójnych wdrożeń.
pt_br: Vem com suporte a Docker para implantações simplificadas e consistentes.
ro_ro: Include suport pentru Docker pentru implementări simplificate și consistente.
ru_ru: Имеет поддержку Docker для упрощённого и единообразного развертывания.
sv_se: Kommer med Docker-stöd för förenklade och konsekventa distributioner.
th_th: มาพร้อมการสนับสนุน Docker สำหรับการปรับใช้งานที่ง่ายและสอดคล้องกัน
tr_tr: Docker desteğiyle gelir, basitleştirilmiş ve tutarlı dağıtımlar için.
uk_ua: Містить підтримку Docker для спрощеного та узгодженого розгортання.
vi_vn: Được tích hợp hỗ trợ Docker để triển khai đơn giản và nhất quán.
zh_cn: 提供 Docker 支持，实现简化且一致的部署。
zh_hk: 內建 Docker 支援，簡化並確保部署的一致性。
zh_tw: 內建 Docker 支援，讓部署更簡化且一致。

source: Comprehensive Documentation
ar_sa: توثيق شامل
da_dk: Udførlig dokumentation
de_de: Umfassende Dokumentation
el_gr: Λεπτομερής Εγχειρίδιο
es_es: Documentación completa
fi_fi: Kattava dokumentaatio
fr_fr: Documentation complète
hi_in: व्यापक दस्तावेज़ीकरण
id_id: Dokumentasi yang Komprehensif
it_it: Documentazione completa
ja_jp: 包括的なドキュメント
ko_kr: 포괄적인 문서
nl_nl: Uitgebreide documentatie
pl_pl: Kompletna dokumentacja
pt_br: Documentação Abrangente
ro_ro: Documentație completă
ru_ru: Полная документация
sv_se: Utförlig dokumentation
th_th: เอกสารประกอบอย่างละเอียด
tr_tr: Kapsamlı Belgeler
uk_ua: Докладна документація
vi_vn: Tài liệu toàn diện
zh_cn: 全面的文档
zh_hk: 全面文件
zh_tw: 完整的文件說明

# Connecting Everything
source: Interlinking All Elements
ar_sa: ربط كل شيء
da_dk: Forbinder alt
de_de: Alles verbinden
el_gr: Σύνδεση Όλων
es_es: Conectando Todo
fi_fi: Yhdistämällä kaiken
fr_fr: Relier tous les éléments
hi_in: सब कुछ जोड़ना
id_id: Menghubungkan Segalanya
it_it: Collegare Tutto
ja_jp: すべてをつなぐ
ko_kr: 모든 것을 연결하기
nl_nl: Alles Verbinden
pl_pl: Łączenie Wszystkiego
pt_br: Conectando Tudo
ro_ro: Conectând totul
ru_ru: Связываем всё воедино
sv_se: Kopplar samman allt
th_th: เชื่อมโยงทุกสิ่ง
tr_tr: Her Şeyi Birbirine Bağlamak
uk_ua: З'єднання всього
vi_vn: Kết Nối Mọi Thứ
zh_cn: 融会贯通
zh_hk: 融匯貫通
zh_tw: 串聯一切

source: Consistency Validation
ar_sa: التحقق من الاتساق
da_dk: Konsistensvalidering
de_de: Konsistenzprüfung
el_gr: Έλεγχος Συνέπειας
es_es: Validación de consistencia
fi_fi: Johdonmukaisuustarkistus
fr_fr: Validation de cohérence
hi_in: सुसंगतता प्रमाणीकरण
id_id: Validasi Konsistensi
it_it: Convalida della coerenza
ja_jp: 整合性検証
ko_kr: 일관성 검증
nl_nl: Consistentievalidatie
pl_pl: Weryfikacja spójności
pt_br: Validação de Consistência
ro_ro: Validare de consistență
ru_ru: Проверка согласованности
sv_se: Konsistensvalidering
th_th: การตรวจสอบความสอดคล้อง
tr_tr: Tutarlılık Doğrulaması
uk_ua: Перевірка узгодженості
vi_vn: Xác thực tính nhất quán
zh_cn: 一致性验证
zh_hk: 一致性驗證
zh_tw: 一致性驗證

source: Deconstructing the 12-Tone System
ar_sa: تفكيك نظام الاثنتي عشرة نغمة
da_dk: Dekonstruktion af det 12-tonede system
de_de: Das 12-Ton-System dekonstruieren
el_gr: Αποδόμηση του Συστήματος των 12 Φθόγγων
es_es: Deconstruyendo el Sistema de 12 Tonos
fi_fi: 12-säveljärjestelmän purkaminen
fr_fr: Déconstruction du système à 12 tons
hi_in: 12-स्वर प्रणाली का विश्लेषण
id_id: Membedah Sistem 12-Nada
it_it: Decostruire il Sistema a 12 Toni
ja_jp: 12音階システムの解体
ko_kr: 12음계 체계 해부하기
nl_nl: Deconstructie van het 12-toonssysteem
pl_pl: Dekonstrukcja 12-tonowego systemu
pt_br: Desconstruindo o Sistema de 12 Tons
ro_ro: Deconstrucția Sistemului de 12 Tonuri
ru_ru: Деконструкция 12-тоновой системы
sv_se: Dekonstruerar det 12-tonssystemet
th_th: การแยกประกอบระบบ 12 เสียง
tr_tr: 12 Ton Sistemini Çözümlemek
uk_ua: Деконструювання 12-тонової системи
vi_vn: Giải Mã Hệ Thống 12 Âm
zh_cn: 解构十二音体系
zh_hk: 解構十二音體系
zh_tw: 解構十二音體系

source: Develop exclusively in UTC while the system automatically converts and displays dates in the user's local time zone.
ar_sa: طور بشكل حصري باستخدام التوقيت العالمي الموحد (UTC) بينما يقوم النظام تلقائيًا بتحويل التواريخ وعرضها بالتوقيت المحلي للمستخدم.
da_dk: Udvikl udelukkende i UTC, mens systemet automatisk konverterer og viser datoer i brugerens lokale tidszone.
de_de: Entwickeln Sie ausschließlich in UTC, während das System Datumsangaben automatisch in die lokale Zeitzone des Benutzers konvertiert und anzeigt.
el_gr: Αναπτύξτε αποκλειστικά στο UTC, ενώ το σύστημα μετατρέπει και εμφανίζει αυτόματα τις ημερομηνίες στην τοπική ώρα του χρήστη.
es_es: Desarrolle exclusivamente en UTC mientras el sistema convierte y muestra automáticamente las fechas en la zona horaria local del usuario.
fi_fi: Kehitä vain UTC:ssä, kunnes järjestelmä muuntaa ja näyttää päivämäärät käyttäjän paikalliseen aikavyöhön automaattisesti.
fr_fr: Développez exclusivement en UTC tandis que le système convertit et affiche automatiquement les dates dans le fuseau horaire local de l'utilisateur.
hi_in: यूटीसी में सिर्फ विकसित करें, जबकि सिस्टम स्वचालित रूप से उपयोगकर्ता के स्थानीय समय क्षेत्र में तारीखों को परिवर्तित और प्रदर्शित करता है।
id_id: Kembangkan secara eksklusif dalam UTC sementara sistem secara otomatis mengonversi dan menampilkan tanggal dalam zona waktu lokal pengguna.
it_it: Sviluppa esclusivamente in UTC mentre il sistema converte e visualizza automaticamente le date nell'ora locale dell'utente.
ja_jp: UTCで専用に開発し、システムが日時をユーザーのローカルタイムゾーンに自動的に変換して表示します。
ko_kr: UTC에서만 개발하되, 시스템은 사용자의 로컬 시간대에 맞게 날짜를 자동으로 변환하고 표시합니다.
nl_nl: Ontwikkel uitsluitend in UTC, terwijl het systeem data automatisch converteert en weergeeft in de lokale tijdzone van de gebruiker.
pl_pl: Twórz wyłącznie w strefie czasowej UTC, podczas gdy system automatycznie konwertuje i wyświetla daty w strefie czasowej użytkownika.
pt_br: Desenvolva exclusivamente em UTC, enquanto o sistema converte e exibe automaticamente as datas no fuso horário local do usuário.
ro_ro: Dezvoltați exclusiv în UTC, în timp ce sistemul convertește și afișează automat datele în fereastra de timp locală a utilizatorului.
ru_ru: Разрабатывайте исключительно в UTC, а система автоматически преобразует и отображает даты в часовом поясе пользователя.
sv_se: Utveckla uteslutande i UTC medan systemet automatiskt konverterar och visar datum i användarens lokala tidszon.
th_th: พัฒนาเฉพาะในเวลา UTC ในขณะที่ระบบจะแปลงและแสดงวันที่โดยอัตโนมัติเป็นเขตเวลาท้องถิ่นของผู้ใช้
tr_tr: UTC'de özel olarak geliştirin, sistem tarihleri otomatik olarak kullanıcının yerel saat dilimine dönüştürür ve görüntüler.
uk_ua: Розробляйте виключно в UTC, тоді як система автоматично перетворює та відображає дати у часовому поясі користувача.
vi_vn: Phát triển riêng biệt bằng múi giờ UTC trong khi hệ thống tự động chuyển đổi và hiển thị ngày tháng theo múi giờ địa phương của người dùng.
zh_cn: 在开发时请始终使用 UTC 时间，系统会自动将日期转换并显示为用户的本地时间。
zh_hk: 在 UTC 獨立開發，系統會自動將日期轉換並顯示為用戶的本地時間。
zh_tw: 開發時僅使用 UTC，系統會自動將日期轉換並顯示為使用者的本地時間。

# Dockerized for Easy Deployment
source: Dockerised for Easy Deployment
ar_sa: مُحَوَّل إلى Docker لتسهيل النشر
da_dk: Dockeriseret til nem installation
de_de: Dockerisiert für eine einfache Bereitstellung
el_gr: Διαμορφωμένο με Docker για εύκολη μεταφόρτωση
es_es: Dockerizado para una implementación sencilla
fi_fi: Docker-kehyttänyt helppokäyttöiseen käyttöönottoon
fr_fr: Dockerisé pour un déploiement simplifié
hi_in: डॉकराइज़्ड आसान डिप्लॉयमेंट के लिए
id_id: Dockerized untuk Deploi yang Mudah
it_it: Dockerizzato per un Deployment Facile
ja_jp: Docker対応でデプロイが簡単
ko_kr: Docker를 사용하여 간편 배포 가능
nl_nl: Dockerized voor eenvoudige implementatie
pl_pl: Zaopatrzony w Docker dla łatwego wdrożenia
pt_br: Dockerizado para Implantação Fácil
ro_ro: Dockerizat pentru o implementare ușoară
ru_ru: Dockerized for Easy Deployment
sv_se: Dockeriserat för enkel distribution
th_th: ใช้ Docker สำหรับการติดตั้งที่ง่าย
tr_tr: Docker ile Kolay Dağıtım İçin Hazır
uk_ua: Dockerized для легкого розгортання
vi_vn: Docker hóa để triển khai dễ dàng
zh_cn: 支持 Docker，轻松部署
zh_hk: Docker化以方便部署
zh_tw: Docker 化，輕鬆部署

source: Dynamic Navigation Bar
ar_sa: شريط التنقل الديناميكي
da_dk: Dynamisk navigation
de_de: Dynamische Navigationsleiste
el_gr: Δυναμική Γραμμή Πλοήγησης
es_es: Barra de navegación dinámica
fi_fi: Dynaaminen navigointipalkki
fr_fr: Barre de navigation dynamique
hi_in: डायनामिक नेविगेशन बार
id_id: Navigasi Dinamis
it_it: Barra di navigazione dinamica
ja_jp: 動的ナビゲーションバー
ko_kr: 동적 네비게이션 바
nl_nl: Dynamische navigatiebalk
pt_br: Barra de Navegação Dinâmica
ro_ro: Bară de navigare dinamică
ru_ru: Динамическая навигационная панель
sv_se: Dynamisk navigeringsfält
th_th: แถบนำทางแบบไดนามิก
tr_tr: Dinamik Gezinti Çubuğu
uk_ua: Динамічна панель навігації
vi_vn: Thanh điều hướng động
zh_cn: 动态导航栏
zh_hk: 動態導航列
zh_tw: 動態導覽列

source: Easily switch between database providers, including SQLite, MySQL, SQL Server, and an in-memory database for testing.
ar_sa: يمكنك بسهولة التبديل بين مزودي قواعد البيانات، بما في ذلك SQLite وMySQL وSQL Server وقاعدة بيانات داخل الذاكرة لاختبار البرامج.
da_dk: Skift nemt mellem databaseudbydere, herunder SQLite, MySQL, SQL Server og en i-hukommelsesdatabase til test.
de_de: Wechseln Sie einfach zwischen Datenbankanbietern, einschließlich SQLite, MySQL, SQL Server und einer in-Memory-Datenbank für Tests.
el_gr: Εύκολη αλλαγή μεταξύ παροχέων βάσης δεδομένων, συμπεριλαμβανομένου του SQLite, MySQL, SQL Server και μιας βάσης δεδομένων στη μνήμη για δοκιμές.
es_es: Cambia fácilmente entre proveedores de bases de datos, incluyendo SQLite, MySQL, SQL Server y una base de datos en memoria para pruebas.
fi_fi: Vaihda helposti tietokantapalvelimia, mukaan lukien SQLite, MySQL, SQL Server ja muistissa oleva tietokanta testaukseen.
fr_fr: Passez facilement d'un fournisseur de base de données à un autre, notamment SQLite, MySQL, SQL Server et une base de données en mémoire pour les tests.
hi_in: आसानी से डेटाबेस प्रदाताओं के बीच स्विच करें, जिसमें SQLite, MySQL, SQL Server, और परीक्षण के लिए एक इन-मेमोरी डेटाबेस शामिल है।
id_id: Dengan mudah beralih antara penyedia basis data, termasuk SQLite, MySQL, SQL Server, dan basis data dalam memori untuk pengujian.
it_it: Passa facilmente da un provider di database all'altro, inclusi SQLite, MySQL, SQL Server e un database in memoria per i test.
ja_jp: SQLite、MySQL、SQL Server、およびテスト用のインメモリデータベースを含む、データベースプロバイダ間を簡単に切り替えられます。
ko_kr: SQLite, MySQL, SQL Server, 그리고 테스트용 메모리 내 데이터베이스를 포함하여 데이터베이스 공급자를 쉽게 전환할 수 있습니다.
nl_nl: Eenvoudig wisselen tussen databaseproviders, inclusief SQLite, MySQL, SQL Server en een in-memory database voor testdoeleinden.
pl_pl: Łatwo przełączaj się między dostawcami baz danych, w tym SQLite, MySQL, SQL Server oraz pamięcią wewnętrznej do testowania.
pt_br: Mude facilmente entre provedores de banco de dados, incluindo SQLite, MySQL, SQL Server e um banco de dados em memória para testes.
ro_ro: Schimba ușor între furnizorii de baze de date, inclusiv SQLite, MySQL, SQL Server și o bază de date în memorie pentru testare.
ru_ru: Легко переключаться между поставщиками баз данных, включая SQLite, MySQL, SQL Server и базу данных в памяти для тестирования.
sv_se: Byt enkelt mellan databasleverantörer, inklusive SQLite, MySQL, SQL Server och en minnesdatabas för testning.
th_th: เปลี่ยนผู้ให้บริการฐานข้อมูลได้อย่างง่ายดาย รวมถึง SQLite, MySQL, SQL Server และฐานข้อมูลในหน่วยความจำสำหรับการทดสอบ
tr_tr: SQLite, MySQL, SQL Server ve test amaçlı bir bellek içi veritabanı dahil olmak üzere veritabanı sağlayıcıları arasında kolayca geçiş yapın.
uk_ua: Легко переключатися між постачальниками баз даних, включаючи SQLite, MySQL, SQL Server та ін-меморі додаток для тестування.
vi_vn: Chuyển đổi dễ dàng giữa các nhà cung cấp cơ sở dữ liệu, bao gồm SQLite, MySQL, SQL Server và cơ sở dữ liệu trong bộ nhớ dành cho kiểm thử.
zh_cn: 轻松在多种数据库提供程序之间切换，包括 SQLite、MySQL、SQL Server，以及用于测试的内存数据库。
zh_hk: 輕鬆切換不同的資料庫提供者，包括 SQLite、MySQL、SQL Server，以及用於測試的記憶體資料庫。
zh_tw: 輕鬆切換資料庫提供者，包含 SQLite、MySQL、SQL Server，以及用於測試的記憶體資料庫。

source: Effortlessly write integration tests using in-memory databases, temporary file systems, built-in mocking, and real-world HTTP request simulation.
ar_sa: اكتب اختبارات التكامل بسهولة باستخدام قواعد بيانات الذاكرة المؤقتة، وأنظمة ملفات مؤقتة، والمحاكاة المضمنة، ومحاكاة طلبات HTTP الحقيقية.
da_dk: Skriv integrations-tester let og nemt ved hjælp af minnebaserede databaser, midlertidige filsystemer, indbygget mockning og simulering af virkelige HTTP-anmodninger.
de_de: Schreiben Sie Integrationstests mühelos mit in-Memory-Datenbanken, temporären Dateisystemen, eingebautem Mocking und Simulation echter HTTP-Anfragen.
el_gr: Απλά και εύκολα γράψτε δοκιμές ενσωμάτωσης χρησιμοποιώντας μνήμης βάσεις δεδομένων, προσωρινά συστήματα αρχείων, ενσωματωμένη μοκάριση και πραγματική προσομοίωση αιτήσεων HTTP.
es_es: Escribe pruebas de integración sin esfuerzo utilizando bases de datos en memoria, sistemas de archivos temporales, mocking integrado y simulación de solicitudes HTTP del mundo real.
fi_fi: Kirjoita integraatiotestejä ilman vaivaa käyttäen muistin sisäisiä tietokantoja, väliaikaisia tiedostojärjestelmiä, sisäänrakennettua mockausta ja todellista HTTP-pyyntösimulaatiota.
fr_fr: Écrivez facilement des tests d'intégration en utilisant des bases de données en mémoire, des systèmes de fichiers temporaires, des simulations intégrées, et la simulation de requêtes HTTP du monde réel.
hi_in: अनुकूल रूप से इन्टीग्रेशन टेस्ट लिखें, इन-मेमोरी डेटाबेस, अस्थायी फाइल सिस्टम, बिल्ट-इन मॉकिंग और वास्तविक दुनिया के HTTP रिक्वेस्ट सिमुलेशन का उपयोग करके।
id_id: Tulis tes integrasi dengan mudah menggunakan basis data dalam memori, sistem file sementara, mocking bawaan, dan simulasi permintaan HTTP dunia nyata.
it_it: Scritta senza sforzo test di integrazione utilizzando database in memoria, sistemi di file temporanei, mock integrati e simulazione di richieste HTTP reali.
ja_jp: メモリ内データベース、一時ファイルシステム、組み込みモック、そして現実世界のHTTPリクエストシミュレーションを使って、簡単に統合テストを書くことができます。
ko_kr: 메모리 내 데이터베이스, 임시 파일 시스템, 내장 모킹, 그리고 실제 세계의 HTTP 요청 시뮬레이션을 사용하여 통합 테스트를 쉽게 작성하세요.
nl_nl: Schrijf eenvoudig integratietests met behulp van in-memory databases, tijdelijke bestandssystemen, ingebouwde mocking en simulatie van werkelijke HTTP-verzoeken.
pl_pl: Bezproblemowo twórz testy integracyjne wykorzystując pamięć podręczną baz danych, tymczasowe systemy plików, wbudowane mockowanie oraz symulację rzeczywistych żądań HTTP.
pt_br: Escreva testes de integração de forma fácil usando bancos de dados em memória, sistemas de arquivos temporários, mocking embutido e simulação de requisições HTTP do mundo real.
ro_ro: Scrieți ușor teste de integrare folosind baze de date în memorie, sisteme de fișiere temporare, mock-uri integrate și simulare de cereri HTTP din lumea reală.
ru_ru: Без усилий пишите интеграционные тесты с использованием баз данных в памяти, временных файловых систем, встроенной эмуляции и имитации реальных HTTP-запросов.
sv_se: Skriv integrerationstester utan ansträngning med minnesdatabaser, temporära filsystem, inbyggd mockning och simulering av verkliga HTTP-begäran.
th_th: เขียนการทดสอบการรวมระบบได้อย่างง่ายดาย โดยใช้ฐานข้อมูลในหน่วยความจำ ระบบไฟล์ชั่วคราว การจำลองแบบที่มีอยู่ในตัว และการจำลองการร้องขอ HTTP แบบจริงในโลกแห่งความเป็นจริง
tr_tr: Bellek içi veritabanları, geçici dosya sistemleri, yerleşik mocklama ve gerçek dünya HTTP isteği simülasyonu kullanarak entegrasyon testlerini kolayca yazın.
uk_ua: Легко пишіть інтеграційні тести, використовуючи вбудовані бази даних, тимчасові файлові системи, вбудоване мокування та симуляцію реальних HTTP-запитів.
vi_vn: Viết các bài kiểm thử tích hợp một cách dễ dàng bằng cách sử dụng cơ sở dữ liệu trong bộ nhớ, hệ thống tệp tạm thời, mô phỏng tích hợp sẵn và mô phỏng yêu cầu HTTP thực tế.
zh_cn: 轻松使用内存数据库、临时文件系统、内置模拟和真实世界的 HTTP 请求模拟编写集成测试。
zh_hk: 輕鬆撰寫整合測試，使用記憶體資料庫、暫存檔案系統、內建模擬功能，以及真實世界的 HTTP 請求模擬。
zh_tw: 輕鬆撰寫整合測試，使用記憶體資料庫、暫存檔案系統、內建模擬功能，以及真實世界的 HTTP 請求模擬。

# Explore Major
source: Explore Major Keys
ar_sa: استكشف السلم الكبير
da_dk: Udforsk Dur
de_de: Dur-Tonarten erkunden
el_gr: Εξερευνήστε τη Ματζόρε
es_es: Explorar Mayor
fi_fi: Tutustu duuriin
fr_fr: Explorer les gammes majeures
hi_in: मेजर एक्सप्लोर करें
id_id: Jelajahi Mayor
it_it: Esplora il Maggiore
ja_jp: 長調を探る
ko_kr: 장조 탐험하기
nl_nl: Verken Majeur
pl_pl: Eksploruj Dur
pt_br: Explorar Maior
ro_ro: Explorează Tonurile Majore
ru_ru: Исследовать мажор
sv_se: Utforska dur
th_th: สำรวจบันไดเสียงเมเจอร์
tr_tr: Majör'ü Keşfedin
uk_ua: Дослідити мажор
vi_vn: Khám Phá Trưởng
zh_cn: 探索大调
zh_hk: 探索大調
zh_tw: 探索大調

source: Explore Minor
ar_sa: استكشف المقامات الصغيرة
da_dk: Udforsk Dur
de_de: Moll erkunden
el_gr: Εξερευνήστε την Ελάσσονα
es_es: Explorar Modo Menor
fi_fi: Tutustu molliasteikkoon
fr_fr: Explorer les Modes Mineurs
hi_in: माइनर एक्सप्लोर करें
id_id: Jelajahi Minor
it_it: Esplora il Minore
ja_jp: 短調を探る
ko_kr: 단조 탐색하기
nl_nl: Verken Mineur
pl_pl: Eksploruj Tonacje Molowe
pt_br: Explorar Menor
ro_ro: Explorează Minorul
ru_ru: Исследовать минор
sv_se: Utforska moll
th_th: สำรวจบันไดเสียงไมเนอร์
tr_tr: Minör'ü Keşfet
uk_ua: Дослідити мінор
vi_vn: Khám Phá Âm Giai Thứ
zh_cn: 探索小调
zh_hk: 探索小調
zh_tw: 探索小調
