Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

# &apos;See&apos; the Language of Music
source: 'See' the Language of Music
ar_sa: "اِشْهَد" لُغَةَ المُوسِيقَى
da_dk: 'Se' Musikens Sprog
de_de: Die ‚Sprache‘ der Musik ‚sehen‘
el_gr: «Δες» τη Γλώσσα της Μουσικής
es_es: "Ver" el Lenguaje de la Música
fi_fi: 'Näe' musiikin kieltä
fr_fr: « Voir » le Langage de la Musique
hi_in: संगीत की भाषा को 'देखें'
id_id: 'Melihat' Bahasa Musik
it_it: "Vedere" il Linguaggio della Musica
ja_jp: 音楽の言葉を「見る」
ko_kr: 음악의 언어를 '시각화'하다
nl_nl: 'Zie' de Taal van Muziek
pl_pl: „Zobacz” Język Muzyki
pt_br: 'Veja' a Linguagem da Música
ro_ro: „Vedeți” Limba Muzicii
ru_ru: «Увидеть» язык музыки
sv_se: 'Se' musikens språk
th_th: 'มองเห็น' ภาษาของดนตรี
tr_tr: Müziğin Dilini 'Görün'
uk_ua: «Побачити» мову музики
vi_vn: 'Thấy' Ngôn Ngữ Của Âm Nhạc
zh_cn: “看见”音乐的语言
zh_hk: 「睇」見音樂嘅語言
zh_tw: 「看見」音樂的語言

source: "Fire-and-forget" support for long-running tasks (like emails or AI), featuring a GUI for queue management, parallel processing, and cancellation.
ar_sa: دعم "Fire-and-forget" للمهام الطويلة (مثل البريد الإلكتروني أو الذكاء الاصطناعي)، يشمل واجهة رسومية لإدارة الطابور، والمعالجة المتوازية، والإلغاء.
da_dk: "Fire-and-forget"-støtte til langvarige opgaver (som emails eller AI), med en brugergrænseflade til køhåndtering, parallell behandling og afbrydelse.
de_de: "Fire-and-forget"-Unterstützung für langlaufende Aufgaben (z. B. E-Mails oder KI), mit einer GUI zur Warteschlangenverwaltung, paralleler Verarbeitung und Abbruchfunktion.
el_gr: Υποστήριξη "Fire-and-forget" για μακροχρόνιες εργασίες (όπως ηλεκτρονικά ταχυδρομεία ή ΤΝ), με διεπαφή χρήστη για διαχείριση ουράς, παράλληλη επεξεργασία και ακύρωση.
es_es: Soporte "fire-and-forget" para tareas de larga duración (como correos electrónicos o IA), con una interfaz gráfica para la gestión de colas, procesamiento paralelo y cancelación.
fi_fi: "Tule ja unohda" -tuki pitkäkestoisille tehtäville (kuten sähköposteille tai tekoälylle), jossa on käyttöliittymä jonon hallintaan, rinnakkaisprosessointiin ja peruutukseen.
fr_fr: Prise en charge « fire-and-forget » des tâches longues (comme les e-mails ou l'IA), avec une interface graphique pour la gestion de file d'attente, le traitement parallèle et l'annulation.
hi_in: लंबे समय तक चलने वाले कार्यों (जैसे ईमेल या एआई) के लिए "फायर-एंड-फॉरगेट" समर्थन, जिसमें कतार प्रबंधन, समानांतर प्रसंस्करण और रद्द करने के लिए एक GUI शामिल है।
id_id: Dukungan "fire-and-forget" untuk tugas berjalan lama (seperti email atau AI), dilengkapi antarmuka GUI untuk manajemen antrian, pemrosesan paralel, dan pembatalan.
it_it: Supporto "fire-and-forget" per attività di lunga durata (come email o IA), con interfaccia grafica per la gestione della coda, elaborazione parallela e annullamento.
ja_jp: 長時間実行タスク（メールやAIなど）に対する「ファイア・アンド・フォーゲット」サポート。キュー管理、並列処理、キャンセルに対応するGUIを備えています。
ko_kr: 긴 실행 시간 작업(예: 이메일 또는 AI)에 대한 "파이어 앤 포겟"(Fire-and-forget) 지원, 대기열 관리, 병렬 처리 및 취소 기능이 포함된 GUI를 제공합니다.
nl_nl: "Fire-and-forget"-ondersteuning voor langlopende taken (zoals e-mails of AI), met een GUI voor wachtrijbeheer, parallelle verwerking en annulering.
pl_pl: Obsługa „wystrzel i zapomnij” dla długotrwałych zadań (np. e-maile lub AI), z GUI do zarządzania kolejką, przetwarzania równoległego i anulowania.
pt_br: Suporte "fire-and-forget" para tarefas de longa duração (como e-mails ou IA), com interface gráfica para gerenciamento de fila, processamento paralelo e cancelamento.
ro_ro: Suport pentru sarcini de lungă durată (cum ar fi e-mailurile sau AI) de tip "fire-and-forget", cu o interfață grafică pentru gestionarea cozii, procesare paralelă și anulare.
ru_ru: Поддержка "огонь и забыть" для длительных задач (например, электронной почты или ИИ), с графическим интерфейсом для управления очередями, параллельной обработки и отмены.
sv_se: Stöd för "fire-and-forget" för långvariga uppgifter (t.ex. e-post eller AI), med en GUI för köhantering, parallell bearbetning och avbrytning.
th_th: การสนับสนุนแบบ "Fire-and-forget" สำหรับงานที่ใช้เวลานาน (เช่น อีเมลหรือ AI) พร้อมอินเทอร์เฟซผู้ใช้กราฟิก (GUI) สำหรับการจัดการคิว การประมวลผลแบบขนาน และการยกเลิก
tr_tr: Uzun çalışma süresi gerektiren görevler (e-postalar veya AI gibi) için "Fire-and-forget" desteği, sırayı yönetme, paralel işlem ve iptal için bir GUI ile birlikte.
uk_ua: Підтримка «відправив і забув» для довготривалих завдань (наприклад, електронної пошти або штучного інтелекту), із графічним інтерфейсом для керування чергою, паралельною обробкою та скасуванням.
vi_vn: Hỗ trợ kiểu "bắn và quên" cho các tác vụ kéo dài (như email hoặc AI), tích hợp giao diện người dùng (GUI) để quản lý hàng đợi, xử lý song song và hủy bỏ.
zh_cn: “火速执行”支持长时间运行的任务（如发送邮件或人工智能），配备用于队列管理、并行处理和取消的图形用户界面。
zh_hk: 「即發即忘」支援長時間執行的任務（例如電郵或人工智慧），具備圖形使用者介面以管理佇列、平行處理及取消功能。
zh_tw: 「發射後不管」支援長時間執行的任務（例如電子郵件或人工智慧），具備用於佇列管理、平行處理與取消作業的圖形使用者介面。

source: A built-in Role-Based Access Control (RBAC) system for fine-grained permission management.
ar_sa: نظام مدمج للتحكم بالوصول بناءً على الصلاحيات (RBAC) لإدارة الصلاحيات بدرجة دقيقة.
da_dk: En indbygget system til adgangsstyring baseret på roller (RBAC) til detaljeret tilladelsesstyring.
de_de: Ein integriertes System für rollenbasierten Zugriffskontrolle (RBAC) für feinabgestimmte Berechtigungsverwaltung.
el_gr: Ένα ενσωματωμένο σύστημα διαχείρισης προσβάσεων με βάση τους ρόλους (RBAC) για λεπτομερή διαχείριση δικαιωμάτων.
es_es: Un sistema integrado de control de acceso basado en roles (RBAC) para la gestión detallada de permisos.
fi_fi: Sisäänrakennettu roolipohjainen pääsyvalvonta (RBAC) -järjestelmä tarkkaan säätöön tarkoitetuille käyttöoikeuksille.
fr_fr: Un système intégré de contrôle d'accès basé sur les rôles (RBAC) pour une gestion fine des autorisations.
hi_in: एक निर्मित भूमिका-आधारित पहुँच नियंत्रण (RBAC) प्रणाली सूक्ष्म अनुमति प्रबंधन के लिए।
id_id: Sistem kontrol akses berbasis peran (RBAC) bawaan untuk manajemen izin yang halus.
it_it: Un sistema di controllo degli accessi basato sui ruoli (RBAC) integrato per la gestione avanzata dei permessi.
ja_jp: 細粒度の権限管理向けに組み込みのロールベースアクセス制御 (RBAC) システム。
ko_kr: 세부적인 권한 관리를 위한 내장형 역할 기반 접근 제어(RBAC) 시스템
nl_nl: Een ingebouwd systeem voor Role-Based Access Control (RBAC) voor gedetailleerde machtigingsbeheer.
pl_pl: Wbudowany system kontroli dostępu opartej na rolach (RBAC) do szczegółowego zarządzania uprawnieniami.
pt_br: Um sistema integrado de Controle de Acesso Baseado em Papéis (RBAC) para gerenciamento de permissões granular.
ro_ro: Un sistem integrat de control al accesului bazat pe roluri (RBAC) pentru gestionarea fină a permisiunilor.
ru_ru: Встроенная система управления доступом на основе ролей (RBAC) для тонкого управления разрешениями.
sv_se: En inbyggd system för rollbaserad åtkomstkontroll (RBAC) för detaljerad behörighetshantering.
th_th: ระบบควบคุมการเข้าถึงตามบทบาท (RBAC) แบบฝังในตัว สำหรับการจัดการสิทธิ์อย่างละเอียด
tr_tr: İnce ayrıntılı izin yönetimi için yerleşik Rol Temelli Erişim Kontrolü (RBAC) sistemi.
uk_ua: Вбудована система керування доступом на основі ролей (RBAC) для детального керування дозволами.
vi_vn: Hệ thống kiểm soát truy cập dựa trên vai trò (RBAC) tích hợp sẵn để quản lý quyền hạn chi tiết.
zh_cn: 内置的角色权限访问控制（RBAC）系统，支持细粒度的权限管理。
zh_hk: 內建的基於角色的存取控制（RBAC）系統，支援細粒度的權限管理。
zh_tw: 內建的基於角色的存取控制 (RBAC) 系統，用於細粒度的權限管理。

source: A complete solution for user authentication and profile management.
ar_sa: حل شامل لإدارة المصادقة للمستخدم وإدارة الملفات الشخصية.
da_dk: En komplet løsning til brugerautentificering og profilhåndtering.
de_de: Eine vollständige Lösung für Benutzer-Authentifizierung und Profilverwaltung.
el_gr: Μια εντελώς ενσωματωμένη λύση για την εξουσιοδότηση χρηστών και τη διαχείριση προφίλ.
es_es: Una solución completa para la autenticación de usuarios y la gestión de perfiles.
fi_fi: Täydellinen ratkaisu käyttäjätunnistukseen ja profiilin hallintaan.
fr_fr: Une solution complète pour l'authentification des utilisateurs et la gestion des profils.
hi_in: उपयोगकर्ता प्रमाणीकरण और प्रोफ़ाइल प्रबंधन के लिए एक पूर्ण समाधान।
id_id: Solusi lengkap untuk otentikasi pengguna dan manajemen profil.
it_it: Una soluzione completa per l'autenticazione degli utenti e la gestione dei profili.
ja_jp: ユーザー認証およびプロファイル管理のための包括的なソリューション
ko_kr: 사용자 인증 및 프로필 관리를 위한 완전한 솔루션
nl_nl: Een complete oplossing voor gebruikersauthenticatie en profielbeheer.
pl_pl: Pełne rozwiązanie do uwierzytelniania użytkowników i zarządzania profilami.
pt_br: Uma solução completa para autenticação de usuário e gerenciamento de perfis.
ro_ro: O soluție completă pentru autentificarea utilizatorilor și gestionarea profilurilor.
ru_ru: Полное решение для аутентификации пользователей и управления профилями.
sv_se: En komplett lösning för användarautentisering och profilhantering.
th_th: โซลูชันครบวงจรสำหรับการยืนยันตัวตนของผู้ใช้และการจัดการโปรไฟล์
tr_tr: Kullanıcı kimlik doğrulaması ve profil yönetimi için tam çözüm
uk_ua: Повний рішення для автентифікації користувачів та управління профілями.
vi_vn: Một giải pháp toàn diện cho xác thực người dùng và quản lý hồ sơ.
zh_cn: 用户身份验证和资料管理的完整解决方案
zh_hk: 一套完整的用戶身分驗證及個人資料管理方案
zh_tw: 使用者身分驗證與個人檔案管理的完整解決方案。

source: A fully responsive layout that looks great on both desktop and mobile devices.
ar_sa: تصميم متجاوب بالكامل يظهر بشكل رائع على كل من أجهزة السطحية والأجهزة المحمولة.
da_dk: En fuldt responsiv layout, der ser flot ud på både desktop- og mobilenheder.
de_de: Eine vollständig responsive Layout, das sowohl auf Desktop- als auch auf Mobilgeräten hervorragend aussieht.
el_gr: Μια πλήρως ευανάγνωστη διάταξη που φαίνεται εξαιρετικά καλή σε τόσο επιφάνεια εργασίας όσο και σε κινητά συσκευή.
es_es: Una disposición completamente adaptable que tiene buen aspecto tanto en ordenadores de escritorio como en dispositivos móviles.
fi_fi: Täysin reagoiva asettelu, joka näyttää hienolta sekä työasemalla että mobiililaitteilla.
fr_fr: Un design entièrement réactif qui a bon aspect à la fois sur les ordinateurs de bureau et les appareils mobiles.
hi_in: एक पूरी तरह से अनुकूलित लेआउट जो डेस्कटॉप और मोबाइल डिवाइस दोनों पर शानदार दिखता है।
id_id: Tata letak yang sepenuhnya responsif dan terlihat bagus di perangkat desktop maupun mobile.
it_it: Un layout completamente responsive che ha un ottimo aspetto sia sui dispositivi desktop che su quelli mobili.
ja_jp: デスクトップおよびモバイルデバイスの両方で見栄えが素晴らしい完全に応答性のあるレイアウト
ko_kr: 데스크톱과 모바일 기기 양쪽에서 멋지게 보이는 완전히 반응형 레이아웃입니다.
nl_nl: Een volledig responsieve lay-out die er goed uit ziet op zowel desktop- als mobiele apparaten.
pl_pl: Pełna odpowiedź układu, który wygląda świetnie zarówno na komputerach stacjonarnych, jak i urządzeniach mobilnych.
pt_br: Um layout totalmente responsivo que fica ótimo tanto em dispositivos desktop quanto móveis.
ro_ro: Un layout complet responsive care arată excelent atât pe desktop, cât și pe dispozitive mobile.
ru_ru: Полностью адаптивный макет, который выглядит отлично как на настольных, так и на мобильных устройствах.
sv_se: En helt responsiv layout som ser bra ut både på skrivbord och mobilenheter.
th_th: รูปแบบที่ปรับตัวได้ทั้งหมด ซึ่งดูดีบนอุปกรณ์เดสก์ท็อปและมือถือทั้งสองอย่าง
tr_tr: Tamamen uyumlu bir düzen, hem masaüstü hem de mobil cihazlarda harika görünür.
uk_ua: Повністю адаптивний макет, який гарно виглядає як на стаціонарних, так і на мобільних пристроях.
vi_vn: Một bố cục hoàn toàn phản hồi, trông tuyệt vời trên cả thiết bị để bàn và thiết bị di động.
zh_cn: 一个完全响应式的布局，在桌面和移动设备上都能呈现出色效果。
zh_hk: 一個完全響應式的佈局，無論在桌面還是流動裝置上都能呈現出優秀的外觀。
zh_tw: 完全響應式的版面，無論在桌面還是行動裝置上都能呈現出優異的外觀。

source: A modern, feature-rich, and highly extensible foundation for your next web application.
ar_sa: أساس حديث، غني بالميزات، وقابل للتوسيع بشكل كبير لتطبيق الويب التالي الخاص بك.
da_dk: En moderne, funktionstæt og højt udvidelsesbar grundlag til din næste webapplikation.
de_de: Eine moderne, leistungsstarke und hocherweiterbare Grundlage für Ihre nächste Webanwendung.
el_gr: Μια σύγχρονη, πλούσια σε λειτουργίες και υψηλά εκτείσιμη βάση για την επόμενη σας εφαρμογή για το διαδίκτυο.
es_es: Una base moderna, con muchas funciones y altamente extensible para su próxima aplicación web.
fi_fi: Moderni, ominaisuudeltaan rikas ja korkeasti laajennettava pohja seuraavalle verkkosovelluksellesi.
fr_fr: Une base moderne, riche en fonctionnalités et hautement extensible pour votre prochaine application web.
hi_in: अपने अगले वेब एप्लिकेशन के लिए एक आधुनिक, फीचर-समृद्ध और बहुत अधिक विस्तारयोग्य आधार।
id_id: Dasar yang modern, kaya fitur, dan sangat dapat diperluas untuk aplikasi web Anda berikutnya.
it_it: Una base moderna, ricca di funzionalità e altamente estensibile per il tuo prossimo'applicazione web.
ja_jp: 次回のWebアプリケーション用のモダンで機能豊富かつ高拡張性の基盤です。
ko_kr: 다음 웹 애플리케이션을 위한 현대적이고 기능이 풍부하며 매우 확장 가능한 기반
nl_nl: Een modern, functierijk en zeer uitbreidbaar fundament voor je volgende webapplicatie.
pl_pl: Nowoczesna, bogata w funkcje i bardzo rozszerzalna podstawa dla Twojej następnej aplikacji internetowej.
pt_br: Uma base moderna, com muitos recursos e altamente extensível para o seu próximo aplicativo web.
ro_ro: O bază modernă, bogată în funcționalități și extrem de extensibilă pentru aplicația web următoare.
ru_ru: Современная, насыщенная функциями и высокопроизводительная основа для вашего следующего веб-приложения.
sv_se: En modern, funktionsrik och mycket utbyggbar grund för ditt nästa webbapplikation.
th_th: รากฐานที่ทันสมัย ครบครันด้วยคุณสมบัติ และขยายได้อย่างยืดหยุ่นสูง สำหรับแอปพลิเคชันเว็บของคุณในครั้งต่อไป
tr_tr: Sıradışı, özellik zengini ve çok yönlü, bir sonraki web uygulamanız için sağlam bir temel.
uk_ua: Сучасна, функціональна та дуже розширювана основа для вашого наступного веб-додатку.
vi_vn: Một nền tảng hiện đại, đầy đủ tính năng và có khả năng mở rộng cao cho ứng dụng web tiếp theo của bạn.
zh_cn: 一个现代化、功能丰富且高度可扩展的平台，用于构建您的下一个 Web 应用程序。
zh_hk: 一個現代、功能豐富且高度可擴展的基礎架構，助您打造下一個網頁應用程式。
zh_tw: 一個現代、功能豐富且高度可擴展的基礎架構，為您的下一個網路應用程式提供支援。

source: A simple and reliable metronome to help you keep time.
ar_sa: معقّم بسيط وموثوق لمساعدتك على الحفاظ على الإيقاع.
de_de: Ein einfacher und zuverlässiger Metronom, um Ihnen bei der Zeithaltung zu helfen.
el_gr: Ένας απλός και αξιόπιστος μετρονόμος για να σας βοηθήσει να κρατήσετε το ρυθμό.
es_es: Un metrónomo sencillo y fiable para ayudarte a mantener el compás.
fi_fi: Yksinkertainen ja luotettava metronomi, joka auttaa sinua pitämään aikaa.
fr_fr: Un métronome simple et fiable pour vous aider à garder le tempo.
hi_in: समय बनाए रखने में मदद करने वाला एक सरल और विश्वसनीय मेट्रोनोम।
it_it: Un metronomo semplice e affidabile per aiutarti a mantenere il tempo.
ko_kr: 간단하고 신뢰할 수 있는 메트로놈으로 시간을 지키는 데 도움을 드립니다.
nl_nl: Een eenvoudige en betrouwbare metronoom om je tijd te houden.
pl_pl: Prosty i niezawodny metronom pomagający utrzymać tempo.
pt_br: Um metrônomo simples e confiável para ajudá-lo a manter o tempo.
ro_ro: Un metronom simplu și sigur pentru a vă ajuta să păstrați ritmul.
sv_se: En enkel och pålitlig metronom för att hjälpa dig att hålla takt.
tr_tr: Zaman tutmanıza yardımcı olacak basit ve güvenilir bir metronom.
uk_ua: Простий і надійний метроном, щоб допомогти вам тримати ритм.
zh_cn: 一个简单可靠的节拍器，帮助您掌握节奏。
zh_hk: 一個簡單而可靠的節拍器，助你準確掌握節奏。
zh_tw: 一個簡單且可靠的節拍器，幫助您掌握節奏。

source: AI-Powered Translations
ar_sa: ترجمة مدعومة بالذكاء الاصطناعي
da_dk: AI-drevne oversættelser
de_de: KI-gestützte Übersetzungen
el_gr: Μεταφράσεις με Τεχνητή Νοημοσύνη
es_es: Traducciones impulsadas por IA
fi_fi: AI-voimaiset käännökset
fr_fr: Traductions alimentées par l'IA
hi_in: एआई-संचालित अनुवाद
id_id: Terjemahan Berbasis AI
it_it: Traduzioni potenziate dall'IA
ja_jp: AI対応翻訳
ko_kr: AI 기반 번역
nl_nl: AI-geïntegreerde vertalingen
pl_pl: AI-Przygotowane Tłumaczenia
pt_br: Traduções com Inteligência Artificial
ro_ro: Traduceri accelerate de inteligență artificială
ru_ru: AI-поддерживаемые переводы
sv_se: AI-drivna översättningar
th_th: การแปลด้วยปัญญาประดิษฐ์
tr_tr: Yapay Zeka Destekli Çeviriler
uk_ua: AI-підібрані переклади
vi_vn: Dịch thuật được hỗ trợ bởi AI
zh_cn: AI驱动的翻译
zh_hk: 人工智能驅動翻譯
zh_tw: AI驅動的翻譯

source: All dependencies are automatically registered and always available via constructor injection.
ar_sa: جميع الاعتماديات تُسجّل تلقائيًا وتكون دائمًا متاحة عبر التغذية بالإنشاء.
da_dk: Alle afhængigheder registreres automatisk og er altid tilgængelige via konstruktør-injektion.
de_de: Alle Abhängigkeiten werden automatisch registriert und über Konstruktoreinbettung immer verfügbar gemacht.
el_gr: Όλες οι εξαρτήσεις εγγράφονται αυτόματα και είναι πάντα διαθέσιμες μέσω εισαγωγής διαμέσου κατασκευαστή.
es_es: Todas las dependencias se registran automáticamente y siempre están disponibles mediante inyección de constructor.
fi_fi: Kaikki riippuvuudet rekisteröidään automaattisesti ja ne ovat aina käytettävissä konstruktorin injektion kautta.
fr_fr: Toutes les dépendances sont automatiquement enregistrées et toujours disponibles via l'injection de dépendances par constructeur.
hi_in: सभी निर्भरताएँ स्वचालित रूप से पंजीकृत हैं और कंस्ट्रक्टर इंजेक्शन के माध्यम से हमेशा उपलब्ध हैं।
id_id: Semua dependensi secara otomatis terdaftar dan selalu tersedia melalui injeksi konstruktor.
it_it: Tutte le dipendenze vengono registrate automaticamente e sono sempre disponibili tramite injection del costruttore.
ja_jp: すべての依存関係が自動的に登録され、コンストラクタインジェクション経由で常に利用可能になります。
ko_kr: 모든 종속 항목은 자동으로 등록되며 생성자 주입을 통해 항상 사용할 수 있습니다.
nl_nl: Alle afhankelijkheden worden automatisch geregistreerd en altijd beschikbaar via constructorinjection.
pl_pl: Wszystkie zależności są automatycznie rejestrowane i zawsze dostępne przez wstrzykiwanie konstruktora.
pt_br: Todas as dependências são registradas automaticamente e sempre disponíveis por meio de injeção de construtor.
ro_ro: Toate dependențele sunt înregistrate automat și sunt întotdeauna disponibile prin injecția de constructor.
ru_ru: Все зависимости автоматически регистрируются и всегда доступны через внедрение конструктора.
sv_se: All beroenden registreras automatiskt och är alltid tillgängliga via konstruktörsinjektion.
th_th: ทุกการพึ่งพาจะถูกลงทะเบียนโดยอัตโนมัติและพร้อมใช้งานตลอดเวลาผ่านการแทรกซึมผ่านคอนสตรักเตอร์
tr_tr: Tüm bağımlılıklar otomatik olarak kaydedilir ve her zaman constructor enjeksiyonu aracılığıyla kullanılabilir olur.
uk_ua: Всі залежності автоматично реєструються і завжди доступні через ін'єкцію конструктора.
vi_vn: Tất cả các phụ thuộc được đăng ký tự động và luôn sẵn sàng thông qua chèn vào hàm tạo.
zh_cn: 所有依赖项都会自动注册，并始终可通过构造函数注入使用。
zh_hk: 所有相依項目均會自動註冊，並可透過建構函式注入隨時存取。
zh_tw: 所有相依性都會自動註冊，並可透過建構子插入隨時取得。

source: Automatic Dark Mode
ar_sa: الوضع الداكن التلقائي
da_dk: Automatisk mørk tilstand
de_de: Automatischer Dunkelmodus
el_gr: Αυτόματο Σκοτεινό Θέμα
es_es: Modo oscuro automático
fi_fi: Automaattinen tumma tila
fr_fr: Mode sombre automatique
hi_in: स्वचालित डार्क मोड
id_id: Mode Gelap Otomatis
it_it: Modalità Notturna Automatica
ja_jp: 自動ダークモード
ko_kr: 자동 어두운 모드
nl_nl: Automatische donkere modus
pl_pl: Automatyczny tryb ciemny
pt_br: Modo Escuro Automático
ro_ro: Mod automat întunecat
ru_ru: Автоматический темный режим
sv_se: Automatisk mörkt läge
th_th: โหมดมืดอัตโนมัติ
tr_tr: Otomatik Koyu Mod
uk_ua: Автоматичний темний режим
vi_vn: Chế độ tối tự động
zh_cn: 自动深色模式
zh_hk: 自動深色模式
zh_tw: 自動深色模式

source: Automatic Dependency Injection
ar_sa: إدخال الاعتماد تلقائيًا
da_dk: Automatisk afhængighedsinjektion
de_de: Automatische Abhängigkeitsinjektion
el_gr: Αυτόματη Εισαγωγή Εξαρτήσεων
es_es: Inyección automática de dependencias
fi_fi: Automaattinen riippuvuuden injektio
fr_fr: Injection de dépendances automatique
hi_in: स्वचालित निर्भरता निवेशन
id_id: Injeksi Ketergantungan Otomatis
it_it: Iniezione Automatica delle Dipendenze
ja_jp: 自動依存関係注入
ko_kr: 자동 종속성 주입
nl_nl: Automatische afhankelijkheidsinjectie
pl_pl: Automatyczna Iniekcja Zależności
pt_br: Injeção Automática de Dependências
ro_ro: Injecție automată de dependențe
ru_ru: Автоматическая внедрение зависимостей
sv_se: Automatisk beroendespridning
th_th: การแทรกซึมการพึ่งพาอัตโนมัติ
tr_tr: Otomatik Bağımlılık Enjeksiyonu
uk_ua: Автоматичне впровадження залежностей
vi_vn: Tiêm phụ thuộc tự động
zh_cn: 自动依赖注入
zh_hk: 自動依賴注入
zh_tw: 自動相依性插入

source: Automatic Time Zone Handling
ar_sa: التعامل التلقائي مع نطاقات الزمن
da_dk: Automatisk tidszonenhåndtering
de_de: Automatische Zeitzone-Verwaltung
el_gr: Αυτόματη Χειρισμός Ζώνης Ώρας
es_es: Manejo automático de husos horarios
fi_fi: Automaattinen aikavyöhykkeen käsittely
fr_fr: Gestion automatique des fuseaux horaires
hi_in: स्वचालित समय क्षेत्र प्रबंधन
id_id: Penanganan Zona Waktu Otomatis
it_it: Gestione automatica dell'ora locale
ja_jp: 自動時間帯処理
ko_kr: 자동 시간대 처리
nl_nl: Automatische tijdzonebehandeling
pl_pl: Automatyczne obsługiwanie stref czasowych
pt_br: Gerenciamento Automático de Fuso Horário
ro_ro: Gestionare automată a fusurilor orare
ru_ru: Автоматическое управление часовым поясом
sv_se: Automatisk tidszonhantering
th_th: การจัดการเขตเวลาแบบอัตโนมัติ
tr_tr: Otomatik Saat Dilimi İşleme
uk_ua: Автоматичне управління часовими зонами
vi_vn: Xử lý múi giờ tự động
zh_cn: 自动时区处理
zh_hk: 自動時區處理
zh_tw: 自動時區處理

source: Automatic, AI-driven translation into 28 languages.
ar_sa: ترجمة تلقائية، مدعومة بالذكاء الاصطناعي، إلى 28 لغة.
da_dk: Automatisk, AI-drevet oversættelse til 28 sprog.
de_de: Automatische, künstliche Intelligenz-gestützte Übersetzung in 28 Sprachen.
el_gr: Αυτόματη, προωθούμενη από τεχνητή νοημοσύνη μετάφραση σε 28 γλώσσες.
es_es: Traducción automática, impulsada por IA, a 28 idiomas.
fi_fi: Automaattinen, tekoälyohjattu käännös 28 kielelle.
fr_fr: Traduction automatique, pilotée par l'IA, en 28 langues.
hi_in: स्वचालित, एआई-चालित 28 भाषाओं में अनुवाद।
id_id: Terjemahan otomatis, didorong oleh AI ke dalam 28 bahasa.
it_it: Traduzione automatica, guidata dall'IA, in 28 lingue.
ja_jp: 自動、AI駆動の28言語への翻訳
ko_kr: 자동으로 AI 기반 번역이 28개 언어로 가능합니다.
nl_nl: Automatische, AI-gebaseerde vertaling in 28 talen.
pl_pl: Automatyczne, oparte na AI tłumaczenie na 28 języków.
pt_br: Tradução automática, com inteligência artificial, para 28 idiomas.
ro_ro: Traducere automată, alimentată de inteligență artificială, în 28 de limbi.
ru_ru: Автоматический перевод с использованием ИИ на 28 языков.
sv_se: Automatisk, AI-driven översättning till 28 språk.
th_th: การแปลอัตโนมัติที่ขับเคลื่อนด้วยปัญญาประดิษฐ์ รองรับ 28 ภาษา
tr_tr: Otomatik, yapay zeka destekli 28 dilde çeviri.
uk_ua: Автоматична, з використанням штучного інтелекту переклад на 28 мов.
vi_vn: Dịch thuật tự động, được điều khiển bởi AI sang 28 ngôn ngữ.
zh_cn: 自动、由AI驱动的28种语言翻译。
zh_hk: 自動、由人工智能驅動的28種語言翻譯。
zh_tw: 自動化、由AI驅動的28種語言翻譯。

source: Background Job Processing
ar_sa: معالجة المهام الخلفية
da_dk: Baggrundsjobhåndtering
de_de: Hintergrund-Aufgabenverarbeitung
el_gr: Επεξεργασία εργασιών στο παρασκήνιο
es_es: Procesamiento de tareas en segundo plano
fi_fi: Taustatehtävien käsittely
fr_fr: Traitement des tâches en arrière-plan
hi_in: बैकग्राउंड जॉब प्रोसेसिंग
id_id: Pemrosesan Tugas Latar Belakang
it_it: Elaborazione dei compiti in background
ja_jp: バックグラウンドジョブ処理
ko_kr: 백그라운드 작업 처리
nl_nl: Achtergrondtaakverwerking
pl_pl: Przetwarzanie zadań w tle
pt_br: Processamento de Tarefas em Segundo Plano
ro_ro: Procesare sarcini în fundal
ru_ru: Обработка фоновых задач
sv_se: Bakgrundsjobbshantering
th_th: การประมวลผลงานหลังบ้าน
tr_tr: Arka Plan İşlem İşleme
uk_ua: Обробка фонових завдань
vi_vn: Xử lý nhiệm vụ nền
zh_cn: 后台任务处理
zh_hk: 背景工作處理
zh_tw: 背景工作處理
