Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

source: Whether you are a student just starting out, a curious enthusiast, or an experienced producer, this tool provides an intuitive sandbox for exploring keys, harmony, and scale structures.
ar_sa: سواءً كنت طالبًا مبتدئًا، أو هاويًا فضوليًا، أو منتجًا محترفًا، ستوفر هذه الأداة بيئة تجريبية بديهية لاستكشاف السلالم، والتآلف، وتراكيب المقامات.
da_dk: Uanset om du er en begynderstuderende, en nysgerrig entusiast eller en erfaren producer, vil dette værktøj give en intuitiv sandkasse til at udforske toner, harmonier og skala-strukturer.
de_de: Egal, ob du ein Anfänger, ein neugieriger Enthusiast oder ein erfahrener Produzent bist – dieses Tool bietet dir eine intuitive Spielwiese, um Tonarten, Harmonien und Skalenstrukturen zu erkunden.
el_gr: Είτε είσαι αρχάριος φοιτητής, ένας περίεργος ενθουσιώδης, ή ένας έμπειρος παραγωγός, αυτό το εργαλείο θα προσφέρει μια διαισθητική αμμοδοχείο για την εξερεύνηση των κλειδιών, της αρμονίας και των δομών των κλιμάκων.
es_es: Tanto si eres un estudiante principiante, un entusiasta curioso o un productor experimentado, esta herramienta te proporcionará un entorno intuitivo para explorar tonalidades, armonía y estructuras de escalas.
fi_fi: Olit sitten aloitteleva opiskelija, utelias harrastaja tai kokeneempi tuottaja, tämä työkalu tarjoaa intuitiivisen hiekkalaatikon sävellajien, harmonian ja asteikkojen rakenteiden tutkimiseen.
fr_fr: Que vous soyez un étudiant débutant, un passionné curieux ou un producteur expérimenté, cet outil offrira un bac à sable intuitif pour explorer les tonalités, l'harmonie et les structures de gammes.
hi_in: चाहे आप एक शुरुआती छात्र हों, एक जिज्ञासु उत्साही हों, या एक अनुभवी निर्माता हों, यह टूल आपको सुर, सुरीलेपन और स्केल संरचनाओं को जाँचने के लिए एक सहज सैंडबॉक्स प्रदान करेगा।
id_id: Baik Anda seorang pelajar pemula, penggemar yang penasaran, atau produser berpengalaman, alat ini akan menyediakan kotak pasir yang intuitif untuk mengeksplorasi kunci, harmoni, dan struktur tangga nada.
it_it: Sia che tu sia uno studente principiante, un appassionato curioso o un produttore esperto, questo strumento offrirà un ambiente intuitivo per esplorare tonalità, armonia e strutture scalari.
ja_jp: 初心者の学生、好奇心旺盛な愛好家、ベテランのプロデューサーを問わず、このツールはキー、ハーモニー、スケール構造を探求するための直感的なサンドボックスを提供します。
ko_kr: 초보 학생이든, 호기심 많은 애호가든, 경험 많은 프로듀서든, 이 도구는 키, 화음, 스케일 구조를 탐구하기 위한 직관적인 샌드박스를 제공할 것입니다.
nl_nl: Of je nu een beginnende student, een nieuwsgierige liefhebber of een ervaren producer bent, deze tool biedt een intuïtieve speelomgeving om toonsoorten, harmonie en toonladderstructuren te verkennen.
pl_pl: Niezależnie od tego, czy jesteś początkującym uczniem, ciekawskim entuzjastą, czy doświadczonym producentem, to narzędzie zapewni intuicyjne środowisko do eksploracji tonacji, harmonii i struktur skal.
pt_br: Seja você um estudante iniciante, um entusiasta curioso ou um produtor experiente, esta ferramenta oferecerá um ambiente intuitivo para explorar tonalidades, harmonia e estruturas de escala.
ro_ro: Fie că ești un student începător, un pasionat curios sau un producător experimentat, acest instrument oferă un mediu intuitiv de explorare a tonalităților, armoniei și structurilor de game.
ru_ru: Независимо от того, являетесь ли вы начинающим учеником, любознательным энтузиастом или опытным продюсером, этот инструмент предоставит интуитивно понятную песочницу для изучения тональностей, гармонии и структур гамм.
sv_se: Oavsett om du är en nybörjare, en nyfiken entusiast eller en erfaren producent kommer detta verktyg att erbjuda en intuitiv sandlåda för att utforska tonarter, harmonier och skalstrukturer.
th_th: ไม่ว่าคุณจะเป็นนักเรียนมือใหม่ ผู้ที่ชื่นชอบความอยากรู้อยากเห็น หรือโปรดิวเซอร์ผู้มากประสบการณ์ เครื่องมือนี้จะมอบพื้นที่ทดลองอันเป็นธรรมชาติเพื่อการสำรวจคีย์ ความประสานกันของเสียง และโครงสร้างของสเกล
tr_tr: İster yeni başlayan bir öğrenci, ister meraklı bir tutkunu veya deneyimli bir prodüktör olun, bu araç; anahtarları, armoniyi ve gam yapılarını keşfetmek için sezgisel bir sanal kum havuzu sunacaktır.
uk_ua: Незалежно від того, чи ви студент-початківець, допитливий ентузіаст чи досвідчений продюсер, цей інструмент надасть вам інтуїтивно зрозумілий майданчик для дослідження тональностей, гармоній та структур ладів.
vi_vn: Dù bạn là học sinh mới bắt đầu, người đam mê tò mò hay nhà sản xuất dày dạn kinh nghiệm, công cụ này sẽ cung cấp một môi trường thử nghiệm trực quan để khám phá các giọng (key), hòa âm và cấu trúc âm giai.
zh_cn: 无论您是初学入门的学生、充满好奇的爱好者，还是经验丰富的制作人，这款工具都将为您提供一个直观的沙盒环境，用于探索调性、和声与音阶结构。
zh_hk: 無論你係初學學生、充滿好奇心嘅愛好者，抑或係經驗豐富嘅製作人，呢個工具都會提供一個直觀嘅沙盒環境，讓你探索調性、和聲同音階結構。
zh_tw: 無論您是初學的學生、充滿好奇的愛好者，還是經驗豐富的製作人，這款工具都將提供一個直觀的沙盒環境，讓您探索調性、和聲與音階結構。

source: Why is an octave divided into 12 notes? Modern music is built upon '12-Tone Equal Temperament,' a brilliant mathematical compromise that allows all keys to sound 'acceptable.' Our Chromatic Circle makes this abstract pitch system visually intuitive.
ar_sa: لماذا يُقسم الأوكتاف إلى 12 مفتاحًا؟ تُبنى الموسيقى الحديثة على نظام 'التقسيم المتساوي ذي الاثنتي عشرة نغمة'، وهو حل رياضي بارع يسمح لجميع المفاتيح بأن تبدو 'مقبولة'. تجعل دائرة النغمات اللونية الخاصة بنا هذا النظام النغمي المجرد بديهيًا بصريًا.
da_dk: Hvorfor er en oktav delt op i 12 toner? Moderne musik er bygget på '12-tone ligedelt temperament,' en genial matematisk kompromis, der gør, at alle toner lyder 'acceptable.' Vores kromatiske cirkel gør dette abstrakte tonesystem visuelt intuitivt.
de_de: Warum ist eine Oktave in 12 Töne unterteilt? Die moderne Musik basiert auf der '12-Ton-Equal-Temperament-Stimmung', einem brillanten mathematischen Kompromiss, der dafür sorgt, dass alle Tonarten 'akzeptabel' klingen. Unser chromatischer Kreis macht dieses abstrakte Tonsystem visuell intuitiv.
el_gr: Γιατί μια οκτάβα χωρίζεται σε 12 νότες; Η μοντέρνα μουσική χτίζεται πάνω στην 'Ισοδύναμη Συντονιστική Κλίμακα 12 Νοτών', μια ευφυής μαθηματική συμβιβασμός που επιτρέπει σε όλες τις κλίμακες να ακούγονται 'αποδεκτές'. Ο Χρωματικός μας Κύκλος κάνει αυτό το αφηρημένο σύστημα ύψους οπτικά διαισθητικό.
es_es: ¿Por qué una octava se divide en 12 notas? La música moderna se basa en el 'Temperamento Igual de 12 Tonos', un brillante compromiso matemático que permite que todas las tonalidades suenen 'aceptables'. Nuestro Círculo Cromático hace que este sistema abstracto de alturas sea visualmente intuitivo.
fi_fi: Miksi oktaavi on jaettu 12 säveleeseen? Moderni musiikki perustuu '12-säveliseen tasavireiseen sävelkorkeusjärjestelmään', nerokkaaseen matemaattiseen kompromissiin, jonka ansiosta kaikki sävellajit kuulostavat 'hyväksyttäviltä'. Kromaattinen ympyrämme tekee tästä abstraktista sävelkorkeusjärjestelmästä visuaalisesti intuitiivisen.
fr_fr: Pourquoi une octave est-elle divisée en 12 notes ? La musique moderne est fondée sur le 'tempérament égal à 12 tons', un compromis mathématique ingénieux qui permet à toutes les tonalités de sonner 'acceptables'. Notre Cercle Chromatique rend ce système abstrait de hauteurs visuellement intuitif.
hi_in: एक ऑक्टेव को 12 कुंजियों में क्यों बांटा गया है? आधुनिक संगीत '12-स्वर सम-स्वरिति' पर आधारित है, जो एक शानदार गणितीय समझौता है जो सभी कुंजियों को 'स्वीकार्य' स्वर देता है। हमारा क्रोमैटिक सर्कल इस अमूर्त स्वर प्रणाली को दृष्टिगत रूप से सहज बनाता है।
id_id: Mengapa satu oktaf dibagi menjadi 12 nada? Musik modern dibangun di atas '12-Tone Equal Temperament,' sebuah kompromi matematika yang brilian yang memungkinkan semua kunci terdengar 'dapat diterima.' Lingkaran Kromatik kami membuat sistem nada abstrak ini menjadi intuitif secara visual.
it_it: Perché un'ottava è divisa in 12 tasti? La musica moderna è costruita sul 'Temperamento Equabile a 12 Toni', un brillante compromesso matematico che permette a tutte le tonalità di suonare 'accettabili'. Il nostro Cerchio Cromatico rende questo sistema astratto di altezze visivamente intuitivo.
ja_jp: なぜ1オクターブは12鍵に分割されているのでしょうか？現代音楽は「12平均律」という、すべての調が「許容できる」響きを持つようにした数学的な妥協の産物の上に成り立っています。私たちの「クロマティック・サークル」は、この抽象的な音高システムを視覚的に直感的に理解できるようにします。
ko_kr: 왜 한 옥타브가 12개의 건으로 나뉠까요? 현대 음악은 모든 조가 '수용 가능하게' 들리도록 하는 천재적인 수학적 타협인 '12평균율' 위에 구축되었습니다. 우리의 크로매틱 서클은 이 추상적인 음고 체계를 시각적으로 직관적으로 만들어줍니다.
nl_nl: Waarom is een octaaf verdeeld in 12 tonen? Moderne muziek is gebouwd op '12-toonsgelijkzwevende stemming', een briljant wiskundig compromis dat ervoor zorgt dat alle toonsoorten 'acceptabel' klinken. Onze Chromatic Circle maakt dit abstracte toonsysteem visueel intuïtief.
pl_pl: Dlaczego oktawa podzielona jest na 12 dźwięków? Współczesna muzyka opiera się na 'równomiernym stroju dwunastodźwiękowym', genialnym matematycznym kompromisie, który sprawia, że wszystkie tony brzmią 'akceptowalnie'. Nasz Krąg Chromatyczny sprawia, że ten abstrakcyjny system wysokości dźwięków staje się wizualnie intuicyjny.
pt_br: Por que uma oitava é dividida em 12 notas? A música moderna é construída sobre o 'Temperamento Igual de 12 Tons', um brilhante compromisso matemático que permite que todas as tonalidades soem 'aceitáveis'. Nosso Círculo Cromático torna este sistema de afinação abstrato visualmente intuitivo.
ro_ro: De ce este o octavă împărțită în 12 note? Muzica modernă este construită pe 'Temperamentul Egal la 12 Tonuri', o soluție matematică genială care permite ca toate tonalitățile să sune 'acceptabil'. Cercul nostru Cromatic face acest sistem abstract de înălțimi sonore intuitiv din punct de vedere vizual.
ru_ru: Почему октава разделена на 12 клавиш? Современная музыка построена на '12-тоновом равномерном строе' — блестящем математическом компромиссе, который позволяет всем тональностям звучать 'приемлемо'. Наш Хроматический круг делает эту абстрактную систему высот наглядной и интуитивно понятной.
sv_se: Varför är en oktav uppdelad i 12 toner? Modern musik bygger på '12-tons liksvävande temperatur', ett briljant matematiskt kompromiss som låter alla tonarter låta 'acceptabla'. Vår kromatiska cirkel gör detta abstrakta tonsystem visuellt intuitivt.
th_th: ทำไมหนึ่งอ็อกเทฟจึงถูกแบ่งออกเป็น 12 คีย์? ดนตรีสมัยใหม่สร้างขึ้นบนระบบ '12-Tone Equal Temperament' ซึ่งเป็นข้อตกลงทางคณิตศาสตร์อันชาญฉลาดที่ทำให้ทุกคีย์ฟังดู 'ยอมรับได้' Chromatic Circle ของเราทำให้ระบบระดับเสียงที่เป็นนามธรรมนี้เข้าใจได้ง่ายผ่านการมองเห็น
tr_tr: Bir oktav neden 12 sese bölünmüştür? Modern müzik, tüm tonların 'kabul edilebilir' tınlamasını sağlayan dahiyane bir matematiksel uzlaşma olan '12-Ton Eşit Temperaman' üzerine inşa edilmiştir. Kromatik Dairemiz, bu soyut perde sistemini görsel olarak sezgisel hale getirir.
uk_ua: Чому октава поділена на 12 звуків? Сучасна музика побудована на «рівномірно темперованому строї», геніальному математичному компромісі, який дозволяє всім тональностям звучати «прийнятно». Наш хроматичний круг робить цю абстрактну систему висот звуку наочною та зрозумілою.
vi_vn: Tại sao một quãng tám lại được chia thành 12 phím? Âm nhạc hiện đại được xây dựng dựa trên 'Hệ thống 12 nốt bằng nhau' (12-Tone Equal Temperament), một sự thỏa hiệp toán học xuất sắc cho phép tất cả các tông nhạc nghe 'chấp nhận được'. Vòng Tròn Chromatic của chúng tôi giúp hệ thống cao độ trừu tượng này trở nên trực quan về mặt hình ảnh.
zh_cn: 为什么一个八度被分成12个键？现代音乐建立在“十二平均律”之上，这是一种精妙的数学折衷方案，使得所有调性听起来都“可接受”。我们的半音阶圆盘让这个抽象的音高系统变得直观可见。
zh_hk: 點解一個八度要分成12個音？現代音樂建基於「十二平均律」，呢個係一個絕妙嘅數學折衷方案，令到所有調聽起嚟都「可以接受」。我哋嘅「Chromatic Circle」就令到呢個抽象嘅音高系統變得一目了然。
zh_tw: 為什麼一個八度要分成12個鍵？現代音樂建立在「十二平均律」之上，這是一種巧妙的數學折衷方案，讓所有調性聽起來都「可接受」。我們的「Chromatic Circle」讓這個抽象的音高系統變得直觀可見。

source: Why is music designed this way?
ar_sa: لماذا صُمِّمت الموسيقى بهذه الطريقة؟
da_dk: Hvorfor er musik designet på denne måde?
de_de: Warum ist Musik so aufgebaut?
el_gr: Γιατί η μουσική είναι σχεδιασμένη έτσι;
es_es: ¿Por qué está diseñada así la música?
fi_fi: Miksi musiikki on suunniteltu tällä tavalla?
fr_fr: Pourquoi la musique est-elle conçue de cette façon ?
hi_in: संगीत को इस तरह से क्यों डिज़ाइन किया गया है?
id_id: Mengapa musik dirancang seperti ini?
it_it: Perché la musica è progettata in questo modo?
ja_jp: 音楽はなぜこのように設計されているのでしょうか？
ko_kr: 음악은 왜 이런 방식으로 설계되었을까요?
nl_nl: Waarom is muziek op deze manier ontworpen?
pl_pl: Dlaczego muzyka jest zaprojektowana w ten sposób?
pt_br: Por que a música é projetada dessa forma?
ro_ro: De ce este muzica concepută în acest fel?
ru_ru: Почему музыка устроена именно так?
sv_se: Varför är musik utformad på detta sätt?
th_th: ทำไมดนตรีจึงถูกออกแบบมาแบบนี้?
tr_tr: Müzik neden bu şekilde tasarlandı?
uk_ua: Чому музика влаштована саме так?
vi_vn: Tại sao âm nhạc lại được thiết kế theo cách này?
zh_cn: 音乐为何如此设计？
zh_hk: 點解音樂係咁樣設計嘅？
zh_tw: 為什麼音樂是這樣設計的？

source: Why use the Aiursoft Template?
ar_sa: لماذا تستخدم قالب Aiursoft؟
da_dk: Hvorfor bruge Aiursoft-skabelonen?
de_de: Warum die Aiursoft-Vorlage verwenden?
el_gr: Γιατί να χρησιμοποιήσετε το πρότυπο Aiursoft;
es_es: ¿Por qué usar la plantilla de Aiursoft?
fi_fi: Miksi käyttää Aiursoft -mallipohjaa?
fr_fr: Pourquoi utiliser le modèle Aiursoft ?
hi_in: ऐयूरसॉफ्ट टेम्पलेट का उपयोग क्यों करें?
id_id: Mengapa menggunakan Template Aiursoft?
it_it: Perché usare il template Aiursoft?
ja_jp: Aiursoft テンプレートを使うのはなぜですか？
ko_kr: Aiursoft 템플릿을 사용해야 하는 이유는 무엇인가요?
nl_nl: Waarom gebruik je de Aiursoft Template?
pl_pl: Dlaczego używać szablonu Aiursoft?
pt_br: Por que usar o Modelo Aiursoft?
ro_ro: De ce să folosești șablonul Aiursoft?
ru_ru: Зачем использовать шаблон Aiursoft?
sv_se: Varför använda Aiursoft-mallen?
th_th: ทำไมต้องใช้เทมเพลต Aiursoft?
tr_tr: Aiursoft Şablonu neden kullanmalıyım?
uk_ua: Чому використовувати шаблон Aiursoft?
vi_vn: Tại sao nên sử dụng Mẫu Aiursoft?
zh_cn: 为什么使用 Aiursoft 模板？
zh_hk: 點解要使用 Aiursoft 模板？
zh_tw: 為什麼要使用 Aiursoft 模板？
