Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

source: The navigation bar automatically adjusts based on user roles and permissions.
ar_sa: شريط التنقل يتكيف تلقائيًا بناءً على أدوار المستخدم والصلاحيات.
da_dk: Navigationsbaren tilpasses automatisk baseret på brugerroller og tilladelser.
de_de: Die Navigationsleiste passt sich automatisch an die Benutzerrollen und Berechtigungen an.
el_gr: Το μενού πλοήγησης προσαρμόζεται αυτόματα βάσει των ρόλων και των επιτροπών του χρήστη.
es_es: La barra de navegación se ajusta automáticamente según los roles y permisos del usuario.
fi_fi: Navigointipalkki säätää automaattisesti käyttäjän roolien ja oikeuksien mukaan.
fr_fr: La barre de navigation s'ajuste automatiquement en fonction des rôles et des autorisations des utilisateurs.
hi_in: नेविगेशन बार उपयोगकर्ता के भूमिकाओं और अनुमतियों के आधार पर स्वचालित रूप से समायोजित होता है।
id_id: Bilah navigasi secara otomatis menyesuaikan berdasarkan peran dan izin pengguna.
it_it: La barra di navigazione si adatta automaticamente in base ai ruoli e ai permessi dell'utente.
ja_jp: ナビゲーションバーは、ユーザーのロールと権限に基づいて自動的に調整されます。
ko_kr: 네비게이션 바는 사용자 역할과 권한에 따라 자동으로 조정됩니다.
nl_nl: De navigatiebalk past zich automatisch aan op basis van gebruikersrollen en permissies.
pl_pl: Pasek nawigacyjny automatycznie dostosowuje się do ról i uprawnień użytkownika.
pt_br: A barra de navegação se ajusta automaticamente com base nos papéis e permissões do usuário.
ro_ro: Bara de navigare se ajustează automat în funcție de rolurile și permisiunile utilizatorului.
ru_ru: Навигационная панель автоматически адаптируется в зависимости от ролей и разрешений пользователя.
sv_se: Navigationsfältet anpassas automatiskt utifrån användarroller och behörigheter.
th_th: แถบนำทางจะปรับตัวอัตโนมัติตามบทบาทและสิทธิ์ของผู้ใช้
tr_tr: Navigasyon çubuğu, kullanıcı rollerine ve izinlerine göre otomatik olarak ayarlanır.
uk_ua: Навігаційна панель автоматично налаштовується залежно від ролей та дозволів користувача.
vi_vn: Thanh điều hướng tự động điều chỉnh dựa trên vai trò và quyền hạn người dùng.
zh_cn: 导航栏会根据用户角色和权限自动调整。
zh_hk: 導航欄會根據用戶角色和權限自動調整。
zh_tw: 導覽列會根據使用者角色與權限自動調整。

source: Music theory can be dry, but watching it in action is brilliant. The core value of this tool is 'real-time synchronisation.' When you select a new key, the Chromatic Circle, Circle of Fifths, piano keys, and staff notation update instantly. You'll immediately understand why G Major has only one sharp!
ar_sa: قد تكون النظرية جافة، لكن مشاهدة التطبيق العملي ممتعة. القيمة الأساسية لهذه الأداة هي 'المزامنة الفورية'. عند اختيار مفتاح موسيقي جديد، يتم تحديث الدورة الكروماتية، ودورة الخامسات، ومفاتيح البيانو، ورموز المدرج الموسيقي على الفور. ستفهم على الفور سبب احتواء مقام G الكبير على علامة رفع واحدة فقط!
da_dk: Teori kan være tør, men at se den i aktion er sjovt. Kernen i dette værktøj er 'realtidssynkronisering.' Når du vælger en ny toneart, opdateres den kromatiske cirkel, kvintcirklen, klaverets tangenter og nodalskriften øjeblikkeligt. Du vil med det samme forstå, hvorfor G-dur kun har ét kryds!
de_de: Theorie kann trocken sein, aber sie in Aktion zu sehen, macht Spaß. Der Kernwert dieses Tools ist die 'Echtzeit-Synchronisation'. Wenn Sie eine neue Tonart auswählen, aktualisieren sich der Chromatische Kreis, die Quintenzirkel, die Klaviertasten und die Notenschrift sofort. Sie werden sofort verstehen, warum G-Dur nur ein Kreuz hat!
el_gr: Η θεωρία μπορεί να είναι ξηρή, αλλά το να την παρακολουθείς σε πράξη είναι διασκεδαστικό. Η βασική αξία αυτού του εργαλείου είναι ο 'συγχρονισμός σε πραγματικό χρόνο'. Όταν επιλέγετε μια νέα τονικότητα, ο Χρωματικός Κύκλος, ο Κύκλος των Πέμπτων, τα πλήκτρα του πιάνου και ο μουσικός συμβολισμός ενημερώνονται αμέσως. Θα καταλάβετε αμέσως γιαquoi η Σολ Ματζόρε έχει μόνο ένα δίεση!
es_es: La teoría puede ser árida, pero verla en acción es divertido. El valor principal de esta herramienta es la 'sincronización en tiempo real'. Cuando seleccionas una nueva tonalidad, el Círculo Cromático, el Círculo de Quintas, las teclas del piano y la notación musical se actualizan al instante. ¡Entenderás inmediatamente por qué Sol Mayor tiene solo un sostenido!
fi_fi: Teoria voi olla kuivaa, mutta sen seuraaminen käytännössä on hauskaa. Tämän työkalun ydinarvo on 'reaaliaikainen synkronointi'. Kun valitset uuden sävellajin, kromaattinen ympyrä, kvinttiympyrä, pianon koskettimet ja nuottikirjoitus päivittyvät välittömästi. Ymmärrät heti, miksi G-duurissa on vain yksi ylennysmerkki!
fr_fr: La théorie peut être aride, mais la voir en action est passionnant. La valeur fondamentale de cet outil est la 'synchronisation en temps réel.' Lorsque vous sélectionnez une nouvelle tonalité, le Cercle Chromatique, le Cercle des Quintes, le clavier de piano et la portée musicale se mettent à jour instantanément. Vous comprendrez immédiatement pourquoi le Sol Majeur n'a qu'un seul dièse !
hi_in: सिद्धांत नीरस हो सकता है, लेकिन इसे क्रियान्वित होते देखना मजेदार है। इस टूल का मुख्य मूल्य 'रीयल-टाइम सिंक्रनाइज़ेशन' है। जब आप एक नई कुंजी चुनते हैं, तो क्रोमैटिक सर्कल, सर्कल ऑफ फिफ्थ्स, पियानो कीज़ और स्टाफ नोटेशन तुरंत अपडेट हो जाते हैं। आप तुरंत समझ जाएंगे कि जी मेजर में केवल एक ही शार्प क्यों होता है!
id_id: Teori bisa terasa membosankan, tetapi menyaksikannya dalam aksi itu menyenangkan. Nilai inti dari alat ini adalah 'sinkronisasi waktu-nyata.' Saat Anda memilih kunci baru, Lingkaran Kromatik, Lingkaran Quint, tuts piano, dan notasi balok akan langsung diperbarui. Anda akan langsung memahami mengapa G Mayor hanya memiliki satu kres!
it_it: La teoria può essere arida, ma vederla in azione è divertente. Il valore fondamentale di questo strumento è la 'sincronizzazione in tempo reale'. Quando selezioni una nuova tonalità, il Cerchio Cromatico, il Circolo delle Quinte, i tasti del pianoforte e la notazione sul pentagramma si aggiornano all'istante. Capirai immediatamente perché il Sol Maggiore ha solo un diesis!
ja_jp: 理論は退屈になりがちですが、実際に動きを見ると楽しいものです。このツールの核となる価値は「リアルタイム同期」にあります。新しいキーを選択すると、クロマティックサークル、五度圏、ピアノキー、五線譜が即座に更新されます。なぜト長調（G Major）にシャープが1つしかないのか、すぐに理解できるでしょう！
ko_kr: 이론은 지루할 수 있지만, 실제로 작동하는 모습을 보는 것은 재미있습니다. 이 도구의 핵심 가치는 '실시간 동기화'입니다. 새로운 키를 선택하면, 크로매틱 서클, 5도권, 피아노 건반, 그리고 오선보가 즉시 업데이트됩니다. 왜 G Major에 샤프가 하나만 있는지 바로 이해하게 될 것입니다!
nl_nl: Theorie kan droog zijn, maar het in actie zien is leuk. De kernwaarde van dit hulpmiddel is 'real-time synchronisatie'. Wanneer je een nieuwe toonsoort selecteert, worden de Chromatic Circle, Circle of Fifths, pianotoetsen en notenbalk notatie onmiddellijk bijgewerkt. Je ziet meteen in waarom G majeur maar één kruis heeft!
pl_pl: Teoria może być sucha, ale obserwowanie jej w działaniu to świetna zabawa. Kluczową wartością tego narzędzia jest 'synchronizacja w czasie rzeczywistym'. Gdy wybierzesz nowy klucz, Krąg Chromatyczny, Krąg Kwint, klawisze fortepianu i zapis nutowy aktualizują się natychmiast. Od razu zrozumiesz, dlaczego G-dur ma tylko jeden krzyżyk!
pt_br: A teoria pode ser árida, mas vê-la em ação é divertido. O valor central desta ferramenta é a 'sincronização em tempo real'. Quando você seleciona uma nova tonalidade, o Círculo Cromático, o Círculo de Quintas, as teclas do piano e a notação na pauta atualizam-se instantaneamente. Você entenderá imediatamente por que o Sol Maior tem apenas um sustenido!
ro_ro: Teoria poate fi aridă, dar este distractiv să o vezi în acțiune. Valoarea de bază a acestui instrument este 'sincronizarea în timp real'. Când selectezi o nouă tonalitate, Cercul Cromatic, Cercul cvintelor, clapele de pian și notația pe portativ se actualizează instantaneu. Vei înțelege imediat de ce Sol Major are un singur diez!
ru_ru: Теория может быть скучной, но наблюдать её в действии — увлекательно. Основная ценность этого инструмента — «синхронизация в реальном времени». Когда вы выбираете новую тональность, хроматический круг, квинтовый круг, клавиши пианино и нотный стан мгновенно обновляются. Вы сразу поймёте, почему в соль мажоре всего один диез!
sv_se: Teori kan vara torr, men att se den i aktion är roligt. Kärnvärdet i detta verktyg är 'synkronisering i realtid'. När du väljer en ny tonart uppdateras den kromatiska cirkeln, kvintcirkeln, pianotangenterna och notskriften omedelbart. Du kommer direkt att förstå varför G-dur bara har en korsförteckning!
th_th: ทฤษฎีอาจจะฟังดูน่าเบื่อ แต่การได้เห็นมันทำงานจริงนั้นสนุกมาก ค่าหลักของเครื่องมือนี้คือ 'การซิงค์แบบเรียลไทม์' เมื่อคุณเลือกคีย์ใหม่ วงโครมาติก วงแห่งฟิฟธ์ คีย์เปียโน และโน้ตบรรทัดห้าเส้นจะอัปเดตทันที คุณจะเข้าใจในทันทีว่าทำไมคีย์ G Major ถึงมีชาร์ปแค่ตัวเดียว!
tr_tr: Teori kuru olabilir ama pratikte izlemek eğlencelidir. Bu aracın temel değeri 'gerçek zamanlı senkronizasyondur.' Yeni bir anahtar seçtiğinizde, Kromatik Daire, Beşliler Çemberi, piyano tuşları ve nota yazımı anında güncellenir. Neden Sol Majör'ün sadece bir diyeze sahip olduğunu anında anlayacaksınız!
uk_ua: Теорія може бути сухою, але спостерігати її в дії — це цікаво. Основна цінність цього інструменту — «синхронізація в реальному часі». Коли ви обираєте нову тональність, хроматичне коло, квінтове коло, клавіші піаніно та нотний стан оновлюються миттєво. Ви одразу зрозумієте, чому в Сі мажорі лише один дієз!
vi_vn: Lý thuyết có thể khô khan, nhưng quan sát nó trong thực tế lại rất thú vị. Giá trị cốt lõi của công cụ này là 'đồng bộ hóa thời gian thực.' Khi bạn chọn một âm giai mới, Vòng Tròn Chromatic, Vòng Tròn Quãng Năm, các phím đàn piano và ký hiệu khuông nhạc sẽ cập nhật ngay lập tức. Bạn sẽ ngay lập tức hiểu tại sao Sol Trưởng (G Major) chỉ có một dấu thăng!
zh_cn: 乐理可能枯燥，但亲眼见证理论付诸实践却充满乐趣。本工具的核心价值在于"实时同步"。当您选择一个新的调时，半音圈、五度圈、钢琴键与五线谱会即刻更新。您将瞬间明白为何G大调仅有一个升号！
zh_hk: 理論可能好枯燥，但睇住佢實際應用就好有趣。呢個工具嘅核心價值係『實時同步』。當你揀選一個新調時，色環、五度圈、鋼琴鍵同埋五線譜都會即刻更新。你即刻就會明白點解G大調只有一個升號！
zh_tw: 理論可能枯燥，但實際觀看它的運作卻充滿樂趣。這款工具的核心價值在於「即時同步」。當您選擇一個新調時，色環、五度圈、鋼琴琴鍵和五線譜都會立即更新。您將立刻明白為什麼 G 大調只有一個升記號！

source: This is a template project, where we start the voyager...
ar_sa: هذا مشروع نموذجي، حيث نبدأ رحلة المavigатор...
da_dk: Dette er et skabelonprojekt, hvor vi starter rejseføreren...
de_de: Dies ist ein Vorlagenprojekt, in dem wir den Reisenden starten...
el_gr: Αυτό είναι ένα πρότυπο έργο, όπου ξεκινάμε τον περιήγηση...
es_es: Este es un proyecto plantilla, donde comenzamos la aventura...
fi_fi: Tämä on malliprojekti, jossa aloitamme matkustajan...
fr_fr: Il s'agit d'un projet modèle, où nous lançons le voyageur...
hi_in: यह एक टेम्पलेट प्रोजेक्ट है, जहाँ हम वॉयेजर की शुरुआत करते हैं...
id_id: Ini adalah proyek templat, di mana kita memulai perjalanan voyager...
it_it: Questo è un progetto modello, dove iniziamo il viaggiatore...
ja_jp: これはテンプレートプロジェクトです。ここから探検家（voyager）を始めます...
ko_kr: 이것은 템플릿 프로젝트이며, 여기서 탐험가를 시작합니다...
nl_nl: Dit is een sjabloonproject waarin we de reiziger beginnen...
pl_pl: To jest projekt szablonowy, w którym zaczynamy podróżnika...
pt_br: Este é um projeto modelo, onde iniciamos a jornada do viajante...
ro_ro: Acesta este un proiect tip, unde începem călătoria...
ru_ru: Это шаблонный проект, где мы начинаем путь путешественника...
sv_se: Detta är ett mallprojekt där vi startar utforskaren...
th_th: นี่คือโปรเจกต์ต้นแบบ ซึ่งเราเริ่มต้นการเดินทางของนักเดินทาง...
tr_tr: Bu, bir gezginin yolculuğunu başlattığımız bir şablon proje.
uk_ua: Це шаблонний проект, де ми розпочинаємо підприємство...
vi_vn: Đây là một dự án mẫu, nơi chúng tôi bắt đầu hành trình của người du hành...
zh_cn: 这是一个模板项目，我们将启程探索...
zh_hk: 這是一個範本專案，我們將啟程展開探索之旅…
zh_tw: 這是一個範本專案，我們將啟程展開探索之旅...

source: Tool Interface Preview
ar_sa: معاينة واجهة الأداة
da_dk: Eksempel på værktøjets grænseflade
de_de: Vorschau der Werkzeugoberfläche
el_gr: Προεπισκόπηση Διεπαφής Εργαλείου
es_es: Vista previa de la interfaz de la herramienta
fi_fi: Työkalun käyttöliittymän esikatselu
fr_fr: Aperçu de l'interface de l'outil
hi_in: टूल इंटरफ़ेस पूर्वावलोकन
id_id: Pratinjau Antarmuka Alat
it_it: Anteprima Interfaccia Strumento
ja_jp: ツールインターフェースのプレビュー
ko_kr: 도구 인터페이스 미리보기
nl_nl: Voorbeeld van de toolinterface
pl_pl: Podgląd interfejsu narzędzia
pt_br: Visualização da Interface da Ferramenta
ro_ro: Previzualizare Interfață Instrument
ru_ru: Предварительный просмотр интерфейса инструмента
sv_se: Förhandsvisning av verktygets gränssnitt
th_th: ตัวอย่างหน้าจอเครื่องมือ
tr_tr: Arayüz Önizlemesi
uk_ua: Попередній перегляд інтерфейсу інструменту
vi_vn: Xem trước Giao diện Công cụ
zh_cn: 工具界面预览
zh_hk: 工具介面預覽
zh_tw: 工具介面預覽

source: Tools
ar_sa: أدوات
de_de: Werkzeuge
el_gr: Εργαλεία
es_es: Herramientas
fi_fi: Työkalut
fr_fr: Outils
hi_in: उपकरण
it_it: Strumenti
ko_kr: 도구
nl_nl: Gereedschappen
pl_pl: Narzędzia
pt_br: Ferramentas
ro_ro: Unelte
sv_se: Verktyg
tr_tr: Araçlar
uk_ua: Інструменти
zh_cn: 工具
zh_hk: 工具
zh_tw: 工具

source: Welcome
ar_sa: مرحباً
da_dk: Velkommen
de_de: Willkommen
el_gr: Καλώς ήρθατε
es_es: Bienvenido
fi_fi: Tervetuloa
fr_fr: Bienvenue
hi_in: स्वागतम्
id_id: Selamat Datang
it_it: Benvenuto
ja_jp: ようこそ
ko_kr: 환영합니다
nl_nl: Welkom
pl_pl: Witamy
pt_br: Bem-vindo
ro_ro: Bine ați venit
ru_ru: Добро пожаловать
sv_se: Välkommen
th_th: ยินดีต้อนรับ
tr_tr: Hoşgeldiniz
uk_ua: Ласкаво просимо
vi_vn: Chào mừng
zh_cn: 欢迎
zh_hk: 歡迎
zh_tw: 歡迎

source: Welcome to MusicTools
ar_sa: أهلاً بكم في MusicTools
de_de: Willkommen bei MusicTools
el_gr: Καλώς ήρθατε στο MusicTools
es_es: Bienvenido a MusicTools
fi_fi: Tervetuloa MusicToolsiin
fr_fr: Bienvenue sur MusicTools
hi_in: म्यूजिकटूल्स में आपका स्वागत है
it_it: Benvenuto in MusicTools
ko_kr: MusicTools에 오신 것을 환영합니다
nl_nl: Welkom bij MusicTools
pl_pl: Witamy w MusicTools
pt_br: Bem-vindo ao MusicTools
ro_ro: Bine ați venit la MusicTools
sv_se: Välkommen till MusicTools
tr_tr: MusicTools'a Hoş Geldiniz
uk_ua: Ласкаво просимо до MusicTools
zh_cn: 欢迎使用 MusicTools
zh_hk: 歡迎使用 MusicTools
zh_tw: 歡迎使用 MusicTools

source: Welcome to the interactive music theory tool. We help you connect the abstract concepts of music theory—the Chromatic Scale, the Circle of Fifths, and the piano keyboard—allowing you to truly 'see' how music works.
ar_sa: مرحبًا بك في أداة نظرية الموسيقى التفاعلية. نحن نساعدك في ربط المفاهيم المجردة لنظرية الموسيقى — السلم الكروماتي، ودائرة الخامسات، ولوحة مفاتيح البيانو — مما يتيح لك "رؤية" كيفية عمل الموسيقى حقًا.
da_dk: Velkommen til det interaktive musikteori-værktøj. Vi hjælper dig med at forbinde musikteoriens abstrakte koncepter – den kromatiske skala, kvintcirklen og klaverets keyboard – så du virkelig kan 'se', hvordan musik fungerer.
de_de: Willkommen beim interaktiven Musiktheorie-Tool. Wir helfen Ihnen, die abstrakten Konzepte der Musiktheorie – die chromatische Tonleiter, den Quintenzirkel und die Klaviertastatur – zu verbinden, sodass Sie wirklich 'sehen' können, wie Musik funktioniert.
el_gr: Καλωσορίσατε στο διαδραστικό εργαλείο μουσικής θεωρίας. Σας βοηθάμε να συνδέσετε τις αφηρημένες έννοιες της μουσικής θεωρίας—τη Χρωματική Κλίμακα, τον Κύκλο των Πέμπτων και το πληκτρολόγιο πιάνου—επιτρέποντάς σας να «δείτε» πραγματικά πώς λειτουργεί η μουσική.
es_es: Bienvenido/a a la herramienta interactiva de teoría musical. Te ayudamos a conectar los conceptos abstractos de la teoría musical—la Escala Cromática, el Círculo de Quintas y el teclado del piano—permitiéndote "ver" verdaderamente cómo funciona la música.
fi_fi: Tervetuloa interaktiiviseen musiikinteorian työkaluun. Autamme sinua yhdistämään musiikinteorian abstraktit käsitteet — kromaattisen asteikon, kvinttiympyrän ja pianon koskettimiston — mahdollistaen sinulle musiikin toiminnan todella 'näkemisen'.
fr_fr: Bienvenue dans l'outil interactif de théorie musicale. Nous vous aidons à connecter les concepts abstraits de la théorie musicale — l'échelle chromatique, le cercle des quintes et le clavier de piano — vous permettant de véritablement « voir » comment la musique fonctionne.
hi_in: इंटरैक्टिव संगीत सिद्धांत टूल में आपका स्वागत है। हम आपको संगीत सिद्धांत की अमूर्त अवधारणाओं—क्रोमैटिक स्केल, सर्कल ऑफ फ़िफ्थ्स, और पियानो कीबोर्ड—को जोड़ने में मदद करते हैं, जिससे आप वास्तव में 'देख' सकें कि संगीत कैसे काम करता है।
id_id: Selamat datang di alat teori musik interaktif. Kami membantu Anda menghubungkan konsep abstrak teori musik—Skala Kromatis, Lingkaran Kuint, dan keyboard piano—sehingga Anda dapat benar-benar 'melihat' bagaimana musik bekerja.
it_it: Benvenuto nello strumento interattivo di teoria musicale. Ti aiutiamo a collegare i concetti astratti della teoria musicale—la Scala Cromatica, il Circolo delle Quinte e la tastiera del pianoforte—permettendoti di 'vedere' veramente come funziona la musica.
ja_jp: 対話型音楽理論ツールへようこそ。このツールでは、音楽理論の抽象的な概念—半音階（Chromatic Scale）、五度圏（Circle of Fifths）、ピアノキーボード—を結びつけ、音楽の仕組みを本当の意味で「視覚的」に理解できるよう支援します。
ko_kr: 상호작용 가능한 음악 이론 도구에 오신 것을 환영합니다. 본 도구는 음악 이론의 추상적인 개념들—크로매틱 스케일(Chromatic Scale), 5도권(Circle of Fifths), 그리고 피아노 건반—을 연결하여 여러분이 음악이 어떻게 작동하는지 진정으로 '시각적으로' 이해하도록 도와줍니다.
nl_nl: Welkom bij het interactieve muziektheorie-instrument. Wij helpen je de abstracte concepten van muziektheorie—de chromatische toonladder, de kwintencirkel en het pianoklavier—met elkaar te verbinden, zodat je daadwerkelijk kunt 'zien' hoe muziek werkt.
pl_pl: Witaj w interaktywnym narzędziu do nauki teorii muzyki. Pomagamy połączyć abstrakcyjne pojęcia teorii muzyki — skalę chromatyczną, koło kwintowe i klawiaturę fortepianu — umożliwiając prawdziwe 'zobaczenie', jak działa muzyka.
pt_br: Bem-vindo à ferramenta interativa de teoria musical. Ajudamos você a conectar os conceitos abstratos da teoria musical — a Escala Cromática, o Círculo de Quintas e o teclado do piano — permitindo que você realmente 'veja' como a música funciona.
ro_ro: Bun venit la instrumentul interactiv de teorie muzicală. Vă ajutăm să conectați conceptele abstracte ale teoriei muzicii—Scala Cromatică, Cercul cvintelor și claviatură de pian—permițându-vă să „vedeți” cu adevărat cum funcționează muzica.
ru_ru: Добро пожаловать в интерактивный инструмент изучения теории музыки. Мы помогаем вам связать абстрактные концепции теории музыки — хроматическую гамму, квинтовый круг и клавиатуру фортепиано — позволяя вам по-настоящему «увидеть», как устроена музыка.
sv_se: Välkommen till det interaktiva musiklärarverktyget. Vi hjälper dig att koppla ihop musiklärans abstrakta begrepp – den kromatiska skalan, kvintcirkeln och pianotangenterna – så att du verkligen kan 'se' hur musik fungerar.
th_th: ยินดีต้อนรับสู่เครื่องมือทฤษฎีดนตรีเชิงโต้ตอบ เราช่วยให้คุณเชื่อมโยงแนวคิดเชิงนามธรรมของทฤษฎีดนตรี ได้แก่ สเกลโครมาติก วงกลมแห่งฟิฟธ์ และคีย์บอร์ดเปียโน เพื่อให้คุณสามารถ 'มองเห็น' วิธีการทำงานของดนตรีได้อย่างแท้จริง
tr_tr: Etkileşimli müzik teorisi aracına hoş geldiniz. Müzik teorisinin soyut kavramlarını—Kromatik Dizi, Beşliler Çemberi ve piyano klavyesi—birbirine bağlamanıza yardımcı olarak, müziğin nasıl işlediğini gerçekten 'görmenizi' sağlıyoruz.
uk_ua: Ласкаво просимо до інтерактивного інструменту теорії музики. Ми допомагаємо вам поєднати абстрактні поняття теорії музики—Хроматичну Гаму, Квінтове Коло та клавіатуру піаніно—дозволяючи вам по-справжньому «побачити», як працює музика.
vi_vn: Chào mừng bạn đến với công cụ lý thuyết âm nhạc tương tác. Chúng tôi giúp bạn kết nối các khái niệm trừu tượng của lý thuyết âm nhạc—Chromatic Scale, Circle of Fifths và bàn phím piano—cho phép bạn thực sự 'nhìn thấy' cách âm nhạc vận hành.
zh_cn: 欢迎使用这款交互式乐理工具。我们帮助您将乐理中的抽象概念——半音阶、五度圈与钢琴键盘——联系起来，让您真正“看见”音乐的运作原理。
zh_hk: 歡迎使用互動式樂理工具。我們幫助你連結樂理的抽象概念——包括半音階、五度循環以及鋼琴鍵盤——讓你真正「睇」透音樂嘅運作原理。
zh_tw: 歡迎使用互動式樂理工具。我們協助您連結樂理中的抽象概念——半音階、五度圈與鋼琴鍵盤——讓您能真正「看見」音樂的運作方式。
