Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

source: Music isn't magic; it's a brilliant combination of maths, physics, and patterns. Our tool reveals these patterns:
ar_sa: الموسيقى ليست سحرًا؛ إنها مزيج رائع من الرياضيات والفيزياء والأنماط. أداتنا تكشف هذه الأنماط:
da_dk: Musik er ikke magi; det er en genial kombination af matematik, fysik og mønstre. Vores værktøj afslører disse mønstre:
de_de: Musik ist keine Zauberei; sie ist eine brillante Kombination aus Mathematik, Physik und Mustern. Unser Werkzeug enthüllt diese Muster:
el_gr: Η μουσική δεν είναι μαγεία· είναι μια ευφυής συνδυασμός μαθηματικών, φυσικής και μοτίβων. Το εργαλείο μας αποκαλύπτει αυτά τα μοτίβα:
es_es: La música no es magia; es una combinación brillante de matemáticas, física y patrones. Nuestra herramienta revela estos patrones:
fi_fi: Musiikki ei ole taikuutta; se on matematiikan, fysiikan ja kaavojen loistava yhdistelmä. Työkalumme paljastaa nämä kaavat:
fr_fr: La musique n'est pas de la magie ; c'est une brillante combinaison de mathématiques, de physique et de motifs. Notre outil révèle ces structures :
hi_in: संगीत कोई जादू नहीं है; यह गणित, भौतिकी और पैटर्न का एक शानदार संयोजन है। हमारा टूल इन पैटर्नों को उजागर करता है:
id_id: Musik bukanlah sihir; ia adalah kombinasi brilian dari matematika, fisika, dan pola. Alat kami mengungkap pola-pola ini:
it_it: La musica non è magia; è una brillante combinazione di matematica, fisica e schemi. Il nostro strumento rivela questi schemi:
ja_jp: 音楽は魔法ではありません。それは数学、物理学、パターンの見事な組み合わせなのです。私たちのツールはこれらのパターンを明らかにします：
ko_kr: 음악은 마법이 아닙니다. 수학, 물리학, 그리고 패턴의 훌륭한 조합입니다. 우리의 도구는 이러한 패턴들을 드러냅니다:
nl_nl: Muziek is geen magie; het is een briljante combinatie van wiskunde, natuurkunde en patronen. Onze tool onthult deze patronen:
pl_pl: Muzyka to nie magia; to genialne połączenie matematyki, fizyki i wzorców. Nasze narzędzie odsłania te wzorce:
pt_br: A música não é mágica; é uma combinação brilhante de matemática, física e padrões. Nossa ferramenta revela esses padrões:
ro_ro: Muzica nu este magie; este o combinație strălucită de matematică, fizică și modele. Instrumentul nostru dezvăluie aceste modele:
ru_ru: Музыка — это не магия; это блестящее сочетание математики, физики и закономерностей. Наш инструмент раскрывает эти закономерности:
sv_se: Musik är inte magi; det är en briljant kombination av matematik, fysik och mönster. Vårt verktyg avslöjar dessa mönster:
th_th: ดนตรีไม่ใช่เวทมนตร์ แต่เป็นการผสมผสานอันชาญฉลาดระหว่างคณิตศาสตร์ ฟิสิกส์ และรูปแบบ โปรแกรมของเราเปิดเผยรูปแบบเหล่านี้:
tr_tr: Müzik bir sihir değildir; matematik, fizik ve desenlerin parlak bir birleşimidir. Aracımız bu desenleri ortaya çıkarır:
uk_ua: Музика — це не магія; це блискуче поєднання математики, фізики та закономірностей. Наш інструмент розкриває ці закономірності:
vi_vn: Âm nhạc không phải là phép thuật; nó là sự kết hợp tuyệt vời giữa toán học, vật lý và các mẫu hình. Công cụ của chúng tôi tiết lộ những mẫu hình này:
zh_cn: 音乐并非魔法，而是数学、物理与规律的绝妙结合。我们的工具正是为了揭示这些规律：
zh_hk: 音樂並非魔法，而係數學、物理同規律嘅絕妙結合。我哋嘅工具正係要揭示呢啲規律：
zh_tw: 音樂並非魔法，而是數學、物理與規律的巧妙結合。我們的工具正是為了揭示這些規律：

source: MusicTools provides a collection of essential tools for musicians and students. Explore our calculators and ear training tests to enhance your musical skills.
ar_sa: توفر MusicTools مجموعة من الأدوات الأساسية للموسيقيين والطلاب. استكشف حاسباتنا واختبارات تدريب السمع لتحسين مهاراتك الموسيقية.
de_de: MusicTools bietet eine Sammlung von essenziellen Tools für Musiker und Schüler. Entdecken Sie unsere Rechner und Gehörbildungstests, um Ihre musikalischen Fähigkeiten zu verbessern.
el_gr: Το MusicTools παρέχει συλλογή απαραίτητων εργαλείων για μουσικούς και μαθητές. Ανακαλύψτε τους υπολογιστές μας και τις δοκιμασίες εξάσκησης ακοής για να βελτιώσετε τις μουσικές σας ικανότητες.
es_es: MusicTools ofrece una colección de herramientas esenciales para músicos y estudiantes. Explora nuestras calculadoras y pruebas de entrenamiento auditivo para mejorar tus habilidades musicales.
fi_fi: MusicTools tarjoaa tärkeimmät työkalut musiikin tekijöille ja opiskelijoille. Tutustu laskimiimme ja kuuloharjoituksiimme parantaaksesi musiikillisia taitojasi.
fr_fr: MusicTools propose une collection d'outils essentiels pour les musiciens et les étudiants. Explorez nos calculateurs et tests d'entraînement auditif pour améliorer vos compétences musicales.
hi_in: म्यूजिकटूल्स संगीतकारों और छात्रों के लिए आवश्यक उपकरणों का संग्रह प्रदान करता है। अपने संगीत कौशल को बढ़ाने के लिए हमारे कैलकुलेटर्स और कान के प्रशिक्षण परीक्षणों का अन्वेषण करें।
it_it: MusicTools offre una raccolta di strumenti essenziali per musicisti e studenti. Esplora i nostri calcolatori e i test di allenamento dell'orecchio per migliorare le tue abilità musicali.
ko_kr: MusicTools는 음악가와 학생들을 위한 필수 도구 모음을 제공합니다. 계산기와 귀 기르기 테스트를 이용해 음악 실력을 향상시켜 보세요.
nl_nl: MusicTools biedt een verzameling essentiële hulpmiddelen voor muzikanten en studenten. Verken onze rekenmachines en ooronderzoekstests om je muzikale vaardigheden te verbeteren.
pl_pl: MusicTools oferuje kolekcję niezbędnych narzędzi dla muzyków i uczniów. Eksploruj nasze kalkulatory i ćwiczenia do doskonalenia słuchu, aby poprawić swoje umiejętności muzyczne.
pt_br: O MusicTools oferece uma coleção de ferramentas essenciais para músicos e estudantes. Explore nossos calculadores e testes de treinamento auditivo para aprimorar suas habilidades musicais.
ro_ro: MusicTools oferă o colecție de unelte esențiale pentru muzicieni și studenți. Exploră calculatoarele și testele de antrenament auditiv pentru a-ți îmbunătăți abilitățile muzicale.
sv_se: MusicTools erbjuder en samling grundläggande verktyg för musiker och elever. Utforska våra räknare och öraträningstest för att förbättra dina musikaliska färdigheter.
tr_tr: MusicTools, müzisyenler ve öğrenciler için temel araçlar topluluğu sunar. Müzik becerilerinizi geliştirmek için hesaplayıcılarımızı ve kulak eğitim testlerimizi keşfedin.
uk_ua: MusicTools надає збірку необхідних інструментів для музикантів та студентів. Ознайомтеся з нашими калькуляторами та тестами на розвиток слуху, щоб покращити свої музичні навички.
zh_cn: MusicTools 提供了一系列音乐家和学生必备的工具。通过我们的计算器和听觉训练测试，提升您的音乐技能。
zh_hk: MusicTools 提供一系列對音樂人及學生而言不可或缺的工具。透過我們的計算機及聽力訓練測試，提升你的音樂技巧。
zh_tw: MusicTools 提供一系列音樂家與學生不可或缺的工具。探索我們的計算工具與聽覺訓練測驗，提升您的音樂技能。

source: Open
ar_sa: افتح
de_de: Öffnen
el_gr: Άνοιγμα
es_es: Abrir
fi_fi: Avaa
fr_fr: Ouvrir
hi_in: खोलें
it_it: Apri
ko_kr: 열기
pl_pl: Otwórz
pt_br: Abrir
ro_ro: Deschide
sv_se: Öppna
tr_tr: Aç
uk_ua: Відкрити
zh_cn: 打开
zh_hk: 開啟
zh_tw: 開啟

source: OpenID Connect Integration
ar_sa: تكامل OpenID Connect
el_gr: Ενσωμάτωση OpenID Connect
es_es: Integración con OpenID Connect
fi_fi: OpenID Connect -integraatio
fr_fr: Intégration OpenID Connect
hi_in: OpenID कनेक्ट एकीकरण
id_id: Integrasi OpenID Connect
it_it: Integrazione OpenID Connect
ja_jp: OpenID Connect 統合
ko_kr: OpenID Connect 통합
nl_nl: OpenID Connect-integratie
pl_pl: Integracja z OpenID Connect
pt_br: Integração com OpenID Connect
ro_ro: Integrare OpenID Connect
ru_ru: Интеграция OpenID Connect
sv_se: Integration av OpenID Connect
th_th: การผสานระบบ OpenID Connect
tr_tr: OpenID Connect Entegrasyonu
uk_ua: Інтеграція OpenID Connect
vi_vn: Tích hợp OpenID Connect
zh_cn: OpenID Connect 集成
zh_hk: OpenID Connect 集成
zh_tw: OpenID Connect 集成

source: Play Random Melody
ar_sa: تشغيل لحن عشوائي
da_dk: Afspil tilfældig melodi
de_de: Zufällige Melodie abspielen
el_gr: Παίξε Τυχαία Μελωδία
es_es: Reproducir melodía aleatoria
fi_fi: Soita satunnainen melodia
fr_fr: Jouer une mélodie aléatoire
hi_in: यादृच्छिक धुन बजाएं
id_id: Mainkan Melodi Acak
it_it: Riproduci una melodia casuale
ja_jp: ランダムなメロディを再生
ko_kr: 랜덤 멜로디 재생
nl_nl: Speel Willekeurige Melodie
pl_pl: Odtwórz losową melodię
pt_br: Tocar Melodia Aleatória
ro_ro: Redă o melodie aleatorie
ru_ru: Воспроизвести случайную мелодию
sv_se: Spela slumpmässig melodi
th_th: เล่นทำนองสุ่ม
tr_tr: Rastgele Melodi Çal
uk_ua: Відтворити випадкову мелодію
vi_vn: Phát Giai Điệu Ngẫu Nhiên
zh_cn: 播放随机旋律
zh_hk: 播放隨機旋律
zh_tw: 播放隨機旋律

source: RBAC Authorization
ar_sa: الصلاحيات القائمة على الأدوار (RBAC)
da_dk: RBAC-autorisering
de_de: RBAC-Berechtigung
el_gr: Προστασία βασισμένη σε ρόλους (RBAC)
es_es: Autorización RBAC
fi_fi: Roolipohjainen käyttöoikeusvalvonta
fr_fr: Autorisation RBAC
hi_in: RBAC प्राधिकरण
id_id: Otorisasi RBAC
it_it: Autorizzazione RBAC
ja_jp: RBAC 認証
ko_kr: 역할 기반 접근 제어
nl_nl: RBAC-autorisatie
pl_pl: Autoryzacja RBAC
pt_br: Autorização RBAC
ro_ro: Autorizare RBAC
ru_ru: Авторизация на основе ролей (RBAC)
sv_se: RBAC-autentisering
th_th: การอนุญาตแบบ RBAC
tr_tr: RBAC Yetkilendirme
uk_ua: Авторизація RBAC
vi_vn: Phân quyền RBAC
zh_cn: 基于角色的权限控制
zh_hk: RBAC 權限管理
zh_tw: RBAC 權限管理

# Read the document
source: Read the documentation
ar_sa: اقرأ المستند
da_dk: Læs dokumentet
de_de: Dokument lesen
el_gr: Διαβάστε το έγγραφο
es_es: Leer el documento
fi_fi: Lue dokumentti
fr_fr: Lire le document
hi_in: दस्तावेज़ पढ़ें
id_id: Baca dokumentasi
it_it: Leggi il documento
ja_jp: ドキュメントを読む
ko_kr: 문서 읽기
nl_nl: Lees het document
pl_pl: Przeczytaj dokument
pt_br: Leia o documento
ro_ro: Citește documentul
ru_ru: Читать документ
sv_se: Läs dokumentet
th_th: อ่านเอกสาร
tr_tr: Belgeyi okuyun
uk_ua: Прочитати документ
vi_vn: Đọc tài liệu
zh_cn: 阅读文档
zh_hk: 閱讀文件
zh_tw: 閱讀文件

source: Responsive Design
ar_sa: تصميم متجاوب
da_dk: Responsiv design
de_de: Reaktives Design
el_gr: Ευέλικτος Σχεδιασμός
es_es: Diseño adaptable
fi_fi: Vastaa suunnittelu
fr_fr: Conception réactive
hi_in: प्रतिक्रियाशील डिज़ाइन
id_id: Desain Responsif
it_it: Progettazione Reattiva
ja_jp: 応答性のあるデザイン
ko_kr: 반응형 디자인
nl_nl: Responsieve ontwerp
pl_pl: Responsywny дизайн
pt_br: Design Responsivo
ro_ro: Design responsiv
ru_ru: Адаптивный дизайн
sv_se: Responsiv design
th_th: การออกแบบที่ตอบสนอง
tr_tr: Yanıt Veren Tasarım
uk_ua: Адаптивний дизайн
vi_vn: Thiết kế phản hồi
zh_cn: 响应式设计
zh_hk: 響應式設計
zh_tw: 響應式設計

source: Robust Integration Testing
ar_sa: اختبارات دمج قوية
da_dk: Robust integrationsprøvning
de_de: Robuste Integrationstests
el_gr: Αξιόπιστη Δοκιμή Ενοποίησης
es_es: Pruebas de integración robustas
fi_fi: Luotettava integraatiotestaus
fr_fr: Tests d'intégration robustes
hi_in: दृढ़ एकीकरण परीक्षण
id_id: Pengujian Integrasi yang Kuat
it_it: Test di integrazione robusti
ja_jp: 堅牢な統合テスト
ko_kr: 강력한 통합 테스팅
nl_nl: Robuuste integratietesting
pl_pl: Solidne testy integracyjne
pt_br: Testes de Integração Robustos
ro_ro: Testare de integrare robustă
ru_ru: Надежное интеграционное тестирование
sv_se: Robust integreringstestning
th_th: การทดสอบการผสานระบบที่มั่นคง
tr_tr: Güçlü Entegrasyon Testi
uk_ua: Надійне тестування інтеграції
vi_vn: Kiểm thử tích hợp mạnh mẽ
zh_cn: 强大的集成测试
zh_hk: 穩健的整合測試
zh_tw: 強健的整合測試

source: Scheduled Task Management
ar_sa: إدارة المهام المجدولة
da_dk: Planlagt opgavestyring
de_de: Geplante Aufgabenverwaltung
el_gr: Διαχείριση Προγραμματισμένων Εργασιών
es_es: Gestión de tareas programadas
fi_fi: Suunnitellun tehtävän hallinta
fr_fr: Gestion des tâches planifiées
hi_in: योजित कार्य प्रबंधन
id_id: Manajemen Tugas yang Dijadwalkan
it_it: Gestione dei compiti pianificati
ja_jp: スケジュールタスク管理
ko_kr: 스케줄된 작업 관리
nl_nl: Geplande taakbeheer
pl_pl: Zarządzanie zaplanowanymi zadaniami
pt_br: Gerenciamento de Tarefas Agendadas
ro_ro: Gestionarea sarcinilor programate
ru_ru: Планировщик задач
sv_se: Schemahantering av uppgifter
th_th: การจัดการงานที่กำหนดเวลา
tr_tr: Zamanlanmış Görev Yönetimi
uk_ua: Планування завдань
vi_vn: Quản lý Nhiệm vụ Lịch trình
zh_cn: 定时任务管理
zh_hk: 排程工作管理
zh_tw: 排程工作管理

source: Seamlessly integrate with any OpenID Connect provider, with automatic role synchronization.
ar_sa: تتكامل بسلاسة مع أي مزود OpenID Connect، مع مزامنة تلقائية للدور.
da_dk: Integrationer uden afbrydelser med enhver OpenID Connect-leverandør, med automatisk rollesynkronisering.
de_de: Nahtlos mit jedem OpenID Connect-Anbieter integrieren, inklusive automatischer Rollensynchronisierung.
el_gr: Ολοκληρωμένη ενσωμάτωση με οποιοδήποτε προμηθευτή OpenID Connect, με αυτόματη συγχρονισμό ρόλων.
es_es: Integración fluida con cualquier proveedor de OpenID Connect, con sincronización automática de roles.
fi_fi: Liitä sujuvasti mihin tahansa OpenID Connect -tarjoajahan, automaattisen roolisynkronoinnin kanssa.
fr_fr: Intégrez-vous sans heurt à tout fournisseur OpenID Connect, avec synchronisation automatique des rôles.
hi_in: किसी भी OpenID Connect प्रदाता के साथ बिना किसी रुकावट के एकीकृत करें, स्वचालित भूमिका समन्वय के साथ।
id_id: Terintegrasi secara mulus dengan penyedia OpenID Connect mana pun, dengan sinkronisasi peran otomatis.
it_it: Integrazione fluida con qualsiasi provider OpenID Connect, con sincronizzazione automatica dei ruoli.
ja_jp: 任意のOpenID Connectプロバイダーとシームレスに統合でき、ロールの自動同期が可能です。
ko_kr: 어떤 OpenID Connect 공급자와도 원활하게 통합되며, 역할 동기화가 자동으로 이루어집니다.
nl_nl: Naadloos integreren met elke OpenID Connect-provider, met automatische rol synchronisatie.
pl_pl: Bezproblematyczna integracja z dowolnym dostawcą OpenID Connect z automatycznym synchronizowaniem ról.
pt_br: Integre-se de forma transparente a qualquer provedor do OpenID Connect, com sincronização automática de funções.
ro_ro: Integrează ușor cu orice furnizor OpenID Connect, cu sincronizare automată a rolurilor.
ru_ru: Безупречно интегрируйтесь с любым провайдером OpenID Connect с автоматической синхронизацией ролей.
sv_se: Smygande integrering med vilken OpenID Connect-leverantör som helst, med automatisk rollsynkronisering.
th_th: รวมเข้ากับผู้ให้บริการ OpenID Connect ทุกตัวได้อย่างราบรื่น พร้อมการซิงค์บทบาทอัตโนมัติ
tr_tr: Herhangi bir OpenID Connect sağlayıcısıyla sorunsuz entegre olun, otomatik rol senkronizasyonu ile.
uk_ua: Надзвичайно легко інтегрувати з будь-яким постачальником OpenID Connect із автоматичною синхронізацією ролей.
vi_vn: Tích hợp liền mạch với bất kỳ nhà cung cấp OpenID Connect nào, với đồng bộ vai trò tự động.
zh_cn: 无缝集成任意 OpenID Connect 提供商，支持自动角色同步。
zh_hk: 無縫整合任何 OpenID Connect 提供者，並自動同步角色
zh_tw: 輕鬆整合任何 OpenID Connect 提供者，並自動同步角色。

source: Smart Configuration Overrides
ar_sa: تجاوزات التهيئة الذكية
da_dk: Smart Konfigurations-Overrides
de_de: Intelligente Konfigurationsoverrides
el_gr: Έξυπνες Αντικαταστάσεις Ρυθμίσεων
es_es: Sobrescrituras inteligentes de configuración
fi_fi: Älykäs asetusten korvaus
fr_fr: Remplacements intelligents de configuration
hi_in: स्मार्ट कॉन्फ़िगरेशन ओवरराइड्स
id_id: Oversight Konfigurasi Cerdas
it_it: Sovrascrizioni Intelligenti alla Configurazione
ja_jp: スマート設定オーバーライド
ko_kr: 스마트 설정 오버라이드
nl_nl: Slimme Configuratie-Overschrijvingen
pl_pl: Inteligentne Zastąpienia Konfiguracji
pt_br: Substituição Inteligente de Configurações
ro_ro: Supravățuiri inteligente de configurare
ru_ru: Умные переопределения конфигурации
th_th: การแทนที่การตั้งค่าอัจฉริยะ
tr_tr: Akıllı Yapılandırma Geçersiz Kılma
uk_ua: Розумні перевизначення налаштувань
vi_vn: Ghi đè cấu hình thông minh
zh_cn: 智能配置覆盖
zh_hk: 智能設定覆蓋
zh_tw: 智慧型設定覆蓋

# Smart dark mode that adapts to the user&apos;s system settings.
source: Smart dark mode that adapts to the user's system settings.
ar_sa: وضع داكن ذكي يتكيف مع إعدادات النظام الخاصة بالمستخدم.
da_dk: Smart mørk tilstand, der tilpasser sig brugerenes systemindstillinger.
de_de: Intelligenter Dunkelmodus, der sich an die Systemeinstellungen des Benutzers anpasst.
el_gr: Έξυπνο σκοτεινό θέμα που προσαρμόζεται στις ρυθμίσεις του συστήματος του χρήστη.
es_es: Modo oscuro inteligente que se adapta a la configuración del sistema del usuario.
fi_fi: Älykäs tumma tila, joka mukautuu käyttäjän järjestelmäasetuksiin.
fr_fr: Mode sombre intelligent qui s'adapte aux paramètres système de l'utilisateur.
hi_in: स्मार्ट डार्क मोड जो उपयोगकर्ता के सिस्टम सेटिंग्स के अनुसार अनुकूलित होता है।
id_id: Mode gelap cerdas yang menyesuaikan diri dengan pengaturan sistem pengguna.
it_it: Modalità scura intelligente che si adatta alle impostazioni di sistema dell'utente.
ja_jp: ユーザーのシステム設定に合わせて自動調整されるスマートなダークモード。
ko_kr: 사용자 시스템 설정에 자동으로 맞춰지는 스마트 다크 모드입니다.
nl_nl: Slimme donkere modus die zich aanpast aan de systeeminstellingen van de gebruiker.
pl_pl: Inteligentny tryb ciemny dopasowujący się do ustawień systemu użytkownika.
pt_br: Modo escuro inteligente que se adapta às configurações do sistema do usuário.
ro_ro: Mod întunecat inteligent care se adaptează la setările sistemului utilizatorului.
ru_ru: Умный темный режим, который адаптируется к настройкам системы пользователя.
sv_se: Smart mörkt läge som anpassas efter användarens systeminställningar.
th_th: โหมดมืดอัจฉริยะที่ปรับตัวตามการตั้งค่าระบบของผู้ใช้งาน
tr_tr: Akıllı karanlık mod, kullanıcı sistem ayarlarına uyar.
uk_ua: Розумний темний режим, який адаптується до налаштувань системи користувача.
vi_vn: Chế độ tối thông minh tự động điều chỉnh theo cài đặt hệ thống của người dùng.
zh_cn: 智能深色模式，可自动适配用户的系统设置。
zh_hk: 智能深色模式，可根據用戶系統設定自動調整。
zh_tw: 智慧型深色模式，可依使用者的系統設定自動調整。

source: Start a new project
ar_sa: 시작 مشروع جديد
da_dk: Start et nyt projekt
de_de: Neues Projekt starten
el_gr: Ξεκινήστε ένα νέο έργο
es_es: Iniciar un nuevo proyecto
fi_fi: Aloita uusi projekti
fr_fr: Démarrer un nouveau projet
hi_in: एक नया प्रोजेक्ट शुरू करें
id_id: Mulai proyek baru
it_it: Avvia un nuovo progetto
ja_jp: 新しいプロジェクトの開始
ko_kr: 새 프로젝트 시작
nl_nl: Een nieuw project starten
pl_pl: Rozpocznij nowy projekt
pt_br: Iniciar um novo projeto
ro_ro: Începe un proiect nou
ru_ru: Начать новый проект
sv_se: Starta ett nytt projekt
th_th: เริ่มโครงการใหม่
tr_tr: Yeni bir proje başlat
uk_ua: Почати новий проект
vi_vn: Bắt đầu một dự án mới
zh_cn: 开始新项目
zh_hk: 開始新專案
zh_tw: 開始新專案

source: Start Test
ar_sa: ابدأ الاختبار
de_de: Test starten
el_gr: Ξεκίνα Τεστ
es_es: Iniciar prueba
fi_fi: Aloita testi
fr_fr: Démarrer le test
hi_in: परीक्षण शुरू करें
it_it: Avvia il test
ko_kr: 테스트 시작
nl_nl: Test starten
pl_pl: Rozpocznij test
pt_br: Iniciar Teste
sv_se: Starta test
tr_tr: Testi Başlat
uk_ua: Почати тест
zh_cn: 开始测试
zh_hk: 開始測試
zh_tw: 開始測驗

source: Supports both environment variables and database-backed settings, with automatic priority given to environment variables for seamless overrides.
ar_sa: يدعم متغيرات البيئة والإعدادات المخزنة في قاعدة البيانات، مع منح الأولوية التلقائية لمتغيرات البيئة لضمان التجاوزات السلسة.
da_dk: Støtter både miljøvariabler og databasebaserede indstillinger, med automatisk prioritet til miljøvariabler for smidige genoptagelser.
de_de: Unterstützt sowohl Umgebungsvariablen als auch datenbankbasierte Einstellungen, wobei Umgebungsvariablen automatisch Vorrang erhalten, um nahtlose Überschreibungen zu ermöglichen.
el_gr: Υποστηρίζει και τις δύο μεθόδους, μεταβλητές περιβάλλοντος και ρυθμίσεις που αποθηκεύονται σε βάση δεδομένων, με αυτόματη προτεραιότητα προς τις μεταβλητές περιβάλλοντος για ομαλές επικαλύψεις.
es_es: Admite tanto variables de entorno como configuraciones basadas en base de datos, asignando automáticamente prioridad a las variables de entorno para anulaciones sin problemas.
fi_fi: Tukee sekä ympäristömuuttujia että tietokantaperustaisia asetuksia, ja annetaan ympäristömuuttujille automaattisesti etusija ilman rajoituksia.
fr_fr: Prend en charge les variables d'environnement et les paramètres stockés dans la base de données, avec une priorité automatique accordée aux variables d'environnement pour des substitutions fluides.
hi_in: पर्यावरण चर और डेटाबेस-आधारित सेटिंग्स दोनों का समर्थन करता है, जहां पर्यावरण चर को बिना किसी रुकावट के ओवरराइड करने के लिए स्वचालित प्राथमिकता दी जाती है।
id_id: Mendukung variabel lingkungan dan pengaturan berbasis basis data, dengan prioritas otomatis diberikan kepada variabel lingkungan untuk penggantian yang mulus.
it_it: Supporta sia le variabili d'ambiente che le impostazioni basate sul database, con priorità automatica alle variabili d'ambiente per sovrascritture senza interruzioni.
ja_jp: 環境変数とデータベースベースの設定の両方をサポートしており、環境変数に自動的に優先順位が与えられ、スムーズな上書きが可能になります。
ko_kr: 환경 변수와 데이터베이스 기반 설정을 모두 지원하며, 환경 변수에 자동 우선 순위가 주어져 원활한 오버라이드를 제공합니다.
nl_nl: Ondersteunt zowel omgevingsvariabelen als database-gebaseerde instellingen, met automatische voorrang aan omgevingsvariabelen voor naadloze overschrijvingen.
pl_pl: Obsługuje zarówno zmienne środowiskowe, jak i ustawienia oparte na bazie danych, przy czym zmienne środowiskowe otrzymują automatycznie wyższy priorytet, co zapewnia bezproblemowe zastępowanie ustawień.
pt_br: Suporta tanto variáveis de ambiente quanto configurações baseadas em banco de dados, com prioridade automática dada às variáveis de ambiente para substituições sem problemas.
ro_ro: Suportă atât variabilele de mediu, cât și setările stocate în baza de date, cu prioritate automată acordată variabilelor de mediu pentru suprascrieri fără probleme.
ru_ru: Поддерживает как переменные среды, так и настройки, хранящиеся в базе данных, автоматически приоритизируя переменные среды для бесшовного переопределения.
sv_se: Stöder både miljövariabler och inställningar som lagras i databas, med automatisk prioritet till miljövariabler för smidiga åsidosättningar.
th_th: รองรับตัวแปรสภาพแวดล้อมและตั้งค่าที่เก็บในฐานข้อมูลทั้งสองแบบ โดยให้ลำดับความสำคัญอัตโนมัติแก่ตัวแปรสภาพแวดล้อมเพื่อการแทนที่อย่างราบรื่น
tr_tr: Ortam değişkenleri ve veritabanına dayalı ayarlar destekler, sorunsuz geçişler için otomatik olarak ortam değişkenlerine öncelik verilir.
uk_ua: Підтримує як змінні середовища, так і налаштування, зберігані в базі даних, з автоматичним пріоритетом для змінних середовища для безперервного перевизначення.
vi_vn: Hỗ trợ cả biến môi trường và cài đặt dựa trên cơ sở dữ liệu, với ưu tiên tự động cho biến môi trường để ghi đè một cách liền mạch.
zh_cn: 支持环境变量和数据库配置，自动优先使用环境变量以实现无缝覆盖。
zh_hk: 支援環境變數及資料庫支援的設定，並自動優先使用環境變數以實現無縫覆蓋。
zh_tw: 支援環境變數與資料庫儲存的設定，並自動優先使用環境變數以實現無縫覆蓋。

source: Test your ear by identifying musical intervals.
ar_sa: اختبار مهارتك السمعية من خلال تحديد الفواصل الموسيقية.
de_de: Teste dein Gehör, indem du musikalische Intervalle identifizierst.
el_gr: Δοκιμάστε την ακοή σας, αναγνωρίζοντας μουσικά διαστήματα.
es_es: Prueba tu oído identificando intervalos musicales.
fi_fi: Testaa kuuloasi tunnistamalla musikaalisia välejä.
fr_fr: Testez votre oreille en identifiant des intervalles musicaux.
hi_in: संगीतात्मक अंतरों की पहचान करके अपने कान का परीक्षण करें।
it_it: Mettila alla prova identificando gli intervalli musicali.
ko_kr: 음악적 간격을 인식함으로써 귀를 시험해 보세요.
nl_nl: Test je oor door muzikale intervallen te herkennen.
pl_pl: Spróbuj swojego słuchu, identyfikując odstępy muzyczne.
pt_br: Teste seu ouvido identificando intervalos musicais.
ro_ro: Testează-ți auzul identificând intervale muzicale.
sv_se: Testa ditt öra genom att identifiera musikaliska intervall.
tr_tr: Müziksel aralıkları tanımlayarak kulağınızı test edin.
uk_ua: Протестуйте свій слух, визначаючи музичні інтервали.
zh_cn: 通过识别音乐音程来测试你的听力。
zh_hk: 測試你的聽覺，辨認音樂音程。
zh_tw: 透過辨識音樂音程來測試你的聽力。

source: The Magic of the Circle of Fifths
ar_sa: سحر دائرة الخامسات
da_dk: Cirklen af Kvinters Magi
de_de: Die Magie des Quintenzirkels
el_gr: Η Μαγεία του Κύκλου των Πέμπτων
es_es: La Magia del Círculo de Quintas
fi_fi: Kvinttien ympyrän taika
fr_fr: La Magie du Cercle des Quintes
hi_in: पंचम के चक्र का जादू
id_id: Keajaiban Lingkaran Kwin
it_it: La Magia del Circolo delle Quinte
ja_jp: 五度圏の魔法
ko_kr: 5도권의 마법
nl_nl: De Magie van de Kwintencirkel
pl_pl: Magia Kręgu Kwint
pt_br: A Magia do Círculo de Quintas
ro_ro: Magia Cercului de Cvinte
ru_ru: Магия квинтового круга
sv_se: Kvintcirkelns magi
th_th: เวทมนตร์ของวงจรฟิฟธ์
tr_tr: Beşliler Çemberinin Büyüsü
uk_ua: Чарівність кола квінт
vi_vn: Sự Kỳ Diệu Của Vòng Tròn Quãng 5
zh_cn: 五度圈的神奇魔力
zh_hk: 五度圈嘅魔力
zh_tw: 五度圈的神奇魔力
