Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Index.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_br, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, vi_vn, zh_cn, zh_hk, zh_tw

source: Features a built-in file management system with automatic avatar compression and privacy protection.
ar_sa: يتميز بنظام إدارة ملفات مدمج مع ضغط تلقائي للصورة الرمزية وحماية الخصوصية.
da_dk: Funktioner et indbygget filhåndteringssystem med automatisk avatarkomprimering og privatlivsbeskyttelse.
de_de: Verfügt über ein integriertes Dateiverwaltungssystem mit automatischer Avatar-Komprimierung und Datenschutzschutz.
el_gr: Διαθέτει σύστημα διαχείρισης αρχείων ενσωματωμένο στο σύστημα με αυτόματη συμπίεση αβατάρ και προστασία της ιδιωτικότητας.
es_es: Incluye un sistema de gestión de archivos integrado con compresión automática de avatares y protección de privacidad.
fi_fi: Sisältää upotetun tiedostojen hallintajärjestelmän automaattisen etukuvien kompressoinnin ja yksityisyyssuojauksen kanssa.
fr_fr: Propose un système de gestion de fichiers intégré avec compression automatique des avatars et protection de la vie privée.
hi_in: एक स्वचालित एवं अवतार संपीड़न और गोपनीयता सुरक्षा के साथ एक निर्मित फ़ाइल प्रबंधन प्रणाली के साथ विशेषता है।
id_id: Memiliki sistem manajemen file bawaan dengan kompresi avatar otomatis dan perlindungan privasi.
it_it: Dispone di un sistema di gestione file integrato con compressione automatica degli avatar e protezione della privacy.
ja_jp: 自動アバター圧縮およびプライバシー保護機能を備えた組み込みファイル管理システムを搭載しています。
ko_kr: 자동 아바타 압축 및 개인정보 보호 기능이 포함된 내장 파일 관리 시스템을 제공합니다.
nl_nl: Heeft een ingebouwd bestandsbeheersysteem met automatische avatarcompressie en privacybescherming.
pl_pl: Posiada wbudowany system zarządzania plikami z automatycznym kompresowaniem awatarów i ochroną prywatności.
pt_br: Possui um sistema integrado de gerenciamento de arquivos com compressão automática de avatares e proteção de privacidade.
ro_ro: Oferește un sistem integrat de gestionare a fișierelor cu comprimare automată a avatarelor și protecția confidențialității.
ru_ru: Обладает встроенной системой управления файлами с автоматической компрессией аватаров и защитой конфиденциальности.
sv_se: Har en inbyggd filhanteringslösning med automatisk komprimering av avatarer och integritetsskydd.
th_th: มีระบบจัดการไฟล์แบบฝังในตัวพร้อมการบีบอัดภาพโปรไฟล์อัตโนมัติและป้องกันความเป็นส่วนตัว
tr_tr: Gömülü bir dosya yönetim sistemi, otomatik avatar sıkıştırma ve gizlilik koruması ile birlikte gelir.
uk_ua: Містить вбудовану систему управління файлами з автоматичною компресією аватарів та захистом приватності.
vi_vn: Tích hợp hệ thống quản lý tập tin tích hợp với nén ảnh đại diện tự động và bảo vệ quyền riêng tư.
zh_cn: 内置文件管理系统，支持自动头像压缩与隐私保护。
zh_hk: 具備內建檔案管理系統，支援自動頭像壓縮及私隱保護。
zh_tw: 具備內建的檔案管理系統，支援自動頭像壓縮與隱私保護。

source: Handle recurring jobs like cleanup and synchronization with a comprehensive GUI for monitoring execution history and logs.
ar_sa: تعامل مع المهام الدورية مثل التنظيف والمزامنة باستخدام واجهة رسومية شاملة لمراقبة سجلات التاريخ والسجلات.
da_dk: Håndter gentagende opgaver som rydning og synkronisering med en omfattende brugergrænseflade til overvågning af udførelseshistorik og logfiler.
de_de: Verwalten Sie wiederkehrende Aufgaben wie Bereinigung und Synchronisation mit einer umfassenden GUI zur Überwachung der Ausführungsverlauf und Protokolle.
el_gr: Διαχειριστείτε επαναλαμβανόμενες εργασίες όπως καθαρισμός και συγχρονισμός με ένα εκτεταμένο GUI για την παρακολούθηση της ιστορίας εκτέλεσης και των καταγραφών.
es_es: Administra tareas recurrentes como limpieza y sincronización con una interfaz gráfica completa para supervisar el historial de ejecución y los registros.
fi_fi: Käsittele toistuvia tehtäviä, kuten siivouksen ja synkronoinnin, laajalla GUI:lla suoritushistorian ja lokien seurantaan.
fr_fr: Gérez les tâches récurrentes telles que le nettoyage et la synchronisation avec une interface graphique complète pour surveiller l'historique d'exécution et les journaux.
hi_in: नियमित कार्यों जैसे साफ़ करना और समन्वयन को एक व्यापक GUI के साथ प्रबंधित करें जो निष्पादन इतिहास और लॉग के निगरानी के लिए उपलब्ध है।
id_id: Kelola pekerjaan berulang seperti pembersihan dan sinkronisasi dengan antarmuka GUI komprehensif untuk memantau riwayat eksekusi dan log.
it_it: Gestisci i compiti ricorrenti come pulizia e sincronizzazione con un'interfaccia grafica completa per il monitoraggio della cronologia di esecuzione e dei log.
ja_jp: クリーンアップや同期などの繰り返し実行ジョブを、実行履歴およびログの監視が可能な包括的なGUIで管理します。
ko_kr: 정기적인 작업(예: 정리 및 동기화)을 처리하고 실행 이력 및 로그를 모니터링할 수 있는 포괄적인 GUI를 활용하세요.
nl_nl: Verwerk herhalende taken zoals opschonen en synchronisatie met een uitgebreide GUI voor het bewaken van uitvoeringsgeschiedenis en logbestanden.
pl_pl: Kieruj powtarzalnymi zadaniami, takimi jak oczyszczanie i synchronizacja, za pomocą kompleksowego interfejsu graficznego do monitorowania historii wykonywania i dzienników.
pt_br: Gerencie tarefas recorrentes, como limpeza e sincronização, com uma interface gráfica abrangente para monitorar o histórico de execução e os registros.
ro_ro: Gestionează sarcinile periodice, cum ar fi curățarea și sincronizarea, cu o interfață grafică completă pentru monitorizarea istoricului de execuție și a jurnalelor.
ru_ru: Управляйте повторяющимися задачами, такими как очистка и синхронизация, с помощью комплексного графического интерфейса для мониторинга истории выполнения и журналов.
sv_se: Hantera återkommande jobb som rengöring och synkronisering med en omfattande GUI för att övervaka utförandehistorik och loggar.
th_th: จัดการงานที่เกิดซ้ำ เช่น การทำความสะอาดและประสานข้อมูล ด้วยอินเทอร์เฟซกราฟิกที่ครอบคลุมสำหรับติดตามประวัติการดำเนินการและบันทึกการใช้งาน
tr_tr: Temizlik ve senkronizasyon gibi tekrarlayan görevleri, yürütme geçmişi ve günlükleri izlemek için kapsamlı bir GUI ile yönetin.
uk_ua: Керуйте повторюваними завданнями, такими як очищення та синхронізація, за допомогою комплексного графічного інтерфейсу для моніторингу історії виконання та журналів.
vi_vn: Xử lý các tác vụ lặp lại như dọn dẹp và đồng bộ hóa với giao diện người dùng toàn diện để theo dõi lịch sử thực thi và nhật ký.
zh_cn: 轻松管理如清理和同步等重复任务，通过全面的图形界面监控执行历史和日志。
zh_hk: 處理重複執行的工作，例如清理和同步，並透過全面的圖形使用者介面監控執行歷史記錄和日誌。
zh_tw: 處理類似清理與同步等重複性工作，並透過完整的 GUI 監控執行歷程與記錄。

source: Hello World!
ar_sa: مرحبا بالعالم!
da_dk: Hej Verden!
de_de: Hallo Welt!
el_gr: Γεια σου Κόσμε!
es_es: Hola Mundo!
fi_fi: Hei Maailma!
fr_fr: Bonjour le monde!
hi_in: नमस्ते दुनिया!
id_id: Halo Dunia!
it_it: Ciao mondo!
ja_jp: こんにちは世界！
ko_kr: 안녕 세계!
nl_nl: Hallo Wereld!
pl_pl: Witaj świecie!
pt_br: Olá Mundo!
ro_ro: Salut lume!
ru_ru: Привет, мир!
sv_se: Hej Värld!
th_th: สวัสดีโลก!
tr_tr: Merhaba Dünya!
uk_ua: Привіт Світ!
vi_vn: Xin chào Thế giới!
zh_cn: 你好，世界！
zh_hk: 你好世界！
zh_tw: 你好世界！

source: Includes extensive documentation and practical examples to get you started quickly.
ar_sa: يشمل وثائق شاملة وأمثلة عملية للبدء بسرعة.
da_dk: Inkluderer omfattende dokumentation og praktiske eksempler, så du hurtigt kan komme i gang.
de_de: Enthält umfangreiche Dokumentation und praktische Beispiele, um Ihnen einen schnellen Einstieg zu ermöglichen.
el_gr: Συμπεριλαμβάνει εκτενή δοκιμασία και πρακτικά παραδείγματα για να ξεκινήσετε γρήγορα.
es_es: Incluye documentación extensa y ejemplos prácticos para que empieces rápidamente.
fi_fi: Sisältää laajaa dokumentaatiota ja käytännön esimerkkejä, joiden avulla pääset nopeasti alkuun.
fr_fr: Inclut une documentation complète et des exemples pratiques pour vous permettre de commencer rapidement.
hi_in: शुरुआत करने के लिए व्यापक दस्तावेज़न और व्यावहारिक उदाहरण शामिल हैं।
id_id: Termasuk dokumentasi yang lengkap dan contoh praktis untuk memulai dengan cepat.
it_it: Include documentazione estesa e esempi pratici per iniziare rapidamente.
ja_jp: すぐに使い始められるように、詳細なドキュメントと実用的な例を豊富に用意しています。
ko_kr: 시작하기 위해 꼭 필요한 풍부한 문서와 실용적인 예제를 포함하고 있습니다.
nl_nl: Inclusief uitgebreide documentatie en praktische voorbeelden om snel aan de slag te gaan.
pl_pl: Zawiera obszerną dokumentację i praktyczne przykłady, abyś mógł szybko rozpocząć pracę.
pt_br: Inclui documentação extensa e exemplos práticos para começar rapidamente.
ro_ro: Include documentație extensivă și exemple practice pentru a începe rapid.
ru_ru: Содержит подробную документацию и практические примеры для быстрого старта.
sv_se: Innehåller omfattande dokumentation och praktiska exempel för att snabbt komma igång.
th_th: รวมเอกสารประกอบอย่างละเอียดและตัวอย่างการใช้งานจริงเพื่อให้คุณเริ่มต้นได้อย่างรวดเร็ว
tr_tr: Kapsamlı belgeler ve hızlı başlamaya yardımcı olacak pratik örnekler içerir.
uk_ua: Містить розгорнуту документацію та практичні приклади для швидкого початку роботи.
vi_vn: Bao gồm tài liệu chi tiết và các ví dụ thực tế để bạn bắt đầu nhanh chóng.
zh_cn: 包含详尽的文档和实用示例，助您快速上手。
zh_hk: 提供詳盡的文件及實用範例，助您快速上手。
zh_tw: 包含詳盡的文件說明與實用範例，讓您快速上手。

source: Integrated File Management
ar_sa: إدارة الملفات المتكاملة
da_dk: Integreret filhåndtering
de_de: Integrierte Dateiverwaltung
el_gr: Ολοκληρωμένη Διαχείριση Αρχείων
es_es: Gestión integrada de archivos
fi_fi: Integroitu tiedostojen hallinta
fr_fr: Gestion intégrée des fichiers
hi_in: एकीकृत फ़ाइल प्रबंधन
id_id: Manajemen Berkas Terintegrasi
it_it: Gestione file integrata
ja_jp: 統合ファイル管理
ko_kr: 통합 파일 관리
nl_nl: Geïntegreerd bestandsbeheer
pl_pl: Zintegrowane zarządzanie plikami
pt_br: Gerenciamento Integrado de Arquivos
ro_ro: Gestionare integrată de fișiere
ru_ru: Интегрированное управление файлами
sv_se: Integrerad filhantering
th_th: การจัดการไฟล์แบบบูรณาการ
tr_tr: Entegre Dosya Yönetimi
uk_ua: Інтегроване керування файлами
vi_vn: Quản lý tập tin tích hợp
zh_cn: 集成文件管理
zh_hk: 整合式檔案管理
zh_tw: 整合式檔案管理

source: Interval Calculator
ar_sa: آلة حاسبة الفواصل
de_de: Intervall-Rechner
el_gr: Υπολογιστής Διαστημάτων
es_es: Calculadora de intervalos
fi_fi: Välimatka-laskin
fr_fr: Calculateur d'intervalle
hi_in: अंतराल कैलकुलेटर
it_it: Calcolatore di Intervalli
ko_kr: 구간 계산기
nl_nl: Intervalrekenmachine
pl_pl: Kalkulator interwałów
pt_br: Calculadora de Intervalos
ro_ro: Calculator de Intervale
sv_se: Intervalkalkylator
tr_tr: Aralık Hesaplayıcı
uk_ua: Калькулятор інтервалів
zh_cn: 音程计算器
zh_hk: 音程計算機
zh_tw: 音程計算機

source: Interval Test
ar_sa: اختبار الفاصل
de_de: Intervall-Test
el_gr: Δοκιμασία Διαστημάτων
es_es: Prueba de intervalos
fi_fi: Välimatkan testi
fr_fr: Test d'intervalle
hi_in: अंतराल परीक्षण
it_it: Test sugli intervalli
ko_kr: 음간 테스트
pl_pl: Test interwałów
pt_br: Teste de Intervalo
ro_ro: Test interval
uk_ua: Тест інтервалів
zh_cn: 音程测试
zh_hk: 音程測試
zh_tw: 音程測驗

source: Keys do not exist in isolation. The 'Circle of Fifths' is music's compass, revealing the order of all key signatures (C -> G -> D...) and their harmonic relationships. It is the core blueprint for composition, arrangement, and improvisation.
ar_sa: المفاتيح الموسيقية ليست منعزلة. إن "دائرة الخامسات" هي بوصلة الموسيقى، فهي تكشف ترتيب جميع سلالم المفاتيح (C -> G -> D...) وعلاقاتها التوافقية. إنها المخطط الأساسي للتأليف، والتوزيع، والارتجال.
da_dk: Tonearter er ikke isolerede. 'Circle of Fifths' er musikens kompas, som afslutter rækkefølgen af alle tonearter (C -> G -> D...) og deres harmoniske sammenhænge. Den er den centrale blåkopi for komposition, arrangement og improvisation.
de_de: Tonarten sind nicht isoliert. Der 'Circle of Fifths' ist der Kompass der Musik, der die Reihenfolge aller Tonarten (C -> G -> D...) und ihre harmonischen Beziehungen offenbart. Er ist der zentrale Bauplan für Komposition, Arrangement und Improvisation.
el_gr: Οι τόνoι δεν είναι απομονωμένοι. Ο «Κύκλος των Πέμπτων» είναι η πυξίδα της μουσικής, αποκαλύπτοντας τη σειρά όλων των τoνικών επιγραφών (C -> G -> D...) και τις αρμονικές τους σχέσεις. Είναι ο βασικός σχεδιασμός για τη σύνθεση, τη διασκευή και την αυτοσχεδιαστική μουσική.
es_es: Las tonalidades no están aisladas. El 'Círculo de Quintas' es la brújula de la música, que revela el orden de todas las armaduras de clave (Do -> Sol -> Re...) y sus relaciones armónicas. Es el plano fundamental para la composición, los arreglos y la improvisación.
fi_fi: Sävyt eivät ole eristyneitä. 'Circle of Fifths' on musiikin kompassi, joka paljastaa kaikkien sävellajien järjestyksen (C -> G -> D...) ja niiden harmoniset suhteet. Se on keskeinen pohjapiirros säveltämiselle, sovitukselle ja improvisoinnille.
fr_fr: Les tonalités ne sont pas isolées. Le 'Cercle des Quintes' est la boussole de la musique, révélant l'ordre de toutes les armures (Do -> Sol -> Ré...) et leurs relations harmoniques. C'est le plan directeur essentiel pour la composition, l'arrangement et l'improvisation.
hi_in: सुर अलग-थलग नहीं होते। 'Circle of Fifths' संगीत का कम्पास है, जो सभी सुर हस्ताक्षरों (C -> G -> D...) के क्रम और उनके सुरीले संबंधों को प्रकट करता है। यह संरचना, आयोजन और आशु रचना के लिए मुख्य नक्शा है।
id_id: Nada-nada kunci tidak terisolasi. 'Circle of Fifths' adalah kompasnya musik, yang mengungkap urutan semua tanda kunci (C -> G -> D...) dan hubungan harmonisnya. Ini adalah cetak biru inti untuk komposisi, aransemen, dan improvisasi.
it_it: Le tonalità non sono isolate. Il 'Circolo delle Quinte' è la bussola della musica, che rivela l'ordine di tutte le armature di chiave (Do -> Sol -> Re...) e le loro relazioni armoniche. È il progetto fondamentale per la composizione, l'arrangiamento e l'improvvisazione.
ja_jp: 調は孤立した存在ではありません。『五度圏』は音楽の羅針盤であり、すべての調号（C → G → D...）の順序とそれらの和声的関係を明らかにします。それは作曲、編曲、即興演奏のための核心となる設計図です。
ko_kr: 조성은 고립되어 있지 않습니다. 'Circle of Fifths'는 음악의 나침반으로, 모든 조표의 순서(C -> G -> D...)와 그 화성 관계를 보여줍니다. 이것은 작곡, 편곡, 즉흥 연주의 핵심 청사진입니다.
nl_nl: Toonsoorten staan niet op zichzelf. De 'Circle of Fifths' is het kompas van de muziek, dat de volgorde van alle toonsoorten (C -> G -> D...) en hun harmonische relaties onthult. Het is de blauwdruk voor compositie, arrangement en improvisatie.
pl_pl: Tonacje nie są odizolowane. 'Koło kwintowe' jest kompasem muzyki, odsłaniającym kolejność wszystkich znaków przykluczowych (C -> G -> D...) oraz ich harmoniczne powiązania. Jest to fundamentalny plan dla kompozycji, aranżacji i improwizacji.
pt_br: As tonalidades não são isoladas. O 'Círculo de Quintas' é a bússola da música, revelando a ordem de todas as armaduras de clave (Dó -> Sol -> Ré...) e suas relações harmônicas. É o plano fundamental para composição, arranjo e improvisação.
ro_ro: Tonurile nu sunt izolate. „Cercul cvintelor” este busola muzicii, dezvăluind ordinea tuturor armăturilor (C -> G -> D...) și a relațiilor lor armonice. Este planul de bază pentru compoziție, aranjament și improvizație.
ru_ru: Тональности не изолированы. «Квинтовый круг» — это компас в музыке, раскрывающий порядок всех тональностей (C -> G -> D...) и их гармонические взаимосвязи. Это основная схема для композиции, аранжировки и импровизации.
sv_se: Tonarter är inte isolerade. 'Circle of Fifths' är musikens kompass, som avslutar ordningen för alla tonarter (C -> G -> D...) och deras harmoniska relationer. Den är kärnmodellen för komposition, arrangemang och improvisation.
th_th: คีย์ไม่ได้แยกจากกัน 'Circle of Fifths' คือเข็มทิศของดนตรี ที่เผยให้เห็นลำดับของคีย์ทั้งหมด (C -> G -> D...) และความสัมพันธ์ทางฮาร์โมนิกของพวกมัน มันคือพิมพ์เขียวหลักสำหรับการแต่งเพลง การเรียบเรียง และการด้นสด
tr_tr: Tonlar izole değildir. 'Beşliler Çemberi', müziğin pusulasıdır; tüm ton imzalarının (C -> G -> D...) sırasını ve armonik ilişkilerini ortaya koyar. Besteleme, düzenleme ve doğaçlama için temel şemadır.
uk_ua: Тональності не існують ізольовано. 'Коло квінт' — це музичний компас, який розкриває порядок усіх ключових знаків (C -> G -> D...) та їх гармонійні зв'язки. Це фундаментальна схема для композиції, аранжування та імпровізації.
vi_vn: Các âm giai không tồn tại biệt lập. 'Circle of Fifths' chính là la bàn của âm nhạc, tiết lộ trật tự của tất cả các dấu hóa (C -> G -> D...) và mối quan hệ hòa âm giữa chúng. Nó là bản thiết kế cốt lõi cho việc sáng tác, hòa âm phối khí và ngẫu hứng.
zh_cn: 调性并非孤立存在。"五度圈"（Circle of Fifths）是音乐世界的罗盘，它揭示了所有调号（C -> G -> D...）的排列顺序及其和声关系，是作曲、编曲与即兴创作的核心蓝图。
zh_hk: 調性並非孤立存在。「五度圈」(Circle of Fifths) 猶如音樂的指南針，揭示所有調號順序（C -> G -> D...）及其和聲關係，是作曲、編曲與即興演奏的核心藍圖。
zh_tw: 調性並非孤立存在。「五度圈」是音樂的羅盤，它揭示了所有調號的順序（C -> G -> D...）及其和聲關係。它是作曲、編曲與即興演奏的核心藍圖。

source: Major Calculator
ar_sa: الآلة الحاسبة للماجور
de_de: Großton-Rechner
el_gr: Μεγάλος Υπολογιστής
es_es: Calculadora de acordes mayores
fi_fi: Suuri laskin
fr_fr: Calculateur de gammes majeures
hi_in: मेजर कैलकुलेटर
it_it: Calcolatore Maggiore
ko_kr: 메이저 계산기
pl_pl: Kalkulator skal major
pt_br: Calculadora de Acordes Maiores
ro_ro: Calculatoarele pentru tonalități majore
sv_se: Stor räknare
tr_tr: Büyük Hesaplayıcı
uk_ua: Калькулятор мажорних акордів
zh_cn: 大调计算器
zh_hk: 大調計算機
zh_tw: 大調計算器

source: Melody Memory Test
ar_sa: اختبار تذكّر اللحن
de_de: Melodie-Gedächtnistest
el_gr: Δοκιμή Μνήμης Μελωδίας
es_es: Prueba de Memoria Melódica
fi_fi: Melodin muistitesti
fr_fr: Test de mémoire mélodique
hi_in: ध्वनि स्मृति परीक्षण
it_it: Test di Memoria Melodica
ko_kr: 멜로디 기억력 테스트
nl_nl: Melodiegeheugen test
pl_pl: Test pamięci melodiowej
pt_br: Teste de Memória Melódica
ro_ro: Test de Memorie Melodică
sv_se: Melodiminnesprov
tr_tr: Melodi Bellek Testi
uk_ua: Тест пам'яті мелодії
zh_cn: 旋律记忆测试
zh_hk: 旋律記憶測試
zh_tw: 旋律記憶測驗

source: Metronome
ar_sa: ميترو놈
de_de: Metronom
el_gr: Μετρονόμος
es_es: Metrónomo
fi_fi: Metronomi
fr_fr: Métronome
hi_in: मेट्रोनोम
it_it: Metronomo
ko_kr: 메트로놈
nl_nl: Metronoom
pl_pl: Metronom
pt_br: Metronomo
ro_ro: Metronom
sv_se: Metronom
uk_ua: Метроном
zh_cn: 节拍器
zh_hk: 節拍器
zh_tw: 節拍器

source: Minor Calculator
ar_sa: الآلة الحاسبة الصغرى
de_de: Moll-Rechner
el_gr: Μικρός Υπολογιστής
es_es: Calculadora menor
fi_fi: Vähemmistö laskin
fr_fr: Calculateur mineur
hi_in: न्यून गणक
it_it: Calcolatore Minore
ko_kr: 미너스 계산기
nl_nl: Minoorrekenmachine
pl_pl: Kalkulator gammowy
pt_br: Calculadora Menor
ro_ro: Calculatoarele pentru tonalități mici
sv_se: Minortillräckare
tr_tr: Minör Hesaplayıcı
uk_ua: Мінорний калькулятор
zh_cn: 小调计算器
zh_hk: 小調計算機
zh_tw: 小調計算器

source: Models are validated on both client and server sides based on data annotations.
ar_sa: تتم مصادقة النماذج على الطرفين العميل والخادم بناءً على ملاحظات البيانات.
da_dk: Modeller valideres på både klient- og serversiden baseret på dataanmeldelser.
de_de: Modelle werden sowohl auf Client- als auch auf Serverseite anhand von Datenannotationen überprüft.
el_gr: Οι μοντέλα ελέγχονται σε επίπεδο πελάτη και εξυπηρετητή βάσει σημειώσεων δεδομένων.
es_es: Los modelos se validan en ambos lados, cliente y servidor, basándose en las anotaciones de datos.
fi_fi: Mallit tarkistetaan sekä asiakas- että palvelinpuolella tietojen annotaatioiden perusteella.
fr_fr: Les modèles sont validés côté client et côté serveur en fonction des annotations de données.
hi_in: मॉडल्स को डेटा एनोटेशन्स के आधार पर क्लाइंट और सर्वर दोनों तरफ वैधता के लिए जांचा जाता है।
id_id: Model divalidasi di sisi klien dan server berdasarkan anotasi data.
it_it: I modelli vengono convalidati sia lato client che lato server in base alle annotazioni dei dati.
ja_jp: モデルは、データ注釈に基づいて、クライアントおよびサーバーの両方で検証されます。
ko_kr: 모델은 데이터 주석에 기반하여 클라이언트 및 서버 측에서 모두 검증됩니다.
nl_nl: Modellen worden gevalideerd aan zowel de client- als de serverside op basis van gegevensannotaties.
pl_pl: Modele są weryfikowane po stronie klienta i serwera na podstawie adnotacji danych.
pt_br: Os modelos são validados nos lados cliente e servidor com base em anotações de dados.
ro_ro: Modelele sunt validate pe ambele părți, client și server, pe baza anotărilor de date.
ru_ru: Модели проверяются на стороне клиента и сервера на основе аннотаций данных.
sv_se: Modeller valideras på både klient- och serversidan baserat på dataannotationer.
th_th: โมเดลจะได้รับการตรวจสอบความถูกต้องทั้งในด้านไคลเอนต์และเซิร์ฟเวอร์ โดยอิงตามการตั้งค่าข้อมูล
tr_tr: Modeller, veri eklemelerine dayalı olarak hem istemci hem de sunucu tarafında doğrulanır.
uk_ua: Моделі валідуються на клієнтській та серверній сторонах на основі анотацій даних.
vi_vn: Các mô hình được xác thực trên cả phía client và server dựa trên các ghi chú dữ liệu.
zh_cn: 模型会根据数据注解在客户端和服务器端进行验证。
zh_hk: 模型會根據資料註釋，在客戶端及伺服器端同時進行驗證。
zh_tw: 模型會根據資料註解，在用戶端與伺服器端同時進行驗證。

source: Multiple Database Provider Support
ar_sa: دعم متعدد مزودي قواعد البيانات
da_dk: Støtte for flere databaseudbydere
de_de: Unterstützung mehrerer Datenbankanbieter
el_gr: Υποστήριξη Πολλαπλών Παρόχων Βάσης Δεδομένων
es_es: Soporte para múltiples proveedores de bases de datos
fi_fi: Useita tietokantapalveluntarjoajia tukeva tuki
fr_fr: Prise en charge de plusieurs fournisseurs de bases de données
hi_in: बहु-डेटाबेस प्रदाता समर्थन
id_id: Dukungan Beberapa Penyedia Basis Data
it_it: Supporto per più provider di database
ja_jp: 複数のデータベースプロバイダーサポート
ko_kr: 다중 데이터베이스 제공자 지원
nl_nl: Ondersteuning voor meerdere databaseproviders
pl_pl: Wsparcie wielu dostawców baz danych
pt_br: Suporte a Múltiplos Provedores de Banco de Dados
ro_ro: Suport pentru mai multe furnizori de baze de date
ru_ru: Поддержка нескольких поставщиков баз данных
sv_se: Stöd för flera databasleverantörer
th_th: การรองรับผู้ให้บริการฐานข้อมูลหลายตัว
tr_tr: Çoklu Veritabanı Sağlayıcı Desteği
uk_ua: Підтримка кількох постачальників баз даних
vi_vn: Hỗ trợ nhiều nhà cung cấp cơ sở dữ liệu
zh_cn: 多数据库提供者支持
zh_hk: 支援多個資料庫提供者
zh_tw: 支援多資料庫提供者

source: Music
ar_sa: الموسيقى
de_de: Musik
el_gr: Μουσική
es_es: Música
fi_fi: Musiikki
fr_fr: Musique
hi_in: संगीत
it_it: Musica
ko_kr: 음악
nl_nl: Muziek
pl_pl: Muzyka
pt_br: Música
ro_ro: Muzică
sv_se: Musik
tr_tr: Müzik
uk_ua: Музика
zh_cn: 音乐
zh_hk: 音樂
zh_tw: 音樂
