Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Interval.*.resx
Languages: ru_ru

source: Augmented Eighteenth
ru_ru: Увеличенная восемнадцатая

source: Augmented Eleventh
ru_ru: Увеличенная ундецима

source: Augmented Fourth
ru_ru: Увеличенная кварта

source: Click a selected key again to deselect it.
ru_ru: Щёлкните по выбранной клавише ещё раз, чтобы отменить её выбор.

source: Click any two keys on the piano below.
ru_ru: Нажмите любые две клавиши на пианино ниже.

source: Dissonance
ru_ru: Диссонанс

source: How to Use
ru_ru: Как использовать

source: Imperfect Consonance
ru_ru: Несовершенный консонанс

source: Interactive Piano
ru_ru: Интерактивное пианино

source: Interval Calculator
ru_ru: Калькулятор интервалов

source: Major Fourteenth
ru_ru: Большая децима

source: Major Ninth
ru_ru: Большая нона

source: Major Second
ru_ru: Большая секунда

source: Major Seventeenth
ru_ru: Большая семнадцатая

source: Major Seventh
ru_ru: Большая септима

source: Major Sixteenth
ru_ru: Большая шестнадцатая

source: Major Sixth
ru_ru: Большая секста

source: Major Tenth
ru_ru: Большая децима

source: Major Third
ru_ru: Большая терция

source: Major Thirteenth
ru_ru: Большая терцдецима

source: Major Twentieth
ru_ru: Большая двадцатая

source: Major Twenty-First
ru_ru: Большая двадцать первая

source: Minor Fourteenth
ru_ru: Малая квартдецима

source: Minor Ninth
ru_ru: Малая нона

source: Minor Second
ru_ru: Малая секунда

source: Minor Seventeenth
ru_ru: Малая семнадцатая

source: Minor Seventh
ru_ru: Малая септима

source: Minor Sixteenth
ru_ru: Малая шестнадцатая

source: Minor Sixth
ru_ru: Малая секста

source: Minor Tenth
ru_ru: Малая децима

source: Minor Third
ru_ru: Малая терция

source: Minor Thirteenth
ru_ru: Малая терцдецима

source: Minor Twentieth
ru_ru: Малая двадцатая

source: Minor Twenty-First
ru_ru: Малая двадцать первая

source: Perfect Consonance
ru_ru: Совершенный консонанс

source: Perfect Eighteenth
ru_ru: Чистая восемнадцатая

source: Perfect Eleventh
ru_ru: Чистая ундецима

source: Perfect Fifteenth
ru_ru: Квинтдецима

source: Perfect Fifth
ru_ru: Чистая квинта

source: Perfect Fourth
ru_ru: Чистая кварта

source: Perfect Nineteenth
ru_ru: Чистая девятнадцатая

source: Perfect Octave
ru_ru: Чистая октава

source: Perfect Twelfth
ru_ru: Чистая дуодецима

source: Perfect Twenty-Second
ru_ru: Чистая двадцать вторая

source: Perfect Unison
ru_ru: Чистая прима

source: Please input with the lower note first
ru_ru: Пожалуйста, введите сначала нижнюю ноту

source: Reset Selection
ru_ru: Сбросить выделение

source: Result
ru_ru: Результат

source: Sharp Dissonance
ru_ru: Резкий диссонанс

source: The first note you select will be the root.
ru_ru: Первая выбранная вами нота будет считаться тоникой.

source: The interval between the two notes will be calculated and displayed.
ru_ru: Интервал между двумя нотами будет вычислен и отображён.

source: to
ru_ru: до

source: Unable to recognize note name
ru_ru: Не удалось распознать название ноты
