Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Major.*.resx
Languages: de_de, fr_fr, zh_hk

source: Chromatic Scale
de_de: Chromatische Tonleiter
fr_fr: Gamme chromatique
zh_hk: 半音音階

source: Circle of Fifths
de_de: Quintenzirkel
fr_fr: Cercle des Quintes
zh_hk: 五度循環

source: How to Use It
de_de: Verwendung
fr_fr: Comment l'utiliser
zh_hk: 使用方法

source: Interactive Piano
de_de: Interaktives Klavier
fr_fr: Piano Interactif
zh_hk: 互動鋼琴

source: Jianpu Key
de_de: Jianpu-Notation
fr_fr: Clé Jianpu
zh_hk: 簡譜調號

source: Key Signature
de_de: Vorzeichen
fr_fr: Armure
zh_hk: 調號

source: Loop Playback
de_de: Wiedergabe schleife
fr_fr: Lecture en boucle
zh_hk: 循環播放

source: Play
de_de: Abspielen
fr_fr: Jouer
zh_hk: 播放

source: Quick Select Key
de_de: Schnellauswahl Tonart
fr_fr: Sélection rapide de la tonalité
zh_hk: 快速選擇調性

source: Rotate Left
de_de: Nach links drehen
fr_fr: Rotation vers la gauche
zh_hk: 向左旋轉

source: Rotate Right
de_de: Nach rechts drehen
fr_fr: Rotation horaire
zh_hk: 向右旋轉

source: Select a Major Key
de_de: Wählen Sie eine Dur-Tonart
fr_fr: Sélectionner une tonalité majeure
zh_hk: 選擇一個大調

source: Song
de_de: Lied
fr_fr: Chanson
zh_hk: 歌曲

source: Song Player
fr_fr: Lecteur de musique
zh_hk: 歌曲播放器

source: The Chromatic Scale shows all 12 notes. The inner numbers (1-7) highlight the notes of the major scale for the selected key.
de_de: Die chromatische Tonleiter zeigt alle 12 Töne. Die inneren Zahlen (1-7) heben die Töne der Dur-Tonleiter für die gewählte Tonart hervor.
fr_fr: L'échelle chromatique montre les 12 notes. Les chiffres intérieurs (1-7) mettent en évidence les notes de la gamme majeure pour la tonalité sélectionnée.
zh_hk: 半音階顯示所有12個音符。內圈數字（1-7）標示出所選調性的大調音階音符。

source: The Circle of Fifths organizes keys based on perfect fifths. Rotating this circle demonstrates how keys are related. Each click (a &apos;fifth&apos;) adds or removes one sharp/flat from the key signature.
de_de: Der Quintenzirkel ordnet Tonarten auf der Grundlage von reinen Quinten an. Das Drehen dieses Kreises zeigt, wie Tonarten miteinander verwandt sind. Jeder Klick (eine ‚Quinte‘) fügt der Tonart einen Kreuz-Vorzeichen hinzu oder entfernt ein B-Vorzeichen.
fr_fr: Le Cercle des Quintes organise les tonalités sur la base des quintes justes. La rotation de ce cercle montre comment les tonalités sont reliées. Chaque clic (une 'quinte') ajoute ou retire un dièse/bémol de l'armure.
zh_hk: 五度圈根據完全五度來組織調性。轉動此圈可展示各調性之間的關係。每次點擊（一個「五度」）會為調號增加或減少一個升號／降號。

source: The Interactive Piano will automatically highlight all the notes (and their scale degrees) for the selected key.
de_de: Das interaktive Piano hebt automatisch alle Noten (und ihre Stufen innerhalb der Tonleiter) für die gewählte Tonart hervor.
fr_fr: Le piano interactif mettra automatiquement en évidence toutes les notes (et leurs degrés de gamme) pour la tonalité sélectionnée.
zh_hk: 互動鋼琴會自動為所選調性高亮所有音符（及其音階級數）。

source: The Key Signature display shows the correct sharps or flats for the key on both the treble and bass clefs.
de_de: Die Anzeige der Vorzeichen zeigt die korrekten Kreuze und Be für die Tonart sowohl im Violin- als auch im Bassschlüssel an.
fr_fr: L'affichage de l'armure montre les dièses ou les bémols corrects pour la tonalité, à la fois sur les clés de sol et de fa.
zh_hk: 調號顯示會喺高音譜號同低音譜號上顯示正確嘅升號同降號。

source: This tool helps you visualize music theory. It connects the Chromatic Scale, the Circle of Fifths, the piano keyboard, and standard music notation all in one place.
de_de: Dieses Tool hilft Ihnen, die Musiktheorie zu visualisieren. Es verbindet die chromatische Tonleiter, den Quintenzirkel, die Klaviertastatur und die Standard-Notation an einem Ort.
fr_fr: Cet outil vous aide à visualiser la théorie musicale. Il relie l'échelle chromatique, le cycle des quintes, le clavier de piano et la notation musicale standard en un seul endroit.
zh_hk: 此工具助你可視化音樂理論。它將半音階、五度圈、鋼琴鍵盤同標準音樂記譜法全部連繫喺同一個地方。

source: Tonic
de_de: Grundton
fr_fr: Tonique
zh_hk: 主音

source: Use the &apos;Rotate&apos; buttons under either circle to select a new key.
de_de: Verwenden Sie die 'Rotate'-Schaltflächen unter einem der Kreise, um eine neue Tonart auszuwählen.
fr_fr: Utilisez les boutons « Rotate » sous l'un ou l'autre des cercles pour sélectionner une nouvelle tonalité.
zh_hk: 使用任一圓形下方的「Rotate」按鈕來選擇新調。

source: Welcome!
de_de: Willkommen!
fr_fr: Bienvenue !
zh_hk: 歡迎！

source: What is this?
de_de: Was ist das?
fr_fr: Qu'est-ce que c'est ?
zh_hk: 這是甚麼？
