Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/MelodyMemory.*.resx
Languages: vi_vn

source: +1 Note / Lvl
vi_vn: +1 Nốt / Cấp

source: +4 Notes / Lvl
vi_vn: +4 Nốt / Cấp

source: +8 Notes / Lvl
vi_vn: +8 Nốt / Cấp

source: ⚠ Last Stand ⚠
vi_vn: ⚠ Tử Chiến Cuối Cùng ⚠

source: 1 Bar
vi_vn: 1 Ô nhịp

source: 1 Note
vi_vn: 1 Nốt

source: 2 Bars
vi_vn: 2 Ô nhịp

source: Add 4 beats per level
vi_vn: Thêm 4 nhịp mỗi cấp độ

source: Add 8 beats per level
vi_vn: Thêm 8 nhịp mỗi cấp độ

source: Add one note per level
vi_vn: Thêm một nốt mỗi cấp độ

source: Atonal
vi_vn: Phi điệu thức

source: Bronze
vi_vn: Đồng

source: C Major
vi_vn: Đô Trưởng

source: Calc
vi_vn: Tính toán

source: Calculation
vi_vn: Tính toán

source: Check tonic only
vi_vn: Chỉ kiểm tra âm chủ

source: Critical Health
vi_vn: Sức Khỏe Nguy Kịch

source: Current Difficulty
vi_vn: Độ Khó Hiện Tại

source: Diamond
vi_vn: Kim Cương

source: Diff
vi_vn: Độ Khó

source: Difficulty
vi_vn: Độ khó

source: Difficulty Breakdown
vi_vn: Phân Tích Độ Khó

source: Difficulty Rating
vi_vn: Đánh giá Độ khó

source: Final Score
vi_vn: Điểm Cuối Cùng

source: Full Chromatic scale (Hard)
vi_vn: Thang âm Chromatic đầy đủ (Khó)

source: Game Over
vi_vn: Trò Chơi Kết Thúc

source: Gold
vi_vn: Vàng

source: Grandmaster
vi_vn: Đại Kiện Tướng

source: Hard
vi_vn: Khó

source: Increment
vi_vn: Tăng dần

source: Intermediate
vi_vn: Trung cấp

source: Level
vi_vn: Cấp độ

source: Level Reached
vi_vn: Cấp độ đạt được

source: Level Reached:
vi_vn: Cấp độ đạt được:

source: Listen to A4 (440Hz)
vi_vn: Nghe nốt A4 (440Hz)

source: Listen to range
vi_vn: Nghe phạm vi

source: Listen to the melody, memorize it, and replay it on the piano.
vi_vn: Lắng nghe giai điệu, ghi nhớ nó, và chơi lại trên đàn piano.

source: Melody Memory
vi_vn: Trí Nhớ Giai Điệu

source: Music Style
vi_vn: Phong cách Âm nhạc

source: No Fail
vi_vn: Không Thất Bại

source: No Preview
vi_vn: Không Xem Trước

source: No Score
vi_vn: Không tính điểm

source: Notes
vi_vn: Nốt nhạc

source: Novice
vi_vn: Người mới bắt đầu

source: Practice
vi_vn: Luyện tập

source: Practice Mode
vi_vn: Chế độ Luyện tập

source: Preview
vi_vn: Xem trước

source: Progression
vi_vn: Tiến Trình

source: Random Key
vi_vn: Phím Ngẫu Nhiên

source: Rank
vi_vn: Hạng

source: Remember the melody and repeat it on the piano.
vi_vn: Hãy nhớ giai điệu và lặp lại nó trên đàn piano.

source: Rookie
vi_vn: Mới vào nghề

source: Root Note
vi_vn: Nốt Gốc

source: Scale
vi_vn: Âm giai

source: Silver
vi_vn: Bạc

source: Skip Preview
vi_vn: Bỏ Qua Xem Trước

source: Standard (A4)
vi_vn: Chuẩn (A4)

source: Standard Pitch (A)
vi_vn: Cao độ chuẩn (A)

source: Start Game
vi_vn: Bắt đầu trò chơi

source: Start immediately
vi_vn: Bắt đầu ngay lập tức

source: Total Score
vi_vn: Tổng Điểm

source: Transposed Major scale
vi_vn: Âm giai Trưởng chuyển điệu

source: Try Again
vi_vn: Thử Lại

source: Visual hints enabled
vi_vn: Đã bật gợi ý trực quan

source: White keys only (Easiest)
vi_vn: Chỉ phím trắng (Dễ nhất)
