Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Metronome.*.resx
Languages: ar_sa

source: BPM
ar_sa: نبضة في الدقيقة

source: Eighth Note (♫)
ar_sa: نوتة ثمنية (♫)

source: Fast (320)
ar_sa: سريع (320)

source: Normal (90)
ar_sa: عادي (90)

source: Quarter Note (♩)
ar_sa: نوتة ربع (♩)

source: Sixteenth Note (♬)
ar_sa: النوتة السادسة عشرة (♬)

source: Slow (1)
ar_sa: بطيء (1)

source: Start
ar_sa: ابدأ

source: Stop
ar_sa: توقف

source: Subdivision
ar_sa: التقسيم

source: Time Signature
ar_sa: ميزان الإيقاع

source: Triplet (3)
ar_sa: ثلاثي (3)
