Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Dashboard/Minor.*.resx
Languages: da_dk, fi_fi, id_id, pt_br, vi_vn

source: Chromatic Scale
da_dk: Kromatisk skala
fi_fi: Kromaattinen asteikko
id_id: Skala Kromatik
pt_br: Escala Cromática
vi_vn: Âm giai Chromatic

source: Circle of Fifths
da_dk: Kvintcirklen
fi_fi: Kvinttiympyrä
id_id: Lingkaran Kuint
pt_br: Círculo de Quintas
vi_vn: Vòng Quãng Năm

source: How to Use It
da_dk: Sådan bruger du det
fi_fi: Käyttöohje
id_id: Cara Menggunakannya
pt_br: Como Usar
vi_vn: Cách Sử Dụng

source: Interactive Piano
da_dk: Interaktivt Klaver
fi_fi: Vuorovaikteinen piano
id_id: Piano Interaktif
pt_br: Piano Interativo
vi_vn: Đàn Piano Tương Tác

source: Jianpu Key
da_dk: Jianpu-nøgle
fi_fi: Jianpu-avain
id_id: Kunci Jianpu
pt_br: Tom do Jianpu
vi_vn: Giản Phổ

source: Key Signature
da_dk: Toneart
fi_fi: Sävellaji
id_id: Tanda Kunci
pt_br: Armadura de Clave
vi_vn: Hóa biểu

source: Loop Playback
da_dk: Gentag afspilning
fi_fi: Toistonauha
id_id: Putar Berulang
pt_br: Repetir em Loop
vi_vn: Phát lại theo vòng lặp

source: Play
da_dk: Afspil
fi_fi: Toista
id_id: Putar
pt_br: Tocar
vi_vn: Phát

# Quick Select Key
source: Quick Key Selection
da_dk: Hurtigt valg af toneart
fi_fi: Pikanäppäinvalinta
id_id: Pilih Kunci Cepat
pt_br: Seleção Rápida de Tom
vi_vn: Chọn Nhanh Âm Giai

# Rotate Left
source: Rotate Anti-clockwise
da_dk: Drej til venstre
fi_fi: Kierrä vasemmalle
id_id: Putar ke Kiri
pt_br: Girar à Esquerda
vi_vn: Xoay Trái

source: Rotate Right
da_dk: Drej til højre
fi_fi: Kierrä oikealle
id_id: Putar Kanan
pt_br: Girar à Direita
vi_vn: Xoay Phải

source: Select a Minor Key
da_dk: Vælg en mol-toneart
fi_fi: Valitse mollisävellaji
id_id: Pilih Tangga Nada Minor
pt_br: Selecionar uma Tom Menor
vi_vn: Chọn một giọng Thứ

source: Song
da_dk: Sang
fi_fi: Kappale
id_id: Lagu
pt_br: Música
vi_vn: Bài hát

# Song Player
source: Music Player
da_dk: Sangafspiller
fi_fi: Kappalesoitin
id_id: Pemutar Lagu
pt_br: Reprodutor de Música
vi_vn: Trình Phát Nhạc

source: The Chromatic Scale displays all 12 notes. The inner numbers (1-7) highlight the notes of the minor scale for the selected key.
da_dk: Den kromatiske skala viser alle 12 toner. De indre tal (1-7) fremhæver toner i mol-skalaen for den valgte toneart.
fi_fi: Kromaattinen asteikko näyttää kaikki 12 nuottia. Sisemmät numerot (1-7) korostavat valitun sävellajin molliasteikon nuotteja.
id_id: Skala Kromatik menampilkan semua 12 nada. Angka di dalam (1-7) menyoroti nada-nada dari tangga nada minor untuk kunci yang dipilih.
pt_br: A Escala Cromática mostra todas as 12 notas. Os números internos (1-7) destacam as notas da escala menor para a tonalidade selecionada.
vi_vn: Thang âm Chromatic hiển thị tất cả 12 nốt nhạc. Các số bên trong (1-7) đánh dấu các nốt của âm giai thứ cho tông đã chọn.

source: The Circle of Fifths organises keys based on perfect fifths. Rotating this circle demonstrates how keys are related. Each click (a 'fifth') adds or removes one sharp/flat from the key signature.
da_dk: Kvintcirklen organiserer tonaliteter baseret på rene kvinter. Ved at rotere denne cirkel vises det, hvordan tonaliteter er relaterede. Hvert klik (en 'kvint') tilføjer eller fjerner en kryds-/et mol i tonearten.
fi_fi: Kvinttiympyrä järjestää sävelet perustuen puhtaisiin kvinteihin. Ympyrän pyörittäminen havainnollistaa sävelten keskinäistä suhdetta. Jokainen napsautus (yksi 'kvintti') lisää tai poistaa yhden ylennys-/alennusmerkin sävellajista.
id_id: Lingkaran Kwint mengorganisir kunci berdasarkan kwint sempurna. Memutar lingkaran ini menunjukkan bagaimana kunci-kunci saling berhubungan. Setiap klik (satu 'kwint') menambah atau mengurangi satu kres/mol dari tanda kunci.
pt_br: O Círculo de Quintas organiza as tonalidades com base em quintas justas. A rotação deste círculo demonstra como as tonalidades se relacionam. Cada clique (uma 'quinta') adiciona ou remove um sustenido/bemol da armadura de clave.
vi_vn: Vòng tròn Quãng 5 sắp xếp các giọng dựa trên quãng 5 đúng. Việc xoay vòng tròn này minh họa cách các giọng có liên hệ với nhau. Mỗi lần nhấp (một 'quãng 5') sẽ thêm hoặc bớt một dấu thăng/giáng khỏi khóa nhạc.

source: The Interactive Piano will automatically highlight all the notes (and their scale degrees) for the selected key.
da_dk: Det Interaktive Klaver vil automatisk fremhæve alle noderne (og deres skala grader) for den valgte toneart.
fi_fi: Interaktiivinen piano korostaa automaattisesti kaikki valitun sävellajin nuotit (sekä niiden asteet).
id_id: Piano Interaktif akan secara otomatis menyorot semua not (beserta derajat skala mereka) untuk kunci yang dipilih.
pt_br: O Piano Interativo destacará automaticamente todas as notas (e seus graus da escala) para a tonalidade selecionada.
vi_vn: Đàn Piano Tương tác sẽ tự động làm nổi bật tất cả các nốt (và bậc âm của chúng) cho âm giai đã chọn.

source: The Key Signature display shows the correct sharps or flats for the key on both the treble and bass clefs.
da_dk: Nøgle-skærmen viser de korrekte kryds eller b for tonearterne på både diskant- og basnøgle.
fi_fi: Sävellajituote näyttää oikeat ylennys- ja alennusmerkit sävellajille sekä diskantti- että bassoviivastolla.
id_id: Tampilan Key Signature menunjukkan kres atau mol yang benar untuk kunci tersebut pada kedua paranada treble dan bass.
pt_br: A exibição da Armadura de Clave mostra os sustenidos ou bemóis corretos para a clave tanto na clave de sol quanto na clave de fá.
vi_vn: Màn hình hiển thị Bộ Khóa (Key Signature) cho thấy các dấu thăng hoặc dấu giáng chính xác cho tông nhạc trên cả khóa Sol (treble clef) và khóa Fa (bass clef).

source: This tool helps you visualise music theory. It connects the Chromatic Scale, the Circle of Fifths, the piano keyboard, and standard music notation all in one place.
da_dk: Dette værktøj hjælper dig med at visualisere musikteori. Det forbinder den kromatiske skala, kvintcirklen, klaverets keyboard og standard noder alle på ét sted.
fi_fi: Tämä työkalu auttaa sinua visualisoimaan musiikinteoriaa. Se yhdistää kromaattisen asteikon, kvinttiympyrän, pianon koskettimiston ja vakiintuneen nuottikirjoituksen yhdessä paikassa.
id_id: Alat ini membantu Anda memvisualisasikan teori musik. Alat ini menghubungkan Skala Kromatis, Lingkaran Kuint, keyboard piano, dan notasi musik standar dalam satu tempat.
pt_br: Esta ferramenta ajuda você a visualizar a teoria musical. Ela conecta a Escala Cromática, o Círculo de Quintas, o teclado do piano e a notação musical padrão, tudo em um só lugar.
vi_vn: Công cụ này giúp bạn hình dung lý thuyết âm nhạc. Nó kết nối Thang Chromatic, Vòng tròn Quãng Năm, bàn phím piano và ký hiệu âm nhạc tiêu chuẩn tại một nơi duy nhất.

source: Tonic
da_dk: Grundtone
fi_fi: Perussävel
id_id: Tonik
pt_br: Tônica
vi_vn: Âm chủ

# Use the &apos;Rotate&apos; buttons under either circle to select a new key.
source: Use the 'Rotate' buttons beneath either circle to select a new key.
da_dk: Brug 'Rotér'-knapperne under en af cirklerne til at vælge en ny toneart.
fi_fi: Käytä kummankin ympyrän alla olevia 'Kierrä'-painikkeita valitaksesi uuden sävellajin.
id_id: Gunakan tombol 'Rotate' di bawah salah satu lingkaran untuk memilih kunci baru.
pt_br: Use os botões 'Rotate' (Girar) sob qualquer um dos círculos para selecionar uma nova tonalidade.
vi_vn: Sử dụng các nút 'Xoay' bên dưới một trong hai vòng tròn để chọn một âm giai mới.

source: Welcome!
da_dk: Velkommen!
fi_fi: Tervetuloa!
id_id: Selamat datang!
pt_br: Bem-vindo!
vi_vn: Chào mừng!

source: What is this?
da_dk: Hvad er dette?
fi_fi: Mikä tämä on?
id_id: Apa ini?
pt_br: O que é isso?
vi_vn: Đây là gì?
