Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/Interval.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, ja_jp, ko_kr, nl_nl, pl_pl, ro_ro, sv_se, th_th, tr_tr, uk_ua, vi_vn

source: Minor Twenty-First
ar_sa: الواحدة والعشرون الصغيرة
da_dk: Lille Enogtyvende
de_de: kleine Undezime
el_gr: Ελάσσονα Εικοστή Πρώτη
es_es: Veintiuna menor
fi_fi: Pieni kahdeskymmenesensimmäinen
fr_fr: Vingt-et-unième mineur
hi_in: लघु इक्कीसवाँ
id_id: Minor Kedua Puluh Satu
ja_jp: 短21度
ko_kr: 단 21도
nl_nl: Kleine Eenentwintigste
pl_pl: Mała dwudziesta pierwsza
ro_ro: Minor Douăzeci și Unu
sv_se: Lilla tjugoförsta
th_th: ไมเนอร์ ทเวนตี้เฟิร์สท
tr_tr: Küçük Yirmi Birinci
uk_ua: Мала двадцять перша
vi_vn: Quãng Hai Mốt Thứ

source: Major Twentieth
ar_sa: العشرون الكبير
da_dk: Stor Tyvendedel
de_de: Große Zwanzig
el_gr: Μεγάλη Εικοστή
es_es: Veintena mayor
fi_fi: Suuri kahdeskymmenes
fr_fr: Vingtième majeure
hi_in: मेजर ट्वेंटिएथ
id_id: Oktaf Kedua Puluh Mayor
ja_jp: 長20度
ko_kr: 장 20도
nl_nl: Grote Twintigste
pl_pl: Wielka dwudziesta
ro_ro: Majoră Douăzecea
sv_se: Stora tjugondelar
th_th: เมเจอร์ทเวนตีเอ็ท
tr_tr: Büyük Yirminci
uk_ua: Велика двадцята
vi_vn: Trưởng Hai Mươi

source: Perfect Twenty-Second
ar_sa: الخامسة والعشرون التامة
da_dk: Perfekt toogtyvende
de_de: Reine Zweiundzwanzigste
el_gr: Τέλεια Εικοστή Δεύτερη
es_es: Veintidósava Perfecta
fi_fi: Täydellinen kahdeskymmenestoinen
fr_fr: Vingt-Deuxième Parfaite
hi_in: परफेक्ट ट्वेंटी-सेकंड
id_id: Oktaf Kedua Sempurna
ja_jp: 完全二十二度
ko_kr: 완전 22도
nl_nl: Reine TweeÃ«ntwintigste
pl_pl: Czysta dwudziesta sekunda
ro_ro: Douăzeci și Doi Perfectă
sv_se: Perfekt tjugoandra
th_th: เพอร์เฟกต์ทเวนตี้เซคอนด์
tr_tr: Mükemmel Yirmi İkinci
uk_ua: Двадцять друга чиста
vi_vn: Quãng 22 Đúng
