Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/IntervalExam.*.resx
Languages: th_th

source: Interval Exam
th_th: การทดสอบช่วงเสียง

source: Correct!
th_th: ถูกต้อง!

source: Minor Third
th_th: ไมเนอร์เธิร์ด

source: What is the {0} of the note above?
th_th: {0} ของโน้ตด้านบนคืออะไร?

source: Minor Second
th_th: เสียงย่อย 2

source: Major Second
th_th: เสียง 2 เมเจอร์

source: Perfect Unison
th_th: ยูนิสันบริสุทธิ์

source: Wrong.
th_th: ผิด

source: Perfect Fourth
th_th: เพอร์เฟกต์ฟอร์ท

source: Augmented Fourth
th_th: ช่วงสี่เพิ่ม

source: Diminished Fifth
th_th: เสียง 5 ลด

source: Perfect Fifth
th_th: เพอร์เฟกต์ฟิฟธ์

source: Augmented Fifth
th_th: เสียงที่ 5 ขยาย

source: Major Third
th_th: เมเจอร์เธิร์ด

source: Major Sixth
th_th: เมเจอร์ซิกธ์

source: Minor Sixth
th_th: ช่วงหกไมเนอร์

source: Minor Seventh
th_th: ไมเนอร์เซเวนธ์

source: Select Answer
th_th: เลือกคำตอบ

source: Major Seventh
th_th: เมเจอร์เซเวนธ์

source: Perfect Octave
th_th: อ็อกเทฟบริสุทธิ์

source: What is the (0) of the note above?
th_th: (0) ของโน้ตด้านบนคืออะไร?
