Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/Interval.*.resx
Languages: ar_sa, da_dk, de_de, el_gr, es_es, fi_fi, fr_fr, hi_in, id_id, ja_jp, ko_kr, nl_nl, pl_pl, ro_ro, sv_se, th_th, tr_tr, uk_ua, vi_vn

source: Perfect Unison
ar_sa: الطبقة الأولى التامة
da_dk: Perfekt prim
de_de: Reine Prime
el_gr: Τέλεια Πρώτη
es_es: Unísono Perfecto
fi_fi: Puhdas Prime
fr_fr: Unisson juste
hi_in: शुद्ध एकतान
id_id: Unison Sempurna
ja_jp: 完全一度
ko_kr: 완전 1도
nl_nl: Reine Prime
pl_pl: Czysta pryma
ro_ro: Unison Perfect
sv_se: Ren prim
th_th: ยูนิสันสมบูรณ์
tr_tr: Tam Unison
uk_ua: Досконала Прима
vi_vn: Quãng 1 Đúng

source: Minor Third
ar_sa: الثالثة الصغيرة
da_dk: Lille Terts
de_de: kleine Terz
el_gr: Ελάσσονα Τρίτη
es_es: Tercera menor
fi_fi: Pieni terssi
fr_fr: Tierce mineure
hi_in: लघु तृतीय
id_id: Terts Minor
ja_jp: 短三度
ko_kr: 단 3도
nl_nl: Kleine terts
pl_pl: Tercja mała
ro_ro: Terță minoră
sv_se: Liten ters
th_th: ไมเนอร์เธิร์ด
tr_tr: Küçük Üçlü
uk_ua: Мала терція
vi_vn: Quãng 3 thứ

source: Augmented Fourth
ar_sa: الرابعة الزائدة
da_dk: Forstørret Kvart
de_de: übermäßige Quarte
el_gr: Αυξημένη Τέταρτη
es_es: Cuarta Aumentada
fi_fi: Ylineljäs
fr_fr: Quarte augmentée
hi_in: वर्धित चतुर्थ
ja_jp: 増四度
ko_kr: 증4도
nl_nl: Overmatige kwart
pl_pl: Czwarta zwiększona
ro_ro: Cvarta mărită
sv_se: Förstärkt kvart
th_th: เสียงที่ 4 เพิ่ม
tr_tr: Artırılmış Dörtlü
uk_ua: Підвищена кварта
vi_vn: Quãng 4 tăng

source: Minor Second
ar_sa: ثانية صغيرة
da_dk: Lille Sekund
de_de: Kleine Sekunde
el_gr: Ελάσσονα Δεύτερη
es_es: Segunda menor
fi_fi: Pieni sekunti
fr_fr: Seconde mineure
hi_in: लघु सेकंड
id_id: Sekon Minor
ja_jp: 短二度
ko_kr: 단2도
nl_nl: Kleine Secunde
pl_pl: Sekunda mała
ro_ro: Secundă Mică
sv_se: Liten sekund
th_th: เสียงไมเนอร์เซคอนด์
tr_tr: Küçük İkili
uk_ua: Мала секунда
vi_vn: Quãng 2 thứ

source: Major Second
ar_sa: الدرجة الثانية الكبيرة
da_dk: Stor Sekund
de_de: Große Sekunde
el_gr: Μεγάλη Δεύτερη
es_es: Segunda mayor
fi_fi: Suuri sekunti
fr_fr: Seconde majeure
hi_in: मेजर सेकंड
id_id: Sekon Mayor
ja_jp: 長二度
ko_kr: 장2도
nl_nl: Grote Secunde
pl_pl: Wielka sekunda
ro_ro: Secundă majoră
sv_se: Stor sekund
th_th: เมเจอร์เซคอนด์
tr_tr: Büyük İkili
uk_ua: Велика секунда
vi_vn: Quãng 2 trưởng

source: Major Third
ar_sa: الثلث الكبير
da_dk: Stor Terts
de_de: große Terz
el_gr: Μεγάλη Τρίτη
es_es: Tercera mayor
fi_fi: Suuri terssi
fr_fr: Tierce majeure
hi_in: मेजर थर्ड
id_id: Terts Mayor
ja_jp: 長三度
ko_kr: 장3도
nl_nl: Grote terts
pl_pl: Wielka tercja
ro_ro: Terța majoră
sv_se: Stor ters
th_th: เมเจอร์เธิร์ด
tr_tr: Büyük Üçlü
uk_ua: Велика терція
vi_vn: Quãng 3 trưởng

source: Interval Calculator
ar_sa: حاسبة المسافات الموسيقية
da_dk: Intervallommeregner
de_de: Intervall-Rechner
el_gr: Αριθμομηχανή Διαστημάτων
es_es: Calculadora de Intervalos
fi_fi: Intervallilaskin
fr_fr: Calculateur d'intervalles
hi_in: अंतराल कैलकुलेटर
id_id: Kalkulator Interval
ja_jp: 音程計算機
ko_kr: 음정 계산기
pl_pl: Kalkulator Interwałów
ro_ro: Calculator de Intervale
sv_se: Intervallräknare
th_th: เครื่องคำนวณช่วงเสียง
tr_tr: Aralık Hesaplayıcı
uk_ua: Калькулятор інтервалів
vi_vn: Máy Tính Quãng Âm

source: Perfect Fourth
ar_sa: الرابعة التامة
da_dk: Ren Kvart
de_de: Reine Quarte
el_gr: Τέταρτη Τέλεια
es_es: Cuarta Justa
fi_fi: Puhdas kvartti
fr_fr: Quarte juste
hi_in: शुद्ध चतुर्थ
id_id: Kuart Sempurna
ja_jp: 完全四度
ko_kr: 완전 4도
nl_nl: Reine kwart
pl_pl: Czysta kwarta
ro_ro: Cvarta perfectă
sv_se: Rena kvarten
th_th: เพอร์เฟกต์ฟอร์ท
tr_tr: Saf Dörtlü
uk_ua: Чиста кварта
vi_vn: Quãng 4 Đúng

source: Minor Sixth
ar_sa: السادسة الصغيرة
da_dk: Lille Sekst
de_de: kleine Sexte
el_gr: Ελάσσονα Έκτη
es_es: Sexta menor
fi_fi: Pieni seksti
fr_fr: Sixte mineure
hi_in: लघु षष्ठ
id_id: Sekst Minor
ja_jp: 短六度
ko_kr: 단 6도
nl_nl: Kleine sext
pl_pl: Seksta mała
ro_ro: Șesime minoră
sv_se: Lilla sext
th_th: ช่วง 6th ไมเนอร์
tr_tr: Küçük Altılı
uk_ua: Мала секста
vi_vn: Quãng 6 thứ

source: Major Sixth
ar_sa: السادسة الكبرى
da_dk: Stor Sekst
de_de: Große Sexte
el_gr: Μεγάλη Έκτη
es_es: Sexta mayor
fi_fi: Suuri seksti
fr_fr: Sixte majeure
hi_in: मेजर षष्ठ
id_id: Seksta Mayor
ja_jp: 長六度
ko_kr: 장6도
nl_nl: Grote sext
pl_pl: Wielka seksta
ro_ro: Sexta majoră
sv_se: Stor sext
th_th: เมเจอร์ซิกส์
tr_tr: Majör Altılı
uk_ua: Велика секста
vi_vn: Quãng 6 Trưởng

source: Perfect Fifth
ar_sa: الخامسة التامة
da_dk: Ren Kvint
de_de: Reine Quinte
el_gr: Τέλεια Πέμπτη
es_es: Quinta Justa
fi_fi: Puhdas kvintti
fr_fr: Quinte juste
hi_in: शुद्ध पंचम
id_id: Kuinta Sempurna
ja_jp: 完全五度
ko_kr: 완전 5도
nl_nl: Reine Kwint
pl_pl: Kwinta czysta
ro_ro: Cvintă perfectă
sv_se: Ren kvint
th_th: เพอร์เฟกต์ฟิฟธ์
tr_tr: Tam Beşli
uk_ua: Чиста квінта
vi_vn: Quãng 5 Đúng

source: Perfect Octave
ar_sa: الأوكتاف التام
da_dk: Perfekt Oktav
de_de: Reine Oktave
el_gr: Τέλεια Οκτάβα
es_es: Octava Justa
fi_fi: Täydellinen oktaavi
fr_fr: Octave juste
hi_in: शुद्ध अष्टक
id_id: Oktav Sempurna
ja_jp: 完全八度
ko_kr: 완전 8도
nl_nl: Reine Oktaven
pl_pl: Oktawa czysta
ro_ro: Octavă perfectă
sv_se: Perfekt oktav
th_th: อ็อกเทฟบริสุทธิ์
tr_tr: Tam Sekizli
uk_ua: Досконала октава
vi_vn: Quãng Tám Đúng

source: Major Seventh
ar_sa: السبعة الكبيرة
da_dk: Stor Septim
de_de: Große Septime
el_gr: Μεγάλη Εβδόμη
es_es: Séptima mayor
fi_fi: Suuri septimi
fr_fr: Majeure Septième
hi_in: मेजर सेवेंथ
id_id: Septima Mayor
ja_jp: 長七度
ko_kr: 장7도
nl_nl: Grote Septiem
pl_pl: Wielka septyma
ro_ro: Septima major
sv_se: Stor septima
th_th: เมเจอร์เซเวนธ์
tr_tr: Majör Yedili
uk_ua: Велика септима
vi_vn: Quãng Bảy Trưởng

# Unable to recognize note name
source: Unable to recognise note name
ar_sa: غير قادر على التعرف على اسم النوتة
da_dk: Kan ikke genkende nodenavn
de_de: Notenname konnte nicht erkannt werden
el_gr: Δεν είναι δυνατή η αναγνώριση του ονόματος της νότας
es_es: No se puede reconocer el nombre de la nota
fi_fi: Nuottia ei tunnistettu
fr_fr: Impossible de reconnaître le nom de la note
hi_in: स्वर का नाम पहचानने में असमर्थ
id_id: Tidak dapat mengenali nama not
ja_jp: 音符名を認識できません
ko_kr: 음표 이름을 인식할 수 없습니다
nl_nl: Kan de nootnaam niet herkennen
pl_pl: Nie można rozpoznać nazwy nuty
ro_ro: Nu pot recunoaște numele notei
sv_se: Kunde inte känna igen notnamn
th_th: ไม่สามารถจดจำชื่อโน้ตได้
tr_tr: Nota adı tanınamadı
uk_ua: Не вдалося розпізнати назву ноти
vi_vn: Không thể nhận dạng tên nốt nhạc

source: Minor Seventh
ar_sa: السبعة الصغيرة
da_dk: Lille Septim
de_de: kleine Septime
el_gr: Ελάσσονα Εβδόμη
es_es: Séptima menor
fi_fi: Pieni septimi
fr_fr: Septième mineure
hi_in: लघु सप्तम
id_id: Septima Minor
ja_jp: 短七度
ko_kr: 단7도
nl_nl: Kleine Septiem
pl_pl: Septyma mała
ro_ro: Septimă Mică
sv_se: Liten septima
th_th: ไมเนอร์เซเวนธ์
tr_tr: Küçük Yedili
uk_ua: Мала септима
vi_vn: Quãng 7 Thứ

# Please input with the lower note first
source: Please enter the lower note first
ar_sa: يرجى إدخال النغمة الأقل أولاً
da_dk: Indtast venligst den lavere tone først.
de_de: Bitte geben Sie zuerst den tieferen Ton ein.
el_gr: Παρακαλώ εισάγετε πρώτα τη χαμηλότερη νότα
es_es: Por favor, introduzca la nota más grave primero.
fi_fi: Syötä alempi nuotti ensin.
fr_fr: Veuillez saisir la note la plus grave en premier.
hi_in: कृपया पहले निचला स्वर दर्ज करें
id_id: Masukkan dengan nada yang lebih rendah terlebih dahulu
ja_jp: 低い音から入力してください
ko_kr: 낮은 음을 먼저 입력해 주세요.
nl_nl: Voer eerst de lagere noot in.
pl_pl: Wprowadź dźwięki, zaczynając od niższego.
ro_ro: Vă rugăm să introduceți mai întâi nota mai joasă
sv_se: Vänligen ange den lägre tonen först.
th_th: กรุณากรอกโน้ตตัวต่ำก่อน
tr_tr: Lütfen önce düşük notayı girin
uk_ua: Будь ласка, введіть спочатку нижню ноту
vi_vn: Vui lòng nhập nốt thấp hơn trước.

source: How to Use
ar_sa: كيفية الاستخدام
da_dk: Sådan bruges
de_de: So wird's gemacht
el_gr: Πώς να Χρησιμοποιήσετε
es_es: Cómo usar
fi_fi: Käyttöohje
fr_fr: Mode d'emploi
hi_in: उपयोग कैसे करें
id_id: Cara Penggunaan
ja_jp: 使い方
ko_kr: 사용 방법
nl_nl: Hoe te gebruiken
pl_pl: Jak korzystać
ro_ro: Cum se utilizează
sv_se: Hur man använder
th_th: วิธีการใช้งาน
tr_tr: Nasıl Kullanılır
uk_ua: Як користуватися
vi_vn: Cách Sử Dụng

source: Click any two keys on the piano below.
ar_sa: انقر على أي مفتاحين في البيانو أدناه.
da_dk: Klik på vilke som helst to tangenter på klaveret nedenfor.
de_de: Klicken Sie auf zwei beliebige Tasten des untenstehenden Klaviers.
el_gr: Πατήστε οποιαδήποτε δύο πλήκτρα στο πιάνο παρακάτω.
es_es: Haz clic en dos teclas cualesquiera del piano que aparece a continuación.
fi_fi: Napsauta mitä tahansa kahta näppäintä alla olevalla pianolla.
fr_fr: Cliquez sur deux touches quelconques du piano ci-dessous.
hi_in: नीचे दिए गए पियानो पर कोई भी दो कुंजियाँ क्लिक करें।
id_id: Klik dua tuts mana saja pada piano di bawah.
ja_jp: 下のピアノの任意の2つの鍵をクリックしてください。
ko_kr: 아래 피아노에서 아무 키 두 개를 클릭하세요.
nl_nl: Klik op twee willekeurige toetsen op de onderstaande piano.
pl_pl: Kliknij dowolne dwa klawisze na poniższym fortepianie.
ro_ro: Apasă oricare două clape de pe pianul de mai jos.
sv_se: Klicka på valfria två tangenter på pianot nedan.
th_th: คลิกปุ่มใดก็สองปุ่มบนเปียโนด้านล่าง
tr_tr: Aşağıdaki piyanoda herhangi iki tuşa tıklayın.
uk_ua: Клацніть будь-які дві клавіші на піаніно нижче.
vi_vn: Nhấn vào hai phím bất kỳ trên đàn piano bên dưới.

source: to
ar_sa: إلى
da_dk: til
de_de: zu
el_gr: προς
es_es: a
fr_fr: à
hi_in: से
id_id: ke
ja_jp: へ
ko_kr: 에서
nl_nl: tot
pl_pl: do
ro_ro: la
sv_se: till
th_th: ถึง
tr_tr: ile
uk_ua: до
vi_vn: đến

source: Result
ar_sa: النتيجة
da_dk: Resultat
de_de: Ergebnis
el_gr: Αποτέλεσμα
es_es: Resultado
fi_fi: Tulos
fr_fr: Résultat
hi_in: परिणाम
id_id: Hasil
ja_jp: 計算結果
ko_kr: 결과
nl_nl: Resultaat
pl_pl: Wynik
ro_ro: Rezultat
sv_se: Resultat
th_th: ผลลัพธ์
tr_tr: Sonuç
uk_ua: Результат
vi_vn: Kết quả

source: The first note you select will be the root.
ar_sa: النغمة الأولى التي تختارها ستكون الأساس.
da_dk: Den første tone du vælger vil være grundtonen.
de_de: Die erste Note, die Sie auswählen, wird der Grundton sein.
el_gr: Η πρώτη νότα που επιλέγετε θα είναι η βασική.
es_es: La primera nota que selecciones será la tónica.
fi_fi: Ensimmäinen valitsemasi nuotti on perussävel.
fr_fr: La première note que vous sélectionnerez sera la fondamentale.
hi_in: आपके द्वारा चुनी गई पहली नोट रूट (मूल स्वर) होगी।
id_id: Nada pertama yang Anda pilih akan menjadi root.
ja_jp: 最初に選択した音がルートになります。
ko_kr: 선택한 첫 번째 음이 루트가 됩니다.
nl_nl: De eerste noot die je selecteert wordt de grondtoon.
pl_pl: Pierwszy wybrany dźwięk będzie toniką.
ro_ro: Prima notă pe care o selectați va fi nota de bază.
sv_se: Den första tonen du väljer blir grundtonen.
th_th: โน้ตตัวแรกที่คุณเลือกจะเป็นรูท
tr_tr: Seçtiğiniz ilk nota kök (root) olacaktır.
uk_ua: Перша нота, яку ви виберете, буде основним тоном.
vi_vn: Nốt đầu tiên bạn chọn sẽ là nốt gốc.

source: The interval between the two notes will be calculated and displayed.
ar_sa: سيتم حساب الفاصل الزمني بين النوتتين وعرضه.
da_dk: Intervallet mellem de to noder vil blive beregnet og vist.
de_de: Das Intervall zwischen den beiden Noten wird berechnet und angezeigt.
el_gr: Το διάστημα μεταξύ των δύο νοτών θα υπολογιστεί και θα εμφανιστεί.
es_es: Se calculará y se mostrará el intervalo entre las dos notas.
fi_fi: Kahden nuotin välinen intervalli lasketaan ja näytetään.
fr_fr: L'intervalle entre les deux notes sera calculé et affiché.
hi_in: दोनों स्वरों के बीच का अंतराल परिकलित और प्रदर्शित किया जाएगा।
id_id: Interval antara dua not akan dihitung dan ditampilkan.
ja_jp: 2つの音の間隔が計算され、表示されます。
ko_kr: 두 음표 사이의 간격이 계산되어 표시됩니다.
nl_nl: Het interval tussen de twee noten wordt berekend en weergegeven.
pl_pl: Interwał między dwiema nutami zostanie obliczony i wyświetlony.
ro_ro: Intervalul dintre cele două note va fi calculat și afișat.
sv_se: Intervallet mellan de två tonerna kommer att beräknas och visas.
th_th: ช่วงห่างระหว่างโน้ตทั้งสองจะถูกคำนวณและแสดงผล
tr_tr: İki nota arasındaki aralık hesaplanacak ve gösterilecektir.
uk_ua: Інтервал між двома нотами буде обчислено та показано.
vi_vn: Khoảng cách giữa hai nốt nhạc sẽ được tính toán và hiển thị.

source: Click a selected key again to deselect it.
ar_sa: انقر على المفتاح المحدد مرة أخرى لإلغاء تحديده.
da_dk: Klik på en valgt tangent igen for at fravælge den.
de_de: Klicken Sie erneut auf eine ausgewählte Taste, um die Auswahl aufzuheben.
el_gr: Κάντε κλικ ξανά σε ένα επιλεγμένο πλήκτρο για να το αποεπιλέξετε.
es_es: Haga clic nuevamente en una tecla seleccionada para deseleccionarla.
fi_fi: Napsauta valittua näppäintä uudelleen poistaaksesi sen valinnan.
fr_fr: Cliquez à nouveau sur une touche sélectionnée pour la désélectionner.
hi_in: किसी चयनित कुंजी को फिर से क्लिक करके उसका चयन रद्द करें।
id_id: Klik tombol yang sudah dipilih sekali lagi untuk membatalkan pemilihannya.
ja_jp: 選択したキーを再度クリックすると選択が解除されます。
ko_kr: 선택된 키를 다시 클릭하면 선택이 해제됩니다.
nl_nl: Klik nogmaals op een geselecteerde toets om de selectie ongedaan te maken.
pl_pl: Kliknij ponownie wybrany klawisz, aby go odznaczyć.
ro_ro: Apasă din nou pe o tastă selectată pentru a o deselecta.
sv_se: Klicka på en markerad tangent igen för att avmarkera den.
th_th: คลิกปุ่มที่เลือกไว้อีกครั้งเพื่อยกเลิกการเลือก
tr_tr: Seçili bir tuşu tekrar tıklayarak seçimini kaldırabilirsiniz.
uk_ua: Натисніть на вибрану клавішу знову, щоб скасувати її вибір.
vi_vn: Nhấn lại một phím đã chọn để bỏ chọn nó.

source: Interactive Piano
ar_sa: بيانو تفاعلي
da_dk: Interaktivt Klaver
de_de: Interaktives Klavier
el_gr: Διαδραστικό Πιάνο
es_es: Piano Interactivo
fi_fi: Vuorovaikutteinen piano
fr_fr: Piano interactif
hi_in: इंटरैक्टिव पियानो
id_id: Piano Interaktif
ja_jp: インタラクティブピアノ
ko_kr: 인터랙티브 피아노
nl_nl: Interactieve Piano
pl_pl: Interaktywne Pianino
ro_ro: Pian Interactiv
sv_se: Interaktivt piano
th_th: เปียโนเชิงโต้ตอบ
tr_tr: Etkileşimli Piyano
uk_ua: Інтерактивне піаніно
vi_vn: Đàn Piano Tương Tác

source: Minor Ninth
ar_sa: التراس التاسع الصغير
da_dk: Lille None
de_de: kleine None
el_gr: Μικρή Εννέα
es_es: Novena menor
fi_fi: Pieni noon
fr_fr: Neuvième mineure
hi_in: लघु नवम
id_id: Nada Kesembilan Minor
ja_jp: 短九度
ko_kr: 단9도
nl_nl: Kleine None
pl_pl: Nona mała
ro_ro: Nonă minoră
sv_se: Liten nona
th_th: ไมเนอร์นินธ์
tr_tr: Küçük Dokuzlu
uk_ua: Мала нона
vi_vn: Quãng 9 Thứ

source: Major Tenth
ar_sa: العاشرة الكبرى
da_dk: Stor Decim
de_de: Große Dezime
el_gr: Μεγάλη Δέκατη
es_es: Décima Mayor
fi_fi: Suuri terssi
fr_fr: Dixte majeure
hi_in: मेजर टेंथ
id_id: Sepuluh Mayor
ja_jp: 長10度
ko_kr: 장 10도
nl_nl: Grote deciem
pl_pl: Wielka decyma
ro_ro: Decima majoră
sv_se: Stor decima
th_th: เมเจอร์เทนธ์
tr_tr: Büyük Onlu
uk_ua: Велика децима
vi_vn: Quãng mười trưởng

source: Major Ninth
ar_sa: التربة الكبيرة
da_dk: Stor None
de_de: Große None
el_gr: Μεγάλη Εννέα
es_es: Novena Mayor
fi_fi: Suuri noon
fr_fr: Neuvième majeure
hi_in: मेजर नाइंथ
id_id: Nada Kesembilan Mayor
ja_jp: 長九度
ko_kr: 장9도
nl_nl: Grote None
pl_pl: Wielka nona
ro_ro: Nouă Mare
sv_se: Stor nona
th_th: เมเจอร์ไนน์ท
tr_tr: Büyük Dokuzlu
uk_ua: Велика нона
vi_vn: Quãng 9 Trưởng

source: Perfect Eleventh
ar_sa: الخامس عشر التام
da_dk: Perfekt Undecim
de_de: Reine Undezime
el_gr: Τέλεια Ένδεκατη
es_es: Undécima Justa
fi_fi: Puhdas yhdestoista
fr_fr: Onzième juste
hi_in: शुद्ध एकादश
id_id: Interval Kesebelas Sempurna
ja_jp: 完全11度
ko_kr: 완전 11도
nl_nl: Reine Undecime
pl_pl: Czysta undecyma
ro_ro: Undecima perfectă
sv_se: Perfekt undecima
th_th: เพอร์เฟกต์อิลิฟธ์
tr_tr: Saf Onbirli
uk_ua: Чиста ундецима
vi_vn: Quãng 11 Đúng

source: Minor Tenth
ar_sa: العاشرة الصغيرة
da_dk: Lille Decim
de_de: Kleine Dezime
el_gr: Μικρή Δέκατη
es_es: Décima menor
fi_fi: Pieni terssi
fr_fr: Dixième mineure
hi_in: लघु दशम
id_id: Sepuluh Minor
ja_jp: 短十度
ko_kr: 단 10도
nl_nl: Kleine deciem
pl_pl: Mala decyma
ro_ro: Decimă mică
sv_se: Liten decima
th_th: สิบไมเนอร์
tr_tr: Küçük Onlu
uk_ua: Мала децима
vi_vn: Quãng Mười Thứ

source: Perfect Twelfth
ar_sa: الخامسة عشرة التامة
da_dk: Perfekt Duodecim
de_de: Reine Duodezime
el_gr: Τέλεια Δωδέκατη
es_es: Duodécima justa
fi_fi: Puhdas duodesimi
fr_fr: Douzième juste
hi_in: शुद्ध द्वादश
id_id: Kedua Belas Sempurna
ja_jp: 完全十二度
ko_kr: 완전 12도
nl_nl: Reine Duodecime
pl_pl: Czysta kwinta
ro_ro: Douăsprezecima perfectă
sv_se: Perfekt duodecim
th_th: เพอร์เฟกต์ทเวลฟท์
tr_tr: Mükemmel Onikili
uk_ua: Чиста дуодецима
vi_vn: Quãng Mười Hai Đúng

source: Minor Thirteenth
ar_sa: الثلاثة عشر الصغير
da_dk: Lille Tretten
de_de: kleine Tredezime
el_gr: Μικρή Δεκάτη Τρίτη
es_es: Décima Tercera Menor
fi_fi: Pieni terssi
fr_fr: Treizième mineure
hi_in: लघु त्रयोदश
id_id: Tiga Belas Minor
ja_jp: 短13度
ko_kr: 단 13도
nl_nl: Kleine tertsdeciem
pl_pl: Mine tercdecyma
ro_ro: Tredespree minoră
sv_se: Liten trettondel
th_th: ไมเนอร์เธอร์ที้นธ์
tr_tr: Küçük Onüçlü
uk_ua: Мала терціядецима
vi_vn: Quãng 13 Thứ

source: Augmented Eleventh
ar_sa: الخامس عشر المدّيد
da_dk: Forstærket undecim
de_de: Übermäßige Undezime
el_gr: Ενισχυμένη Ένδεκατη
es_es: Undécima Aumentada
fi_fi: Ylin yhdestoista
fr_fr: Onzième augmentée
hi_in: वर्धित एकादश
ja_jp: 増十一度
ko_kr: 증11도
nl_nl: Overmatige Undecime
ro_ro: Undecima augmentată
sv_se: Förstärkt undecima
th_th: ออเกเมนเทด อีเลฟเวนธ์
tr_tr: Artırılmış Onbirli
uk_ua: Збільшена одинадцята
vi_vn: Quãng 11 tăng

source: Major Fourteenth
ar_sa: الرابعة عشرة الكبرى
da_dk: Stor Kvartdecime
de_de: Große Quatorzime
el_gr: Μεγάλη Δεκάτη Τέταρτη
es_es: Decimocuarta Mayor
fi_fi: Suuri terssi
fr_fr: Quatorzième majeure
hi_in: मेजर चौदहवां
id_id: Terts Besar Keempat Belas
ja_jp: 長14度
ko_kr: 장14도
nl_nl: Grote veertiende
pl_pl: Wielka kwarta decyma
ro_ro: Cvadordecima majoră
sv_se: Stor kvartdecima
th_th: เมเจอร์ฟอร์ทีนธ์
tr_tr: Majör On Dördüncü Aralık
uk_ua: Велика чотирнадцята
vi_vn: Trưởng mười bốn

source: Major Thirteenth
ar_sa: الثلاثة عشر الكبير
da_dk: Stor Tretten
de_de: Große Tredezime
el_gr: Μεγάλη Δεκάτη Τρίτη
es_es: Decimotercera mayor
fi_fi: Suuri terssi
fr_fr: Tredizième majeure
hi_in: मेजर थर्टीन्थ
id_id: Tiga Belas Mayor
ja_jp: 長13度
ko_kr: 장 13도
nl_nl: Grote tertiende decime
pl_pl: Wielka tercdecyma
ro_ro: Tredispea Majoră
sv_se: Stor trettondel
th_th: เมเจอร์เทอร์ทีนธ์
tr_tr: Majör Onüçlü
uk_ua: Велика терцдецима
vi_vn: Trường Thập Tam

source: Minor Fourteenth
ar_sa: الرابعة عشرة الصغيرة
da_dk: Lille Kvartdecim
de_de: kleine Quatorz
el_gr: Μικρή Δεκάτη Τέταρτη
es_es: Décima Cuarta Menor
fi_fi: Pieni kvarttoista
fr_fr: Quatorzième mineure
hi_in: लघु चतुर्दशम
id_id: Oktaf Kecil keempat belas
ja_jp: 短14度
ko_kr: 단 14도
nl_nl: Kleine veertiende
pl_pl: Mała kwarta decymalna
ro_ro: Cvadordecima minoră
sv_se: Liten kvartdecima
th_th: ไมเนอร์ฟอร์ทีนธ์
tr_tr: Küçük On Dörtlü
uk_ua: Мала чотирнадцята
vi_vn: Quãng 14 Thứ

source: Perfect Fifteenth
ar_sa: الخامسة عشر التامة
da_dk: Perfekt kvintdecim
de_de: Reine Quintezehnte
el_gr: Τέλεια Δεκάμπεντα
es_es: Decimoquinta Justa
fi_fi: Puhdas kvinttoista
fr_fr: Quinzième juste
hi_in: शुद्ध पंद्रहवाँ
id_id: Kuartim Belas Sempurna
ja_jp: 完全十五度
ko_kr: 완전 15도
nl_nl: Perfect Kwintdeciem
pl_pl: Kwintdecyma czysta
ro_ro: Cvintă perfectă de cincisprezece
sv_se: Perfekt kvintdecima
th_th: เพอร์เฟกต์ฟิฟทีนธ์
tr_tr: Mükemmel Onbeşli
uk_ua: Дванадцята квінта
vi_vn: Mười Lăm Đúng

source: Major Seventeenth
ar_sa: السبعة عشر الكبير
da_dk: Stor Septimdecim
de_de: Große Septdezime
el_gr: Μεγάλη Δεκάτη Έβδομη
es_es: Decimoséptima mayor
fi_fi: Suuri septendesiimi
fr_fr: Dix-septième majeure
hi_in: मेजर सेवेंटींथ
id_id: Septima Belas Mayor
ja_jp: 長17度
ko_kr: 장 17도
nl_nl: Grote septiende
pl_pl: Wielka septyma decymalna
ro_ro: Major Seventisprezece
sv_se: Stor septimdecima
th_th: เมเจอร์เซเวนทีนธ์
tr_tr: Majör Onyedinci
uk_ua: Велика сімнадцята
vi_vn: Trưởng Mười Bảy

source: Augmented Eighteenth
ar_sa: الثامنة عشر الموسعة
da_dk: Forstørret Oktondel
de_de: Übermäßige Oktave + Quarte
el_gr: Ενισχυμένη Δεκάτη Οκτώ
es_es: Decimoctava aumentada
fi_fi: Korotettu okstandesimi
fr_fr: Dix-huitième augmenté
hi_in: वर्धित अठारहवाँ
id_id: Oktalapan Belas Augmented
ja_jp: 増十八度
ko_kr: 증 18도
nl_nl: Overmatige Achttiende
pl_pl: Augmentowana oktawa decydująca
ro_ro: Optavașa a optsprezecea
sv_se: Förstorad artonde
th_th: ช่วงสิบแปดเพิ่ม
tr_tr: Artırılmış Onsekizli
uk_ua: Збільшена девісімнадцята
vi_vn: Quãng Mười Tám Tăng

source: Minor Twentieth
ar_sa: العشرون الصغير
da_dk: Lille Tyvende
de_de: kleine Zwanzig
el_gr: Ελάσσονα Εικοστή
es_es: Vigésima menor
fi_fi: Pieni kahdeskymmenes
fr_fr: Vingtième mineur
hi_in: लघु बीसवाँ
id_id: Kedua Puluh Minor
ja_jp: 短20度
ko_kr: 단 20도
nl_nl: Kleine Twintigste
pl_pl: Moll dwudziesta
ro_ro: Minoră Douăzecea
sv_se: Lilla tjugondel
th_th: ไมเนอร์ทเวนตีเอท
tr_tr: Küçük Yirminci
uk_ua: Мала двадцята
vi_vn: Quãng 20 thứ

source: Major Sixteenth
ar_sa: السادسة عشر الكبرى
da_dk: Stor Sekstendedel
de_de: Große Sexdezime
el_gr: Μεγάλη Δεκαρεξία
es_es: Decimosexta mayor
fi_fi: Suuri sekstandesimi
fr_fr: Seizième majeure
hi_in: मेजर सोलहवां
id_id: Sekstam Besar
ja_jp: 長16度
ko_kr: 장 16도
nl_nl: Grote sextiende
pl_pl: Wielka sekstędziesiątowa
ro_ro: Major Șaisprezecime
sv_se: Stor sextondel
th_th: เมเจอร์ซิกส์ทีนธ์
tr_tr: Büyük Onaltılı
uk_ua: Велика децима
vi_vn: Trường Thập Lục

source: Minor Sixteenth
ar_sa: السادسة عشر الصغيرة
da_dk: Lille Sekstende
de_de: kleine Sechzehnte
el_gr: Ελάσσονα Δέκατα Έκτη
es_es: Décima sexta menor
fi_fi: Pieni sekstandesimi
fr_fr: Seizième mineure
hi_in: लघु सोलहवाँ
id_id: Minor Keenam Belas
ja_jp: 短16度
ko_kr: 단 16도
nl_nl: Kleine sextiende
pl_pl: Szesnasta mała
ro_ro: Șaisprezecime minoră
sv_se: Lilla sextondel
th_th: ไมเนอร์ซิกส์ทีนธ์
tr_tr: Küçük Onaltılı
uk_ua: Мала шістнадцята
vi_vn: Quãng 16 Thứ

source: Perfect Nineteenth
ar_sa: الطبقة التاسعة عشرة التامة
da_dk: Perfekt nittende
de_de: Reine Neunzehnte
el_gr: Τέλειος Δεκαεννάτος
es_es: Decimonovena Justa
fi_fi: Täydellinen yhdeksästoista
fr_fr: Dix-neuvième parfait
hi_in: शुद्ध उन्नीसवाँ
id_id: Oktaf Sempurna Kesembilan Belas
ja_jp: 完全十九度
ko_kr: 완전 십구도
nl_nl: Perfect Negentiende
pl_pl: Dziewiętnasta czysta
ro_ro: Nouăsprezecea perfectă
sv_se: Perfekt nittondel
th_th: เพอร์เฟกต์นิเนททีนธ์
tr_tr: Mükemmel On Dokuzlu
uk_ua: Дев'ятнадцята чиста
vi_vn: Quãng Mười Chín Đúng

source: Perfect Eighteenth
ar_sa: الخامس عشر التام
da_dk: Perfekt oktav + kvart
de_de: Reine Oktave + reine Quinte
el_gr: Τέλεια Δεκαοχταεξία
es_es: Decimoctava justa
fi_fi: Täydellinen kahdeksastoista
fr_fr: Dix-huitième juste
hi_in: परफेक्ट अठारहवाँ
id_id: Oktav Sempurna Delapan Belas
ja_jp: 完全十八度
ko_kr: 완전 18도
nl_nl: Perfect Achttiende
pl_pl: Czysta oktawa decydująca
ro_ro: Optava a optsprezecea
sv_se: Perfekt oktav + undecima
th_th: เพอร์เฟกต์ออคเทฟที่สิบแปด
tr_tr: Mükemmel Onsekizli
uk_ua: Дев'ятнадцята чиста
vi_vn: Quãng Mười Tám Đúng

source: Minor Seventeenth
ar_sa: السبعة عشر الصغير
da_dk: Lille Septimdecim
de_de: kleine Septdezime
el_gr: Ελάσσονα Δεκάτη Έβδομη
es_es: Décima Séptima Menor
fi_fi: Pieni septendesiimi
fr_fr: Dix-septième mineure
hi_in: लघु सत्रहवाँ
id_id: Septima Belas Minor
ja_jp: 短17度
ko_kr: 단 17도
nl_nl: Kleine Septiemdecime
pl_pl: Siedemnasta mała
ro_ro: Decimașaptea minoră
sv_se: Lilla septimdecima
th_th: ไมเนอร์เซเวนทีนธ์
tr_tr: Küçük Onyedili
uk_ua: Мала сімнадцята
vi_vn: Quãng 17 Thứ

source: Major Twenty-First
ar_sa: البيتان الحادي والعشرين الكبير
da_dk: Stor Enogtyvende
de_de: Große Undeinzige
el_gr: Μεγάλη Εικοστή Πρώτη
es_es: Veintiuna Mayor
fi_fi: Suuri kahdeskymmenesensimmäinen
fr_fr: Vingt-et-unième majeure
hi_in: मेजर ट्वेंटी-फर्स्ट
id_id: Oktaf Kedua Puluh Satu Mayor
ja_jp: 長21度
ko_kr: 장 이십일도
nl_nl: Grote Eenentwintigste
pl_pl: Wielka dwudziesta pierwsza
ro_ro: Major Douăzeci și Unu
sv_se: Stor tjugoförsta
th_th: เมเจอร์ทเวนตี้เฟิร์สท์
tr_tr: Büyük Yirmi Birinci
uk_ua: Велика двадцять перша
vi_vn: Trưởng Hai Mốt
