Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/Major.*.resx
Languages: ar_sa, el_gr, it_it, ja_jp, ko_kr, pl_pl, sv_se, uk_ua, zh_cn

source: Welcome!
ar_sa: مرحباً!
el_gr: Καλώς ήρθατε!
it_it: Benvenuto!
ja_jp: ようこそ！
ko_kr: 환영합니다!
pl_pl: Witaj!
sv_se: Välkommen!
uk_ua: Ласкаво просимо!
zh_cn: 欢迎！

source: What is this?
ar_sa: ما هذا؟
el_gr: Τι είναι αυτό;
it_it: Cos'è questo?
ja_jp: これは何ですか？
ko_kr: 이것은 무엇인가요?
pl_pl: Co to jest?
sv_se: Vad är detta?
uk_ua: Що це?
zh_cn: 这是什么？

source: How to Use It
ar_sa: كيفية استخدامه
el_gr: Πώς να το χρησιμοποιήσετε
it_it: Come usarlo
ja_jp: 使い方
ko_kr: 사용 방법
pl_pl: Jak z niego korzystać
sv_se: Hur du använder det
uk_ua: Як користуватися
zh_cn: 使用方法

source: Use the &apos;Rotate&apos; buttons under either circle to select a new key.
ar_sa: استخدم أزرار 'تدوير' الموجودة تحت أي من الدائرتين لاختيار مفتاح موسيقي جديد.
el_gr: Χρησιμοποιήστε τα κουμπιά «Περιστροφή» κάτω από οποιονδήποτε κύκλο για να επιλέξετε μια νέα κλειδαριά.
it_it: Utilizza i pulsanti 'Ruota' sotto entrambi i cerchi per selezionare una nuova tonalità.
ja_jp: いずれかの円の下にある「回転」ボタンを使用して、新しいキーを選択してください。
ko_kr: 어느 쪽 원 아래에 있는 '회전' 버튼을 사용하여 새로운 조(key)를 선택하세요.
pl_pl: Użyj przycisków „Rotate” pod dowolnym okręgiem, aby wybrać nowy klucz.
sv_se: Använd 'Rotera'-knapparna under någon av cirklarna för att välja en ny tonart.
uk_ua: Використовуйте кнопки «Rotate» під будь-яким колом, щоб вибрати нову тональність.
zh_cn: 使用任意一个圆环下方的“Rotate”（旋转）按钮来选择新的调。

source: The Chromatic Scale shows all 12 notes. The inner numbers (1-7) highlight the notes of the major scale for the selected key.
ar_sa: يظهر السلم الكروماتي جميع النوتات الإثني عشر. تُبرز الأرقام الداخلية (7-1) نوتات السلم الكبير للمفتاح المحدد.
el_gr: Η Χρωματική Κλίμακα εμφανίζει και τις 12 νότες. Οι εσωτερικοί αριθμοί (1-7) επισημαίνουν τις νότες της ματζόρε κλίμακας για την επιλεγμένη τονικότητα.
it_it: La Scala Cromatica mostra tutte e 12 le note. I numeri interni (1-7) evidenziano le note della scala maggiore per la tonalità selezionata.
ja_jp: 半音階は12のすべての音を示しています。内側の数字（1-7）は、選択されたキーのメジャースケールの音を強調表示します。
ko_kr: 크로매틱 스케일은 12개의 모든 음을 보여줍니다. 내부 숫자(1-7)는 선택한 키의 메이저 스케일 음을 강조 표시합니다.
pl_pl: Skala chromatyczna pokazuje wszystkie 12 dźwięków. Wewnętrzne numery (1-7) podświetlają nuty skali majorowej dla wybranego klucza.
sv_se: Kromatiska skalan visar alla 12 toner. De inre siffrorna (1-7) markerar tonerna i durskalan för den valda tonarten.
uk_ua: Хроматична гама показує всі 12 нот. Внутрішні числа (1-7) виділяють ноти мажорної гами для обраної тональності.
zh_cn: 半音阶展示所有12个音符。内部数字（1-7）高亮显示所选调式的大调音阶音符。

source: The Interactive Piano will automatically highlight all the notes (and their scale degrees) for the selected key.
ar_sa: سوف تقوم البيانو التفاعلي بتسليط الضوء تلقائياً على جميع النوتات (ودرجات السلم الموسيقي الخاصة بها) للمفتاح المحدد.
el_gr: Το Διαδραστικό Πιάνο θα επισημάνει αυτόματα όλες τις νότες (και τους βαθμούς της κλίμακας τους) για την επιλεγμένη κλίμακα.
it_it: Il Piano Interattivo evidenzierà automaticamente tutte le note (e i loro gradi della scala) per la tonalità selezionata.
ja_jp: インタラクティブピアノは、選択されたキーのすべての音符（とそれらのスケール度数）を自動的にハイライト表示します。
ko_kr: 인터랙티브 피아노는 선택한 키에 대한 모든 음(그리고 그 음계의 단계)을 자동으로 강조 표시합니다.
pl_pl: Interaktywne Pianino automatycznie podświetli wszystkie nuty (oraz ich stopnie skali) dla wybranego klucza.
sv_se: Den interaktiva pianot markerar automatiskt alla toner (och deras skalgrader) för den valda tonarten.
uk_ua: Інтерактивне піаніно автоматично підсвітить усі ноти (та їх ступені у гамі) для обраної тональності.
zh_cn: 交互式钢琴将自动高亮显示所选调性的所有音符（及其音级）。

source: Quick Select Key
ar_sa: اختر المفتاح بسرعة
el_gr: Γρήγορη Επιλογή Τονικότητας
it_it: Selezione Rapida Tonalità
ja_jp: キーを素早く選択
ko_kr: 빠른 조성 선택
pl_pl: Szybki wybór tonacji
sv_se: Snabbvalsnyckel
uk_ua: Швидкий вибір тональності
zh_cn: 快速选择调性

source: This tool helps you visualize music theory. It connects the Chromatic Scale, the Circle of Fifths, the piano keyboard, and standard music notation all in one place.
ar_sa: تساعدك هذه الأداة على تصور نظرية الموسيقى. فهي تربط السلم الكروماتي، ودائرة الخامسات، ولوحة مفاتيح البيانو، والتدوين الموسيقي القياسي في مكان واحد.
el_gr: Αυτό το εργαλείο σας βοηθά να απεικονίσετε τη μουσική θεωρία. Συνδέει τη Χρωματική Κλίμακα, τον Κύκλο των Πέμπτων, το πληκτρολόγιο πιάνου και τον τυπικό μουσικό συμβολισμό, όλα σε ένα μέρος.
it_it: Questo strumento ti aiuta a visualizzare la teoria musicale. Collega la Scala Cromatica, il Circolo delle Quinte, la tastiera del pianoforte e la notazione musicale standard in un unico posto.
ja_jp: このツールは音楽理論を視覚的に理解するのに役立ちます。半音階（Chromatic Scale）、五度圏（Circle of Fifths）、ピアノキーボード、標準的な楽譜表記を一箇所で結びつけています。
ko_kr: 이 도구는 음악 이론을 시각화하는 데 도움을 줍니다. 크로매틱 스케일(Chromatic Scale), 5도권(Circle of Fifths), 피아노 건반, 그리고 표준 악보 표기법을 한곳에 모두 연결해 보여줍니다.
pl_pl: To narzędzie pomaga w wizualizacji teorii muzyki. Łączy skalę chromatyczną, koło kwintowe, klawiaturę fortepianu oraz standardowy zapis nutowy w jednym miejscu.
sv_se: Det här verktyget hjälper dig att visualisera musikteori. Det kopplar ihop kromatiska skalan, kvintcirkeln, pianotangentbordet och vanlig musikalisk notation på ett och samma ställe.
uk_ua: Цей інструмент допомагає візуалізувати теорію музики. Він поєднує хроматичну гаму, квінтове коло, клавіатуру піаніно та стандартну музичну нотацію в одному місці.
zh_cn: 本工具可帮助您直观理解乐理知识，它将半音音阶、五度圈、钢琴键盘以及标准音乐记谱法集中整合于一处。

source: Select a Major Key
ar_sa: اختر مفتاحًا رئيسيًا
el_gr: Επιλέξτε Μία Ματζόρε Τονικότητα
it_it: Seleziona una tonalità maggiore
ja_jp: 長調を選択
ko_kr: 장조 선택
pl_pl: Wybierz tonację durową
sv_se: Välj en durtonart
uk_ua: Оберіть мажорну тональність
zh_cn: 选择一个大调

source: The Circle of Fifths organizes keys based on perfect fifths. Rotating this circle demonstrates how keys are related. Each click (a &apos;fifth&apos;) adds or removes one sharp/flat from the key signature.
ar_sa: ينظم دائرة الخامسات المفاتيح بناءً على الخامسات الكاملة. تدوير هذه الدائرة يوضح كيفية ارتباط المفاتيح ببعضها. كل نقرة (تمثل 'خامسة') تضيف أو تزيل علامة رفع/خفض واحدة من سلّم المفتاح الموسيقي.
el_gr: Ο Κύκλος των Πέμπτων οργανώνει τις τονικότητες με βάση τις τέλειες πέμπτες. Η περιστροφή αυτού του κύκλου δείχνει πώς σχετίζονται οι τονικότητες. Κάθε κλικ (μια 'πέμπτη') προσθέτει ή αφαιρεί ένα δίεση/ύφεση από την οπήσειρα.
it_it: Il Circolo delle Quinte organizza le tonalità in base alle quinte giuste. Ruotando questo cerchio si dimostra come le tonalità siano correlate. Ogni clic (una 'quinta') aggiunge o rimuove un diesis o un bemolle dall'armatura di chiave.
ja_jp: 五度圏は完全五度に基づいて調を整理します。この円を回転させることで、各調がどのように関連しているかを示します。各クリック（1回の「五度」移動）ごとに、調号のシャープまたはフラットが1つ追加または削除されます。
ko_kr: 5도권은 완전 5도에 기반하여 조성을 체계화합니다. 이 원을 회전시키면 각 조성 간의 관계를 확인할 수 있습니다. 한 번 클릭할 때마다(즉, '5도' 이동) 조표의 샵(#) 또는 플랫(b)이 하나씩 추가되거나 제거됩니다.
pl_pl: Koło kwint organizuje tonacje w oparciu o kwinty czyste. Obrót tego koła pokazuje, jak tonacje są ze sobą powiązane. Każde kliknięcie (czyli 'kwinta') dodaje lub usuwa jeden krzyżyk/bemol z przyklucza.
sv_se: Kvintcirkeln organiserar tonarter baserat på perfekta kvinter. Genom att rotera denna cirkel visas hur tonarter är relaterade. Varje klick (en 'kvint') lägger till eller tar bort ett kors/ett b från tonartens förtecken.
uk_ua: Коло квінт упорядковує тональності на основі чистих квінт. Обертання цього кола демонструє, як тональності пов'язані між собою. Кожен клік (одна "квінта") додає або видаляє один дієз/бемоль із ключових знаків.
zh_cn: 五度圈以纯五度音程为基础组织调性。旋转此圈可展示各调性之间的关联。每次点击（一个“五度”）会在调号中增加或减少一个升号/降号。

source: Jianpu Key
ar_sa: مفتاح جيانبو
el_gr: Κλείδι Jianpu
it_it: Tonalità Jianpu
ja_jp: 数字譜キー
ko_kr: 겐푸 조
pl_pl: Tonacja Jianpu
sv_se: Jianpu-tonart
uk_ua: Тональність Цзяньпу
zh_cn: 简谱调号

source: Song
ar_sa: الأغنية
el_gr: Τραγούδι
it_it: Canzone
ja_jp: 曲
ko_kr: 노래
pl_pl: Utwór
sv_se: Sång
uk_ua: Пісня
zh_cn: 歌曲

source: Song Player
ar_sa: مشغل الأغاني
el_gr: Αναπαραγωγέας Μουσικής
it_it: Riproduttore musicale
ja_jp: 曲プレーヤー
ko_kr: 노래 재생기
pl_pl: Odtwarzacz utworów
sv_se: Låtspelare
uk_ua: Програвач пісень
zh_cn: 歌曲播放器

source: Loop Playback
ar_sa: تشغيل متكرر
el_gr: Επανάληψη Αναπαραγωγής
it_it: Riproduzione in loop
ja_jp: ループ再生
ko_kr: 반복 재생
pl_pl: Odtwarzanie w pętli
sv_se: Loop-uppspelning
uk_ua: Циклічне відтворення
zh_cn: 循环播放

source: The Key Signature display shows the correct sharps or flats for the key on both the treble and bass clefs.
ar_sa: يعرض رمز المفتاح العلامات الموسيقية الحادة (Sharps) أو المسطحة (Flats) الصحيحة للمفتاح الموسيقي على كل من المدرجين الصولفي (Treble Clef) والباسي (Bass Clef).
el_gr: Η οθόνη του Τονικού Πληκτρολογίου εμφανίζει τα σωστά δίεση ή ύφεση για την κλίμακα και στις δύο πενταγράμμους, του τενόρου και του μπάσου.
it_it: Il display dell'armatura di chiave mostra i diesis o i bemolle corretti per la tonalità su entrambi i chiavi di violino e basso.
ja_jp: 調号表示には、選択されたキーの正しいシャープまたはフラットがト音記号とヘ音記号の両方で表示されます。
ko_kr: 조표 표시창에서는 선택된 조에 대한 올바른 샵(#) 또는 플랫(♭)을 높은음자리표와 낮은음자리표 모두에 표시합니다.
pl_pl: Wyświetlacz znaków przykluczowych pokazuje prawidłowe krzyżyki lub bemole dla danego klucza zarówno na kluczu wiolinowym, jak i basowym.
sv_se: Visningen av klavsignatur visar de korrekta förteckningarna för dur- eller molltonarten på både g- och f-klav.
uk_ua: Відображення ключових знаків показує правильні дієзи або бемолі для тональності на обох нотоносцях — скрипковому та басовому.
zh_cn: 调号显示区域会在高音谱号和低音谱号上正确显示该调所需的升号或降号。

source: Rotate Left
ar_sa: تدوير لليسار
el_gr: Περιστροφή προς τα Αριστερά
it_it: Ruota a sinistra
ja_jp: 左回転
ko_kr: 왼쪽으로 회전
pl_pl: Obróć w lewo
sv_se: Rotera vänster
uk_ua: Повернути ліворуч
zh_cn: 向左旋转

source: Play
ar_sa: تشغيل
el_gr: Αναπαραγωγή
it_it: Riproduci
ja_jp: 再生
ko_kr: 재생
pl_pl: Odtwórz
sv_se: Spela
uk_ua: Грати
zh_cn: 播放

source: Rotate Right
ar_sa: تدوير لليمين
el_gr: Περιστροφή Δεξιά
it_it: Ruota a destra
ja_jp: 右回転
ko_kr: 오른쪽으로 회전
pl_pl: Obróć w prawo
sv_se: Rotera höger
uk_ua: Повернути праворуч
zh_cn: 向右旋转

source: Circle of Fifths
ar_sa: دائرة الخامسات
el_gr: Κύκλος των Πέμπτων
it_it: Circolo delle Quinte
ja_jp: 五度圏
ko_kr: 5도권
pl_pl: Krąg kwintowy
sv_se: Kvintcirkeln
uk_ua: Коло квінт
zh_cn: 五度圈

source: Chromatic Scale
ar_sa: السلم الكروماتيكي
el_gr: Χρωματική Κλίμακα
it_it: Scala Cromatica
ja_jp: 半音階
ko_kr: 반음계
pl_pl: Skala Chromatyczna
sv_se: Kromatisk skala
uk_ua: Хроматична гама
zh_cn: 半音阶

source: Interactive Piano
ar_sa: بيانو تفاعلي
el_gr: Διαδραστικό Πιάνο
it_it: Pianoforte Interattivo
ja_jp: インタラクティブピアノ
ko_kr: 대화형 피아노
pl_pl: Interaktywne Pianino
sv_se: Interaktivt piano
uk_ua: Інтерактивне піаніно
zh_cn: 交互式钢琴

source: Tonic
ar_sa: النغمة الأساسية
el_gr: Τονική
it_it: Tonica
ja_jp: 主音
ko_kr: 토닉
pl_pl: Tonika
sv_se: Grundton
uk_ua: Тоніка
zh_cn: 主音

source: Key Signature
ar_sa: المفتاح الموسيقي
el_gr: Τονισμός
it_it: Armatura di chiave
ja_jp: 調号
ko_kr: 조표
pl_pl: Znak przykluczowy
sv_se: Tonart
uk_ua: Ключовий знак
zh_cn: 调号
