Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/MelodyMemory.*.resx
Languages: ar_sa, da_dk, el_gr, fr_fr, hi_in, it_it, ja_jp, ko_kr, nl_nl, pl_pl, pt_pt, ro_ro, ru_ru, sv_se, th_th, tr_tr, uk_ua, zh_cn, zh_hk

source: Music Style
ar_sa: نمط الموسيقى
da_dk: Musikstil
el_gr: Μουσικό Στυλ
fr_fr: Style musical
hi_in: संगीत शैली
it_it: Stile Musicale
ja_jp: 音楽スタイル
ko_kr: 음악 스타일
nl_nl: Muziekstijl
pl_pl: Styl Muzyczny
pt_pt: Estilo Musical
ro_ro: Stil Muzical
ru_ru: Музыкальный стиль
sv_se: Musikstil
th_th: รูปแบบดนตรี
tr_tr: Müzik Tarzı
uk_ua: Музичний стиль
zh_cn: 音乐风格
zh_hk: 音樂風格

source: C Major
ar_sa: دو ماجور
da_dk: C-dur
el_gr: Ντο Ματζόρε
fr_fr: Do majeur
hi_in: सी मेजर
it_it: Do maggiore
ja_jp: ハ長調
nl_nl: C Majeur
pl_pl: C-dur
pt_pt: Dó Maior
ro_ro: Do major
ru_ru: До мажор
sv_se: C-dur
th_th: ซี เมเจอร์
tr_tr: Do Majör
uk_ua: До мажор
zh_cn: C大调
zh_hk: C大調

source: Transposed Major scale
ar_sa: سلم موسيقي كبير منقول
da_dk: Transponeret Dur-skala
el_gr: Μεταφερμένη κλίμακα Μείζονα
fr_fr: Gamme majeure transposée
hi_in: स्थानांतरित मेजर स्केल
it_it: Scala maggiore trasportata
ja_jp: 移調された長音階
ko_kr: 조옮김된 장음계
nl_nl: Getransponeerde majeurtoonladder
pl_pl: Transponowana skala durowa
pt_pt: Escala Maior Transposta
ro_ro: Scală Majoră Transpusă
ru_ru: Транспонированная мажорная гамма
sv_se: Transponerad dur-skala
th_th: บันไดเสียงเมเจอร์ที่เปลี่ยนคีย์
tr_tr: Aktarım Yapılmış Majör Gamı
uk_ua: Транспонована мажорна гама
zh_cn: 移调大调音阶
zh_hk: 移調大調音階

source: Random Key
ar_sa: مفتاح عشوائي
da_dk: Tilfældig toneart
el_gr: Τυχαία Τονικότητα
fr_fr: Touche aléatoire
hi_in: यादृच्छिक कुंजी
it_it: Tonalità Casuale
ja_jp: ランダムキー
ko_kr: 랜덤 키
nl_nl: Willekeurige Toonsoort
pl_pl: Losowa Tonacja
pt_pt: Tom Aleatório
ro_ro: Cheie Aleatorie
ru_ru: Случайная тональность
sv_se: Slumpmässig tonart
th_th: คีย์สุ่ม
tr_tr: Rastgele Anahtar
uk_ua: Випадкова тональність
zh_cn: 随机调
zh_hk: 隨機調

source: Melody Memory
ar_sa: ذاكرة اللحن
da_dk: Melodihukommelse
el_gr: Μνήμη Μελωδίας
fr_fr: Mémoire Mélodique
hi_in: मेलोडी मेमोरी
it_it: Memoria della Melodia
ja_jp: メロディーメモリー
ko_kr: 멜로디 메모리
nl_nl: Melodiegeheugen
pl_pl: Pamięć Melodii
pt_pt: Memória Melódica
ro_ro: Memorie Melodică
ru_ru: Мелодическая память
sv_se: Melodiminne
th_th: ความจำทำนองเพลง
tr_tr: Melodi Hafızası
uk_ua: Мелодійна пам'ять
zh_cn: 旋律记忆
zh_hk: 旋律記憶

source: Remember the melody and repeat it on the piano.
ar_sa: تذكر اللحن وكرره على البيانو.
da_dk: Husk melodien og gentag den på klaveret.
el_gr: Θυμήσου τη μελωδία και επανάλαβέ την στο πιάνο.
fr_fr: Mémorisez la mélodie et reproduisez-la au piano.
hi_in: धुन याद रखें और उसे पियानो पर दोहराएं।
it_it: Ricorda la melodia e ripetila sul pianoforte.
ja_jp: メロディを覚えて、ピアノで繰り返してください。
ko_kr: 멜로디를 기억하고 피아노로 다시 연주하세요.
nl_nl: Onthoud de melodie en speel deze na op de piano.
pl_pl: Zapamiętaj melodię i powtórz ją na pianinie.
pt_pt: Lembra-te da melodia e repete-a no piano.
ro_ro: Amintiți-vă melodia și repetați-o la pian.
ru_ru: Запомните мелодию и повторите её на пианино.
sv_se: Kom ihåg melodin och upprepa den på pianot.
th_th: จำทำนองเพลงแล้วเล่นซ้ำบนเปียโน
tr_tr: Melodiyi hatırla ve piyanoda tekrarla.
uk_ua: Запам'ятайте мелодію та відтворіть її на піаніно.
zh_cn: 记住旋律并在钢琴上复现。
zh_hk: 記住旋律，然後喺鋼琴上重複彈奏。

source: Preview
ar_sa: معاينة
da_dk: Forhåndsvisning
el_gr: Προεπισκόπηση
fr_fr: Aperçu
hi_in: पूर्वावलोकन
it_it: Anteprima
ja_jp: プレビュー
ko_kr: 미리보기
nl_nl: Voorbeeld
pl_pl: Podgląd
pt_pt: Pré-visualização
ro_ro: Previzualizare
ru_ru: Предпросмотр
sv_se: Förhandsgranska
th_th: ตัวอย่าง
tr_tr: Önizleme
uk_ua: Попередній перегляд
zh_cn: 预览
zh_hk: 預覽

source: Full Chromatic scale (Hard)
ar_sa: السلم الكروماتيكي الكامل (صعب)
da_dk: Fuld kromatisk skala (Svær)
el_gr: Πλήρης Χρωματική κλίμακα (Δύσκολο)
fr_fr: Gamme chromatique complète (Difficile)
hi_in: पूर्ण क्रोमैटिक स्केल (कठिन)
it_it: Scala cromatica completa (Difficile)
ja_jp: 全半音階（難しい）
ko_kr: 전체 반음계 (어려움)
nl_nl: Volledige chromatische toonladder (Moeilijk)
pl_pl: Pełna skala chromatyczna (Trudny)
pt_pt: Escala cromática completa (Difícil)
ro_ro: Scara cromatică completă (Dificil)
ru_ru: Полный хроматический звукоряд (Сложный)
sv_se: Full kromatisk skala (Svårt)
th_th: สเกลโครมาติกเต็มรูปแบบ (ยาก)
tr_tr: Tam Kromatik dizi (Zor)
uk_ua: Повна хроматична гама (Складно)
zh_cn: 全音阶（困难）
zh_hk: 全音階（困難）

source: Scale
ar_sa: السلم الموسيقي
da_dk: Skala
el_gr: Κλίμακα
fr_fr: Gamme
hi_in: स्केल
it_it: Scala
ja_jp: スケール
ko_kr: 스케일
nl_nl: Toonladder
pl_pl: Skala
pt_pt: Escala
ro_ro: Scală
ru_ru: Гамма
sv_se: Skala
th_th: สเกล
tr_tr: Gam
uk_ua: Гамма
zh_cn: 音阶
zh_hk: 音階

# Listen to range
source: Listen to the range
ar_sa: استمع إلى النطاق
da_dk: Lyt til omfanget
el_gr: Ακούστε την έκταση
fr_fr: Écoutez la gamme
hi_in: रेंज सुनें
it_it: Ascolta l'estensione
ja_jp: 音域を聴く
ko_kr: 범위 듣기
nl_nl: Luister naar het bereik
pl_pl: Posłuchaj zakresu
pt_pt: Ouvir a extensão
ro_ro: Ascultă intervalul
ru_ru: Прослушать диапазон
sv_se: Lyssna på omfånget
th_th: ฟังช่วงเสียง
tr_tr: Aralığı dinle
uk_ua: Прослухайте діапазон
zh_cn: 聆听音域
zh_hk: 聆聽音域

source: Atonal
ar_sa: لاحِني
el_gr: Άτονη
hi_in: अस्वराभासी
it_it: Atonale
ja_jp: 無調
ko_kr: 무조성
nl_nl: Atonaal
pl_pl: Atonalny
ru_ru: Атональная
th_th: ไม่มีเสียงหลัก
uk_ua: Атональний
zh_cn: 无调性
zh_hk: 無調性

source: Root Note
ar_sa: النغمة الأساسية
da_dk: Grundtone
el_gr: Βασική Νότα
fr_fr: Note fondamentale
hi_in: मूल स्वर
it_it: Nota Fondamentale
ja_jp: ルート音
ko_kr: 근음
nl_nl: Grondnoot
pl_pl: Tonika
pt_pt: Nota Tónica
ro_ro: Nota de bază
ru_ru: Основная нота
sv_se: Grundton
th_th: โน้ตหลัก
tr_tr: Kök Not
uk_ua: Тоніка
zh_cn: 根音
zh_hk: 根音

# ⚠ Last Stand ⚠
source: ⚠ Final Chance ⚠
ar_sa: ⚠ الموقف الأخير ⚠
da_dk: ⚠ Sidste chance ⚠
el_gr: ⚠ Τελευταία Άμυνα ⚠
fr_fr: ⚠ Dernier Rempart ⚠
hi_in: ⚠ अंतिम स्टैंड ⚠
it_it: ⚠ Ultima Resistenza ⚠
ja_jp: ⚠ ラストスタンド ⚠
ko_kr: ⚠ 최후의 저항 ⚠
nl_nl: ⚠ Laatste Strijd ⚠
pl_pl: ⚠ Ostatnia Linia Obrony ⚠
pt_pt: ⚠ Último Recurso ⚠
ro_ro: ⚠ Ultima Rezistență ⚠
ru_ru: ⚠ Последний рубеж ⚠
sv_se: ⚠ Sista striden ⚠
th_th: ⚠ ครั้งสุดท้าย ⚠
tr_tr: ⚠ Son Savunma ⚠
uk_ua: ⚠ Останній Рубеж ⚠
zh_cn: ⚠ 背水一战 ⚠
zh_hk: ⚠ 最後一搏 ⚠

source: White keys only (Easiest)
ar_sa: المفاتيح البيضاء فقط (الأسهل)
da_dk: Kun hvide tangenter (Mest let)
el_gr: Μόνο λευκά πλήκτρα (Πιο εύκολο)
fr_fr: Touches blanches uniquement (Le plus facile)
hi_in: केवल सफेद कुंजियाँ (सबसे आसान)
it_it: Solo tasti bianchi (Più facile)
ja_jp: 白鍵のみ（最も簡単）
ko_kr: 흰색 건반만 (가장 쉬움)
nl_nl: Alleen witte toetsen (Makkelijkst)
pl_pl: Tylko białe klawisze (Najłatwiejsze)
pt_pt: Apenas teclas brancas (Mais fácil)
ro_ro: Doar tastele albe (Cel mai ușor)
ru_ru: Только белые клавиши (Самый простой)
sv_se: Endast vita tangenter (Lättast)
th_th: เฉพาะปุ่มขาว (ง่ายที่สุด)
tr_tr: Sadece beyaz tuşlar (En Kolay)
uk_ua: Лише білі клавіші (Найлегший рівень)
zh_cn: 仅限白键（最简单）
zh_hk: 只使用白鍵（最簡單）

source: Start Game
ar_sa: ابدأ اللعبة
da_dk: Start spil
el_gr: Ξεκίνα Παιχνίδι
fr_fr: Commencer la partie
hi_in: खेल शुरू करें
it_it: Avvia Gioco
ja_jp: ゲーム開始
ko_kr: 게임 시작
nl_nl: Start Spel
pl_pl: Rozpocznij grę
pt_pt: Iniciar Jogo
ro_ro: Începe Jocul
ru_ru: Начать игру
sv_se: Starta spelet
th_th: เริ่มเกม
tr_tr: Oyunu Başlat
uk_ua: Почати гру
zh_cn: 开始游戏
zh_hk: 開始遊戲

# Check tonic only
source: Check the tonic only
ar_sa: التحقق من النغمة الأساسية فقط
da_dk: Kun tjek grundtone
el_gr: Ελέγξτε μόνο τον τονικό βαθμό
fr_fr: Vérifier uniquement la tonique
hi_in: केवल टॉनिक की जाँच करें
it_it: Controlla solo la tonica
ja_jp: 主音のみを確認
ko_kr: 토닉(근음)만 확인
nl_nl: Controleer alleen de grondtoon
pl_pl: Sprawdź tylko tonikę
pt_pt: Verificar apenas a tónica
ro_ro: Verifică doar tonica
ru_ru: Проверить только тонику
sv_se: Kontrollera endast grundtonen
th_th: ตรวจสอบโทนิคเท่านั้น
tr_tr: Sadece tonik notayı kontrol et
uk_ua: Перевірити лише тоніку
zh_cn: 仅检查主音
zh_hk: 只檢查主音

source: Try Again
ar_sa: حاول مرة أخرى
da_dk: Prøv igen
el_gr: Δοκίμασε Ξανά
fr_fr: Réessayer
hi_in: फिर से प्रयास करें
it_it: Riprova
ja_jp: もう一度試す
ko_kr: 다시 시도
nl_nl: Opnieuw proberen
pl_pl: Spróbuj ponownie
pt_pt: Tentar Novamente
ro_ro: Încearcă din nou
ru_ru: Попробовать снова
sv_se: Försök igen
th_th: ลองอีกครั้ง
tr_tr: Tekrar Dene
uk_ua: Спробувати знову
zh_cn: 再试一次
zh_hk: 再試一次

source: Level Reached:
ar_sa: المستوى الذي تم الوصول إليه:
da_dk: Niveau nået:
el_gr: Επίπεδο που επιτεύχθηκε:
fr_fr: Niveau atteint :
hi_in: स्तर प्राप्त किया:
it_it: Livello Raggiunto:
ja_jp: 到達レベル:
ko_kr: 달성한 레벨:
nl_nl: Behaald niveau:
pl_pl: Osiągnięty poziom:
pt_pt: Nível Alcançado:
ro_ro: Nivel atins:
ru_ru: Достигнутый уровень:
sv_se: Nivå uppnådd:
th_th: ระดับที่ถึง:
tr_tr: Seviyeye Ulaşıldı:
uk_ua: Досягнутий рівень:
zh_cn: 达到等级：
zh_hk: 已達等級：

source: Novice
ar_sa: مبتدئ
da_dk: Nybegynder
el_gr: Αρχάριος
hi_in: नौसिखिया
it_it: Principiante
ja_jp: 初心者
ko_kr: 초보자
nl_nl: Beginner
pl_pl: Nowicjusz
pt_pt: Principiante
ro_ro: Începător
ru_ru: Новичок
sv_se: Nybörjare
th_th: มือใหม่
tr_tr: Acemi
uk_ua: Новачок
zh_cn: 新手
zh_hk: 新手

source: Game Over
ar_sa: انتهت اللعبة
da_dk: Spillet er slut
el_gr: Τέλος Παιχνιδιού
fr_fr: Partie terminée
hi_in: खेल समाप्त
ja_jp: ゲームオーバー
ko_kr: 게임 오버
nl_nl: Spel voorbij
pl_pl: Koniec gry
pt_pt: Fim de Jogo
ro_ro: Joc Terminat
ru_ru: Игра окончена
sv_se: Spelet är slut
th_th: เกมโอเวอร์
tr_tr: Oyun Bitti
uk_ua: Гра закінчена
zh_cn: 游戏结束
zh_hk: 遊戲結束

source: Start immediately
ar_sa: ابدأ فورًا
da_dk: Start med det samme
el_gr: Ξεκινήστε αμέσως
fr_fr: Démarrer immédiatement
hi_in: तुरंत शुरू करें
it_it: Inizia subito
ja_jp: すぐに開始
nl_nl: Onmiddellijk starten
pl_pl: Rozpocznij natychmiast
pt_pt: Começar imediatamente
ro_ro: Începe imediat
ru_ru: Начать немедленно
sv_se: Starta omedelbart
th_th: เริ่มทันที
tr_tr: Hemen Başla
uk_ua: Почати негайно
zh_cn: 立即开始
zh_hk: 立即開始

source: Skip Preview
ar_sa: تخطي المعاينة
da_dk: Spring forhåndsvisning over
el_gr: Παράβλεψη Προεπισκόπησης
fr_fr: Passer l'aperçu
hi_in: पूर्वावलोकन छोड़ें
it_it: Salta Anteprima
ja_jp: プレビューをスキップ
nl_nl: Voorbeeld overslaan
pl_pl: Pomiń podgląd
pt_pt: Ignorar Pré-visualização
ro_ro: Omite Previzualizarea
ru_ru: Пропустить предпросмотр
sv_se: Hoppa över förhandsvisning
th_th: ข้ามการแสดงตัวอย่าง
tr_tr: Önizlemeyi Atla
uk_ua: Пропустити попередній перегляд
zh_cn: 放弃预览
zh_hk: 跳過預覽

source: Standard Pitch (A)
ar_sa: النغمة القياسية (A)
el_gr: Τυπική Σύμφωνο (Λα)
fr_fr: Hauteur standard (La)
hi_in: मानक पिच (A)
it_it: Intonazione Standard (A)
ja_jp: 標準ピッチ (A)
nl_nl: Standaard Toonhoogte (A)
pt_pt: Afinação Padrão (Lá)
ro_ro: Înălțime Standard (A)
ru_ru: Стандартный строй (Ля)
th_th: เสียงมาตรฐาน (A)
tr_tr: Standart Akort (A)
uk_ua: Стандартний камертон (Ля)
zh_cn: 标准音（A）
zh_hk: 標準音高 (A)

source: Listen to A4 (440Hz)
ar_sa: استمع إلى A4 (440 هرتز)
da_dk: Lyt til A4 (440Hz)
el_gr: Ακούστε το Λα4 (440Hz)
fr_fr: Écoutez le La4 (440 Hz)
hi_in: A4 (440Hz) सुनें
it_it: Ascolta il La4 (440Hz)
ja_jp: A4 (440Hz) を聴く
nl_nl: Luister naar A4 (440Hz)
pl_pl: Posłuchaj A4 (440Hz)
pt_pt: Ouvir o Lá4 (440Hz)
ro_ro: Ascultă nota A4 (440Hz)
ru_ru: Прослушайте ноту A4 (440 Гц)
sv_se: Lyssna på A4 (440 Hz)
th_th: ฟังเสียง A4 (440Hz)
tr_tr: A4 (440Hz) dinleyin
uk_ua: Прослухайте ноту A4 (440 Гц)
zh_cn: 聆听 A4 (440Hz)
zh_hk: 聆聽 A4 (440Hz)

source: Rank
ar_sa: الرتبة
da_dk: Rang
el_gr: Κατάταξη
fr_fr: Rang
hi_in: रैंक
it_it: Classifica
ja_jp: ランク
nl_nl: Rang
pl_pl: Ranga
pt_pt: Classificação
ro_ro: Rang
ru_ru: Ранг
th_th: อันดับ
tr_tr: Rütbe
uk_ua: Ранг
zh_cn: 段位
zh_hk: 級別

source: Total Score
ar_sa: النتيجة الإجمالية
da_dk: Samlet Score
el_gr: Συνολική Βαθμολογία
fr_fr: Score total
hi_in: कुल स्कोर
it_it: Punteggio Totale
ja_jp: 総合スコア
nl_nl: Totaalscore
pl_pl: Łączny wynik
pt_pt: Pontuação Total
ro_ro: Scor Total
ru_ru: Общий счёт
sv_se: Totalpoäng
th_th: คะแนนรวม
tr_tr: Toplam Puan
uk_ua: Загальний рахунок
zh_cn: 总分
zh_hk: 總分

source: Calculation
ar_sa: الحساب
da_dk: Beregning
el_gr: Υπολογισμός
fr_fr: Calcul
hi_in: गणना
it_it: Calcolo
ja_jp: 計算
nl_nl: Berekening
pl_pl: Obliczenie
pt_pt: Cálculo
ro_ro: Calcul
ru_ru: Расчёт
sv_se: Beräkning
th_th: การคำนวณ
tr_tr: Hesaplama
uk_ua: Обчислення
zh_cn: 得分计算
zh_hk: 計算

# Diff
source: Difficulty
ar_sa: الفرق
da_dk: Sværhedsgrad
el_gr: Δυσκολία
fr_fr: Difficulté
hi_in: कठिनाई
it_it: Difficoltà
ja_jp: 難易度
nl_nl: Moeilijkheidsgraad
pl_pl: Trudność
pt_pt: Dificuldade
ro_ro: Diferență
ru_ru: Сложность
sv_se: Svårighetsgrad
th_th: ความยาก
tr_tr: Zorluk
uk_ua: Складність
zh_cn: 难度系数
zh_hk: 難度

source: Level Reached
ar_sa: المستوى الذي تم الوصول إليه
da_dk: Niveau nået
el_gr: Επίπεδο που επιτεύχθηκε
fr_fr: Niveau atteint
hi_in: पहुँचा गया स्तर
it_it: Livello Raggiunto
ja_jp: 到達レベル
nl_nl: Behaald niveau
pl_pl: Osiągnięty poziom
pt_pt: Nível Alcançado
ro_ro: Nivel atins
ru_ru: Достигнутый уровень
sv_se: Nivå uppnådd
th_th: ระดับที่สำเร็จ
tr_tr: Ulaşılan Seviye
uk_ua: Досягнутий рівень
zh_cn: 达到等级
zh_hk: 已達等級

source: Difficulty
ar_sa: الصعوبة
da_dk: Sværhedsgrad
el_gr: Δυσκολία
fr_fr: Difficulté
hi_in: कठिनाई
it_it: Difficoltà
ja_jp: 難易度
nl_nl: Moeilijkheidsgraad
pl_pl: Trudność
pt_pt: Dificuldade
ro_ro: Dificultate
ru_ru: Сложность
sv_se: Svårighetsgrad
th_th: ความยาก
tr_tr: Zorluk
uk_ua: Складність
zh_cn: 难度
zh_hk: 難度

source: Notes
ar_sa: الملاحظات
da_dk: Noter
el_gr: Σημειώσεις
hi_in: स्वर
it_it: Note
ja_jp: 音符
nl_nl: Noten
pl_pl: Nuty
pt_pt: Notas
ro_ro: Note
ru_ru: Ноты
sv_se: Noter
th_th: โน้ต
tr_tr: Notlar
uk_ua: Ноти
zh_cn: 个音符
zh_hk: 音符

# Rookie
source: Novice
ar_sa: مبتدئ
da_dk: Nybegynder
el_gr: Νεοσύλλεκτος
fr_fr: Débutant
hi_in: नौसिखिया
it_it: Principiante
ja_jp: ルーキー
nl_nl: Beginner
pl_pl: Nowicjusz
pt_pt: Principiante
ro_ro: Începător
ru_ru: Новичок
sv_se: Nybörjare
th_th: มือใหม่
tr_tr: Çaylak
uk_ua: Новачок
zh_cn: 菜鸟
zh_hk: 新手

source: Silver
ar_sa: فضة
da_dk: Sølv
el_gr: Ασημένιο
fr_fr: Argent
hi_in: चांदी
it_it: Argento
ja_jp: シルバー
nl_nl: Zilver
pl_pl: Srebro
pt_pt: Prata
ro_ro: Argint
ru_ru: Серебро
th_th: เงิน
tr_tr: Gümüş
uk_ua: Срібло
zh_cn: 白银
zh_hk: 銀

source: Intermediate
ar_sa: متوسط
da_dk: Mellemniveau
el_gr: Μεσαίο
fr_fr: Intermédiaire
hi_in: मध्यम
it_it: Intermedio
ja_jp: 中級
nl_nl: Gemiddeld
pl_pl: Średniozaawansowany
pt_pt: Intermediário
ro_ro: Intermediar
ru_ru: Средний уровень
sv_se: Medel
th_th: ระดับกลาง
tr_tr: Orta Seviye
uk_ua: Середній
zh_cn: 进阶
zh_hk: 中級

source: Bronze
ar_sa: برونز
el_gr: Χάλκινο
hi_in: कांस्य
it_it: Bronzo
ja_jp: ブロンズ
nl_nl: Brons
pl_pl: Brąz
ro_ro: Bronză
ru_ru: Бронза
sv_se: Brons
th_th: ทองแดง
tr_tr: Bronz
uk_ua: Бронза
zh_cn: 青铜
zh_hk: 銅級

source: Grandmaster
ar_sa: السيد الكبير
da_dk: Stormester
el_gr: Μεγάλος Μάγιστρος
fr_fr: Grand Maître
hi_in: ग्रैंडमास्टर
it_it: Gran Maestro
ja_jp: グランドマスター
nl_nl: Grootmeester
pl_pl: Arcymistrz
pt_pt: Grão-Mestre
ro_ro: Maestru
ru_ru: Гроссмейстер
sv_se: Stormästare
th_th: ปรมาจารย์
tr_tr: Usta
uk_ua: Гросмейстер
zh_cn: 宗师
zh_hk: 大師級

source: Gold
ar_sa: ذهب
da_dk: Guld
el_gr: Χρυσός
fr_fr: Or
hi_in: सोना
it_it: Oro
ja_jp: ゴールド
nl_nl: Goud
pl_pl: Złoto
pt_pt: Ouro
ro_ro: Aur
ru_ru: Золото
sv_se: Guld
th_th: ทอง
tr_tr: Altın
uk_ua: Золото
zh_cn: 黄金
zh_hk: 金

source: Difficulty Breakdown
ar_sa: تفصيل مستوى الصعوبة
da_dk: Sværhedsfordeling
el_gr: Ανάλυση Δυσκολίας
fr_fr: Détail de la difficulté
hi_in: कठिनाई विवरण
it_it: Riepilogo della Difficoltà
ja_jp: 難易度内訳
nl_nl: Moeilijkheidsopbouw
pl_pl: Rozkład Trudności
pt_pt: Desagregação da Dificuldade
ro_ro: Detalierea Dificultății
ru_ru: Разбор сложности
sv_se: Svårighetsfördelning
th_th: รายละเอียดระดับความยาก
tr_tr: Zorluk Dağılımı
uk_ua: Розподіл складності
zh_cn: 难度详情
zh_hk: 難度分析

source: Diamond
ar_sa: الماس
da_dk: Diamant
el_gr: Διαμάντι
fr_fr: Diamant
hi_in: डायमंड
it_it: Diamante
ja_jp: ダイヤモンド
nl_nl: Diamant
pl_pl: Diament
pt_pt: Diamante
ro_ro: Diamant
ru_ru: Алмаз
sv_se: Diamant
th_th: เพชร
tr_tr: Elmas
uk_ua: Діамант
zh_cn: 钻石
zh_hk: 鑽石

# Calc
source: Calculation
ar_sa: حساب
da_dk: Beregn
el_gr: Υπολογισμός
fr_fr: Calcul
hi_in: गणना
it_it: Calcolo
ja_jp: 計算
nl_nl: Bereken
pl_pl: Oblicz
pt_pt: Cálc.
ro_ro: Calcul
ru_ru: Расчёт
sv_se: Beräkna
th_th: คำนวณ
tr_tr: Hesapla
uk_ua: Обчислення
zh_cn: 计算
zh_hk: 計算

source: Level
ar_sa: المستوى
da_dk: Niveau
el_gr: Επίπεδο
fr_fr: Niveau
hi_in: स्तर
it_it: Livello
ja_jp: レベル
nl_nl: Niveau
pl_pl: Poziom
pt_pt: Nível
ro_ro: Nivel
ru_ru: Уровень
sv_se: Nivå
th_th: ระดับ
tr_tr: Seviye
uk_ua: Рівень
zh_cn: 关卡
zh_hk: 關卡

source: 1 Note
da_dk: 1 node
hi_in: 1 नोट
it_it: 1 Nota
ja_jp: 1音
nl_nl: 1 Noot
pl_pl: 1 Nuta
pt_pt: 1 Nota
ro_ro: 1 Notă
ru_ru: 1 нота
sv_se: 1 ton
th_th: 1 โน้ต
tr_tr: 1 Nota
uk_ua: 1 нота
zh_cn: 1个音符
zh_hk: 1個音符

source: Add 8 beats per level
da_dk: Tilføj 8 taktslag pr. niveau
fr_fr: Ajouter 8 temps par niveau
hi_in: प्रति स्तर 8 बीट जोड़ें
it_it: Aggiungi 8 battiti per livello
ja_jp: レベルごとに8拍追加
nl_nl: Voeg 8 beats per niveau toe
pl_pl: Dodaj 8 uderzeń na poziom
pt_pt: Adicionar 8 batidas por nível
ro_ro: Adaugă 8 bătăi pe nivel
ru_ru: Добавлять 8 долей на уровень
sv_se: Lägg till 8 taktslag per nivå
th_th: เพิ่ม 8 จังหวะต่อระดับ
tr_tr: Seviye başına 8 vuruş ekle
uk_ua: Додати 8 тактів на рівень
zh_cn: 每级增加8拍
zh_hk: 每級增加8拍

source: Add 4 beats per level
da_dk: Tilføj 4 taktslag pr. niveau
fr_fr: Ajouter 4 temps par niveau
hi_in: प्रति स्तर 4 बीट जोड़ें
it_it: Aggiungi 4 battiti per livello
ja_jp: レベルごとに4拍追加
nl_nl: Voeg 4 tellen per niveau toe
pl_pl: Dodaj 4 uderzenia na poziom
pt_pt: Adicionar 4 batidas por nível
ro_ro: Adaugă 4 timpi pe nivel
ru_ru: Добавлять 4 доли на уровень
sv_se: Lägg till 4 taktslag per nivå
th_th: เพิ่ม 4 จังหวะต่อระดับ
tr_tr: Seviye başına 4 vuruş ekle
uk_ua: Додати 4 долі на рівень
zh_cn: 每级增加4拍
zh_hk: 每級增加4拍

source: Add one note per level
da_dk: Tilføj en node pr. niveau
fr_fr: Ajouter une note par niveau
hi_in: प्रत्येक स्तर पर एक नोट जोड़ें
it_it: Aggiungi una nota per livello
ja_jp: レベルごとに1音追加
nl_nl: Voeg één noot per niveau toe.
pl_pl: Dodaj jedną nutę na poziom
pt_pt: Adicionar uma nota por nível
ro_ro: Adaugă o notă pe nivel
ru_ru: Добавлять по одной ноте за уровень
sv_se: Lägg till en ton per nivå
th_th: เพิ่มหนึ่งโน้ตต่อระดับ
tr_tr: Her seviyede bir nota ekle
uk_ua: Додавати одну ноту на рівень
zh_cn: 每级增加一个音符
zh_hk: 每級增加一個音符

source: 2 Bars
da_dk: 2 Takter
fr_fr: 2 mesures
hi_in: 2 बार
it_it: 2 Battute
ja_jp: 2小節
nl_nl: 2 Maten
pl_pl: 2 Takty
pt_pt: 2 Compassos
ro_ro: 2 Măsuri
ru_ru: 2 такта
sv_se: 2 takter
th_th: 2 ห้อง
tr_tr: 2 Ölçü
uk_ua: 2 такти
zh_cn: 2小节
zh_hk: 2小節

source: 1 Bar
da_dk: 1 Tak
fr_fr: 1 mesure
hi_in: 1 बार
it_it: 1 Battuta
ja_jp: 1小節
nl_nl: 1 maat
pl_pl: 1 takt
pt_pt: 1 Compasso
ro_ro: 1 Măsură
ru_ru: 1 такт
sv_se: 1 takt
th_th: 1 ห้อง
tr_tr: 1 Ölçü
uk_ua: 1 такт
zh_cn: 1小节
zh_hk: 1 小節

# Increment
source: Progression
da_dk: Forøgelse
fr_fr: Incrément
hi_in: वृद्धि
it_it: Incremento
ja_jp: 増加量
nl_nl: Verhogen
pl_pl: Przyrost
pt_pt: Incremento
ro_ro: Incrementare
ru_ru: Увеличение
sv_se: Ökning
th_th: เพิ่มขึ้น
tr_tr: Artış
uk_ua: Приріст
zh_cn: 递增
zh_hk: 遞增

source: Current Difficulty
da_dk: Nuværende Sværhedsgrad
fr_fr: Difficulté actuelle
hi_in: वर्तमान कठिनाई
it_it: Difficoltà Corrente
ja_jp: 現在の難易度
nl_nl: Huidige moeilijkheidsgraad
pl_pl: Aktualny poziom trudności
pt_pt: Dificuldade Atual
ro_ro: Dificultate curentă
ru_ru: Текущая сложность
sv_se: Nuvarande svårighetsgrad
th_th: ระดับความยากปัจจุบัน
tr_tr: Mevcut Zorluk
uk_ua: Поточна складність
zh_cn: 当前难度
zh_hk: 目前難度

source: Visual hints enabled
da_dk: Visuelle hints aktiveret
fr_fr: Indices visuels activés
hi_in: दृश्य संकेत सक्षम
it_it: Suggerimenti visivi attivati
ja_jp: 視覚的なヒントが有効
nl_nl: Visuele hints ingeschakeld
pl_pl: Włączone podpowiedzi wizualne
ro_ro: Indicații vizuale activate
ru_ru: Включены визуальные подсказки
sv_se: Visuella ledtrådar aktiverade
th_th: เปิดใช้งานคำแนะนำภาพ
tr_tr: Görsel ipuçları etkin
uk_ua: Увімкнено візуальні підказки
zh_cn: 视觉提示已启用
zh_hk: 視覺提示已啟用

source: Practice Mode
da_dk: Øve-tilstand
fr_fr: Mode Entraînement
hi_in: प्रैक्टिस मोड
it_it: Modalità Pratica
ja_jp: 練習モード
nl_nl: Oefenmodus
pl_pl: Tryb treningowy
ro_ro: Modul de Practică
ru_ru: Режим тренировки
sv_se: Övningsläge
th_th: โหมดฝึกซ้อม
tr_tr: Alıştırma Modu
uk_ua: Режим тренування
zh_cn: 练习模式
zh_hk: 練習模式

source: Practice
da_dk: Øvelse
fr_fr: Entraînement
hi_in: अभ्यास
it_it: Allenamento
ja_jp: 練習
nl_nl: Oefenen
pl_pl: Trening
ro_ro: Exercițiu
th_th: ฝึกซ้อม
tr_tr: Alıştırma
zh_cn: 练习
zh_hk: 練習

source: Hard
da_dk: Svær
fr_fr: Difficile
hi_in: कठिन
it_it: Difficile
ja_jp: 難しい
nl_nl: Moeilijk
pl_pl: Trudny
ro_ro: Greu
th_th: ยาก
tr_tr: Zor
zh_cn: 困难
zh_hk: 困難

source: Standard (A4)
hi_in: मानक (A4)
ja_jp: 標準 (A4)
nl_nl: Standaard (A4)
th_th: มาตรฐาน (A4)
tr_tr: Standart (A4)
zh_cn: 标准 (A4)
zh_hk: 標準 (A4)

# Listen to the melody, memorize it, and replay it on the piano.
source: Listen to the tune, memorise it, and replay it on the piano.
da_dk: Lyt til melodien, husk den, og spil den igen på klaveret.
fr_fr: Écoutez la mélodie, mémorisez-la et rejouez-la au piano.
hi_in: धुन सुनें, उसे याद करें, और पियानो पर उसे दोहराएं।
it_it: Ascolta la melodia, memorizzala e riproducila sul pianoforte.
ja_jp: メロディを聴き、覚えて、ピアノで再現してください。
nl_nl: Luister naar de melodie, onthoud hem en speel hem na op de piano.
pl_pl: Posłuchaj melodii, zapamiętaj ją i odtwórz na pianinie.
ro_ro: Ascultă melodia, memorează-o și redă-o la pian.
th_th: ฟังทำนองเพลง จดจำ แล้วเล่นซ้ำบนเปียโน
tr_tr: Melodiyi dinleyin, ezberleyin ve piyanoda tekrar çalın.
zh_cn: 聆听旋律，记住它，然后在钢琴上复现出来。
zh_hk: 聆聽旋律，記住佢，然後喺鋼琴上重新彈奏。

source: Progression
hi_in: प्रगति
it_it: Progressione
ja_jp: 進行
nl_nl: Voortgang
pl_pl: Postęp
ro_ro: Progresie
th_th: ความก้าวหน้า
tr_tr: İlerleme
zh_cn: 进度
zh_hk: 進度

# +1 Note / Lvl
source: +1 Note per Level
da_dk: +1 node pr. niveau
fr_fr: +1 Note / Niveau
hi_in: +1 नोट / स्तर
it_it: +1 Nota / Liv
ja_jp: レベルごとに+1音
nl_nl: +1 Noot / Lvl
pl_pl: +1 Nuta / Poziom
ro_ro: +1 Notă / Nivel
th_th: +1 โน้ต / ระดับ
tr_tr: +1 Nota / Seviye
zh_cn: 每级增加1个音符
zh_hk: 每級 +1 個音符

# No Fail
source: No Penalty
da_dk: Ingen Fejl
fr_fr: Aucun échec
hi_in: कोई असफलता नहीं
it_it: Nessun Fallimento
ja_jp: 失敗なし
nl_nl: Geen Fout
pl_pl: Bez porażki
ro_ro: Fără Eșec
th_th: ไม่มีการล้มเหลว
tr_tr: Başarısızlık Yok
zh_cn: 无失败
zh_hk: 不會失敗

source: No Preview
da_dk: Ingen forhåndsvisning
fr_fr: Aucun aperçu
hi_in: कोई पूर्वावलोकन नहीं
it_it: Nessuna Anteprima
ja_jp: プレビューなし
nl_nl: Geen Voorbeeld
pl_pl: Bez podglądu
ro_ro: Fără previzualizare
th_th: ไม่มีการแสดงตัวอย่าง
tr_tr: Önizleme Yok
zh_cn: 无预览
zh_hk: 無預覽

# +4 Notes / Lvl
source: +4 Notes per Level
da_dk: +4 noder / niveau
fr_fr: +4 notes / niveau
hi_in: +4 नोट्स / स्तर
it_it: +4 Note / Liv
ja_jp: レベルごとに+4音
nl_nl: +4 Noten / Lvl
pl_pl: +4 nuty / poziom
ro_ro: +4 Note / Nivel
th_th: +4 โน้ต / ระดับ
tr_tr: +4 Nota / Seviye
zh_cn: 每级 +4 个音符
zh_hk: +4 個音符 / 關

source: Critical Health
da_dk: Kritisk helbred
fr_fr: Santé Critique
hi_in: गंभीर स्वास्थ्य
it_it: Salute Critico
ja_jp: 危機的体力
nl_nl: Kritieke Gezondheid
pl_pl: Krytyczne zdrowie
ro_ro: Stare Critică
th_th: สุขภาพวิกฤต
tr_tr: Kritik Sağlık
zh_cn: 生命危急
zh_hk: 危急生命值

# +8 Notes / Lvl
source: +8 Notes per Level
da_dk: +8 noder / niveau
fr_fr: +8 Notes / Niveau
hi_in: +8 नोट्स / स्तर
it_it: +8 Note / Liv
ja_jp: +8 ノート / レベル
nl_nl: +8 Noten / Lvl
pl_pl: +8 nut / poziom
ro_ro: +8 Note / Nivel
th_th: +8 โน้ต / ระดับ
tr_tr: +8 Nota / Seviye
zh_cn: 每级 +8 个音符
zh_hk: +8 個音符 / 關

source: Difficulty Rating
da_dk: Sværhedsgrad
fr_fr: Niveau de difficulté
hi_in: कठिनाई स्तर
it_it: Livello di Difficoltà
ja_jp: 難易度レーティング
nl_nl: Moeilijkheidsgraad
pl_pl: Poziom trudności
ro_ro: Grad de dificultate
th_th: ระดับความยาก
tr_tr: Zorluk Derecesi
zh_cn: 难度评级
zh_hk: 難度評級

source: Final Score
da_dk: Endelig score
fr_fr: Score final
hi_in: अंतिम स्कोर
it_it: Punteggio Finale
ja_jp: 最終スコア
nl_nl: Eindscore
pl_pl: Końcowy Wynik
ro_ro: Scor Final
th_th: คะแนนสุดท้าย
tr_tr: Son Puan
zh_cn: 最终得分
zh_hk: 最終分數

source: No Score
da_dk: Ingen score
fr_fr: Pas de score
hi_in: कोई स्कोर नहीं
it_it: Nessun Punteggio
pl_pl: Brak punktacji
th_th: ไม่มีคะแนน
tr_tr: Puan Yok
zh_hk: 無分數
