Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/Metronome.*.resx
Languages: hi_in, pt_br, ru_ru, th_th

source: BPM
hi_in: बीपीएम
ru_ru: уд/мин

# Eighth Note (♫)
source: Quaver (♫)
hi_in: आठवां नोट (♫)
pt_br: Colcheia (♫)
ru_ru: Восьмая нота (♫)
th_th: โน้ตเขบ็ตหนึ่งชั้น (♫)

source: Fast (320)
hi_in: तेज़ (320)
pt_br: Rápido (320)
ru_ru: Быстро (320)
th_th: เร็ว (320)

source: Normal (90)
hi_in: सामान्य (90)
ru_ru: Нормальный (90)
th_th: ปกติ (90)

# Quarter Note (♩)
source: Crotchet (♩)
hi_in: क्वार्टर नोट (♩)
pt_br: Semínima (♩)
ru_ru: Четвертная нота (♩)
th_th: โน้ตตัวดำ (♩)

# Sixteenth Note (♬)
source: Semiquaver (♬)
hi_in: षोडश स्वर (♬)
pt_br: Semicolcheia (♬)
ru_ru: Шестнадцатая нота (♬)
th_th: โน้ตเขบ็ตหนึ่งชั้น (♬)

source: Slow (1)
hi_in: धीमा (1)
pt_br: Lento (1)
ru_ru: Медленно (1)
th_th: ช้า (1)

source: Start
hi_in: शुरू करें
pt_br: Iniciar
ru_ru: Старт
th_th: เริ่ม

source: Stop
hi_in: रोकें
pt_br: Parar
ru_ru: Стоп
th_th: หยุด

source: Subdivision
hi_in: उपविभाजन
pt_br: Subdivisão
ru_ru: Подразделение
th_th: การแบ่งจังหวะย่อย

source: Time Signature
hi_in: ताल चिह्न
pt_br: Assinatura de Tempo
ru_ru: Размер такта
th_th: อัตราจังหวะ

source: Triplet (3)
hi_in: त्रिपद (3)
pt_br: Tríade (3)
ru_ru: Триоль (3)
th_th: ทริเพิล (3)
