Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/Minor.*.resx
Languages: es_es, hi_in, nl_nl, pt_pt, ro_ro, ru_ru, th_th, tr_tr

source: Chromatic Scale
es_es: Escala Cromática
hi_in: क्रोमैटिक स्केल
nl_nl: Chromatische toonladder
pt_pt: Escala Cromática
ro_ro: Scala Cromatică
ru_ru: Хроматическая гамма
th_th: สเกลโครมาติก
tr_tr: Kromatik Dizi

source: Circle of Fifths
es_es: Círculo de Quintas
hi_in: पंचम का चक्र
nl_nl: Kwintencirkel
pt_pt: Círculo de Quintas
ro_ro: Cercul cvintelor
ru_ru: Квинтовый круг
th_th: วงจรคู่ห้า
tr_tr: Beşliler Çemberi

source: How to Use It
es_es: Cómo usarlo
hi_in: इसका उपयोग कैसे करें
nl_nl: Hoe het te gebruiken
pt_pt: Como Utilizar
ro_ro: Cum se folosește
ru_ru: Как пользоваться
th_th: วิธีการใช้งาน
tr_tr: Nasıl Kullanılır

source: Interactive Piano
es_es: Piano Interactivo
hi_in: इंटरएक्टिव पियानो
nl_nl: Interactieve Piano
pt_pt: Piano Interativo
ro_ro: Pian Interactiv
ru_ru: Интерактивное пианино
th_th: เปียโนแบบโต้ตอบ
tr_tr: Etkileşimli Piyano

source: Jianpu Key
es_es: Clave Jianpu
hi_in: जियानपू कुंजी
nl_nl: Jianpu-toonsoort
pt_pt: Tom de Jianpu
ro_ro: Cheia Jianpu
ru_ru: Цифровая нотация (Цзяньпу)
th_th: คีย์ตัวเลข
tr_tr: Jianpu Anahtarı

source: Key Signature
es_es: Armadura de clave
hi_in: सुर-चिह्न
nl_nl: Toonsoort
pt_pt: Armadura de Clave
ro_ro: Armură
ru_ru: Ключевые знаки
th_th: กุญแจประจำบันไดเสียง
tr_tr: Anahtar İmzası

source: Loop Playback
es_es: Reproducción en bucle
hi_in: लूप प्लेबैक
nl_nl: Afspelen herhalen
pt_pt: Repetição em Ciclo
ro_ro: Redare în buclă
ru_ru: Циклическое воспроизведение
th_th: เล่นวนซ้ำ
tr_tr: Döngü Oynatma

source: Play
es_es: Reproducir
hi_in: चलाएं
nl_nl: Afspelen
pt_pt: Reproduzir
ro_ro: Redă
ru_ru: Воспроизвести
th_th: เล่น
tr_tr: Oynat

source: Quick Select Key
es_es: Selección Rápida de Tonalidad
hi_in: शीघ्र कुंजी चयन
nl_nl: Sneltoets voor toonsoort
pt_pt: Seleção Rápida de Tom
ro_ro: Selectare Rapidă a Tonului
ru_ru: Быстрый выбор тональности
th_th: เลือกคีย์อย่างรวดเร็ว
tr_tr: Hızlı Tuş Seçimi

source: Rotate Left
es_es: Girar a la izquierda
hi_in: बायीं ओर घुमाएँ
nl_nl: Draai linksom
pt_pt: Rodar para a Esquerda
ro_ro: Rotește la stânga
ru_ru: Повернуть влево
th_th: หมุนซ้าย
tr_tr: Sola Döndür

source: Rotate Right
es_es: Rotar a la derecha
hi_in: दाईं ओर घुमाएँ
nl_nl: Rechtsom draaien
pt_pt: Rodar à Direita
ro_ro: Rotește la dreapta
ru_ru: Повернуть вправо
th_th: หมุนขวา
tr_tr: Sağa Döndür

source: Select a Minor Key
es_es: Seleccionar una tonalidad menor
hi_in: एक माइनर कुंजी चुनें
nl_nl: Selecteer een Mineur Toonsoort
pt_pt: Selecionar uma Clave Menor
ro_ro: Selectați o tonalitate minoră
ru_ru: Выберите минорную тональность
th_th: เลือกคีย์ไมเนอร์
tr_tr: Bir Minör Ton Seçin

source: Song
es_es: Canción
hi_in: गाना
nl_nl: Nummer
pt_pt: Canção
ro_ro: Cântec
ru_ru: Песня
th_th: เพลง
tr_tr: Şarkı

source: Song Player
es_es: Reproductor de Canciones
hi_in: गाना प्लेयर
nl_nl: Nummerweergave
pt_pt: Reprodutor de Música
ro_ro: Player Muzică
ru_ru: Проигрыватель песен
th_th: เครื่องเล่นเพลง
tr_tr: Şarkı Çalar

source: The Chromatic Scale shows all 12 notes. The inner numbers (1-7) highlight the notes of the minor scale for the selected key.
es_es: La Escala Cromática muestra las 12 notas. Los números internos (1-7) resaltan las notas de la escala menor para la tonalidad seleccionada.
hi_in: क्रोमैटिक स्केल सभी 12 स्वरों को दर्शाता है। आंतरिक संख्याएँ (1-7) चुने गए कुंजी के लिए माइनर स्केल के स्वरों को उजागर करती हैं।
nl_nl: De chromatische toonladder toont alle 12 noten. De binnenste cijfers (1-7) markeren de noten van de mineur toonladder voor de geselecteerde toonsoort.
pt_pt: A Escala Cromática mostra todas as 12 notas. Os números interiores (1-7) destacam as notas da escala menor para a tonalidade selecionada.
ro_ro: Scala Cromatică afișează toate cele 12 note. Numerele interioare (1-7) evidențiază notele scării minore pentru tonalitatea selectată.
ru_ru: Хроматическая гамма показывает все 12 нот. Внутренние числа (1-7) выделяют ноты минорной гаммы для выбранной тональности.
th_th: สเกลโครมาติกแสดงโน้ตทั้งหมด 12 เสียง ตัวเลขด้านใน (1-7) เน้นโน้ตของสเกลไมเนอร์สำหรับคีย์ที่เลือก
tr_tr: Kromatik Skala, 12 notanın tamamını gösterir. İçteki sayılar (1-7), seçilen ton için minör gamın notalarını vurgular.

source: The Circle of Fifths organizes keys based on perfect fifths. Rotating this circle demonstrates how keys are related. Each click (a &apos;fifth&apos;) adds or removes one sharp/flat from the key signature.
es_es: El Círculo de Quintas organiza las tonalidades en base a quintas justas. Al rotar este círculo se demuestra cómo se relacionan las tonalidades. Cada clic (una 'quinta') añade o elimina un sostenido/bemol de la armadura de clave.
hi_in: पंचम चक्र (Circle of Fifths), सही पंचम (perfect fifths) के आधार पर सुरों (keys) को व्यवस्थित करता है। इस चक्र को घुमाने से यह प्रदर्शित होता है कि सुर कैसे संबंधित हैं। प्रत्येक क्लिक (एक 'पंचम') की साइनैचर (key signature) से एक शार्प/फ्लैट (sharp/flat) जोड़ता या हटाता है।
nl_nl: De Kwintencirkel ordent toonsoorten op basis van reine kwinten. Door deze cirkel te draaien wordt getoond hoe toonsoorten verwant zijn. Elke klik (een 'kwint') voegt een kruis/mol toe aan of verwijdert een kruis/mol uit de toonsoort.
pt_pt: O Círculo de Quintas organiza as tonalidades com base nas quintas justas. Ao rodar este círculo, demonstra-se como as tonalidades se relacionam. Cada clique (uma 'quinta') adiciona ou remove um sustenido/bemol da armadura de clave.
ro_ro: Cercul cvintelor organizează tonalitățile pe baza cvintelor perfecte. Rotirea acestui cerc demonstrează cum sunt relaționate tonalitățile. Fiecare click (o 'cvintă') adaugă sau elimină un diez/bemol din armura tonală.
ru_ru: Квинтовый круг упорядочивает тональности на основе чистых квинт. Вращение этого круга показывает, как тональности связаны между собой. Каждый щелчок (на одну "квинту") добавляет или убирает один диез/бемоль в ключевых знаках.
th_th: วงจรคู่ 5 จัดเรียงคีย์ตามหลักของคู่ 5 สมบูรณ์ การหมุนวงจรนี้แสดงให้เห็นว่าคีย์ต่างๆ มีความสัมพันธ์กันอย่างไร แต่ละครั้งที่คลิก (หนึ่ง 'คู่ 5') จะเพิ่มหรือลดเครื่องหมายชาร์ป/แฟล็ตหนึ่งตัวออกจากกุญแจประจำบันไดเสียง
tr_tr: Beşliler Çemberi, anahtarları tam beşliler temelinde düzenler. Bu çemberin döndürülmesi, anahtarların birbiriyle nasıl ilişkili olduğunu gösterir. Her tıklama (bir 'beşli'), anahtar iminden bir diyez ya da bemol ekler veya çıkarır.

source: The Interactive Piano will automatically highlight all the notes (and their scale degrees) for the selected key.
es_es: El Piano Interactivo resaltará automáticamente todas las notas (y sus grados de la escala) para la tonalidad seleccionada.
hi_in: इंटरएक्टिव पियानो स्वचालित रूप से चुनी गई कुंजी के लिए सभी स्वरों (और उनकी स्केल डिग्री) को हाइलाइट कर देगा।
nl_nl: De interactieve piano zal automatisch alle noten (en hun toonladdertrappen) voor de geselecteerde toonsoort markeren.
pt_pt: O Piano Interativo irá realçar automaticamente todas as notas (e os seus graus da escala) para a tonalidade selecionada.
ro_ro: Pianul Interactiv va evidenția automat toate notele (și gradele lor de scară) pentru tonalitatea selectată.
ru_ru: Интерактивное пианино автоматически подсветит все ноты (и их ступени) для выбранной тональности.
th_th: เปียโนแบบโต้ตอบจะทำการเน้นโน้ตทั้งหมด (และระดับเสียงของโน้ต) สำหรับคีย์ที่เลือกโดยอัตโนมัติ
tr_tr: Etkileşimli Piyano, seçilen ton için tüm notaları (ve derecelerini) otomatik olik olarak vurgulayacaktır.

source: The Key Signature display shows the correct sharps or flats for the key on both the treble and bass clefs.
es_es: La visualización de la Armadura de clave muestra los sostenidos o bemoles correctos para la tonalidad en ambas claves, la de sol y la de fa.
hi_in: कुंजी हस्ताक्षर प्रदर्शन, चाबी के लिए सही शार्प्स या फ्लैट्स को ट्रेबल और बास क्लेफ दोनों पर दिखाता है।
nl_nl: Het toonsoortdisplay toont de juiste kruizen en mollen voor de toonsoort op zowel de vioolsleutel als de bassleutel.
pt_pt: O mostrador da Armadura de Clave mostra os sustenidos ou bemóis corretos para a tonalidade, tanto na clave de sol como na clave de fá.
ro_ro: Afișajul Armăturii cheii afișează diezii sau bemoli corecți pentru cheia respectivă, atât pe portativele sol cât și fa.
ru_ru: На дисплее ключевых знаков отображаются соответствующие диезы или бемоли для выбранной тональности как в скрипичном, так и в басовом ключах.
th_th: การแสดงคีย์ซิกเนเจอร์จะแสดงเครื่องหมายชาร์ปหรือแฟลตที่ถูกต้องสำหรับคีย์ทั้งบนบรรทัดห้าเส้นเสียงสูงและบรรทัดห้าเส้นเสียงต่ำ
tr_tr: Anahtar İmza görüntüsü, seçilen anahtar için doğru diyez ve bemolleri hem sol anahtarı hem de fa anahtarı üzerinde gösterir.

source: This tool helps you visualize music theory. It connects the Chromatic Scale, the Circle of Fifths, the piano keyboard, and standard music notation all in one place.
es_es: Esta herramienta te ayuda a visualizar la teoría musical. Conecta la Escala Cromática, el Círculo de Quintas, el teclado del piano y la notación musical estándar, todo en un solo lugar.
hi_in: यह टूल आपको संगीत सिद्धांत को दृश्य रूप में देखने में मदद करता है। यह क्रोमैटिक स्केल, सर्कल ऑफ फिफ्थ्स, पियानो कीबोर्ड, और मानक संगीत नोटेशन को एक ही स्थान पर जोड़ता है।
nl_nl: Dit hulpmiddel helpt je muziektheorie te visualiseren. Het verbindt de chromatische toonladder, de kwintencirkel, het pianoklavier en de standaard muzieknotatie, allemaal op één plek.
pt_pt: Esta ferramenta ajuda-o a visualizar a teoria musical. Ela conecta a Escala Cromática, o Círculo de Quintas, o teclado do piano e a notação musical padrão, tudo num só local.
ro_ro: Acest instrument vă ajută să vizualizați teoria muzicală. Conectează Scala Cromatică, Cercul cvintelor, claviaturia de pian și notația muzicală standard într-un singur loc.
ru_ru: Этот инструмент помогает визуализировать теорию музыки. Он объединяет хроматическую гамму, квинтовый круг, клавиатуру фортепиано и стандартную музыкальную нотацию в одном месте.
th_th: เครื่องมือนี้ช่วยให้คุณเห็นภาพทฤษฎีดนตรี โดยเชื่อมโยง Chromatic Scale, Circle of Fifths, คีย์บอร์ดเปียโน และสัญกรณ์ดนตรีมาตรฐานไว้ในที่เดียว
tr_tr: Bu araç, müzik teorisini görselleştirmenize yardımcı olur. Kromatik Gam, Beşliler Çemberi, piyano klavyesi ve standart müzik notasyonunu tek bir yerde birleştirir.

source: Tonic
es_es: Tónica
hi_in: सुर
nl_nl: Grondtoon
pt_pt: Tónica
ro_ro: Tonică
ru_ru: Тоника
th_th: โทนิค
tr_tr: Tonik

source: Use the &apos;Rotate&apos; buttons under either circle to select a new key.
es_es: Utiliza los botones 'Rotar' debajo de cualquiera de los círculos para seleccionar una nueva tonalidad.
hi_in: किसी भी वृत्त के नीचे स्थित 'Rotate' बटनों का उपयोग करके एक नया कुंजी (key) चुनें।
nl_nl: Gebruik de 'Rotate'-knoppen onder een van de cirkels om een nieuwe toonsoort te selecteren.
pt_pt: Utilize os botões 'Rodar' por baixo de qualquer um dos círculos para selecionar uma nova tonalidade.
ro_ro: Folosiți butoanele „Rotate” de sub oricare dintre cercuri pentru a selecta o nouă tonalitate.
ru_ru: Используйте кнопки «Rotate» под любым из кругов, чтобы выбрать новую тональность.
th_th: ใช้ปุ่ม 'หมุน' ใต้วงกลมใดวงหนึ่งเพื่อเลือกคีย์ใหม่
tr_tr: Yeni bir anahtar seçmek için her iki dairenin altındaki 'Döndür' düğmelerini kullanın.

source: Welcome!
es_es: ¡Bienvenido!
hi_in: स्वागत है!
nl_nl: Welkom!
pt_pt: Bem-vindo!
ro_ro: Bine ați venit!
ru_ru: Добро пожаловать!
th_th: ยินดีต้อนรับ!
tr_tr: Hoş Geldiniz!

source: What is this?
es_es: ¿Qué es esto?
hi_in: यह क्या है?
nl_nl: Wat is dit?
pt_pt: O que é isto?
ro_ro: Ce este aceasta?
ru_ru: Что это?
th_th: นี่คืออะไร?
tr_tr: Bu nedir?
