Repository: AiursoftWeb/MusicTools
Catalog: src/Aiursoft.MusicTools/Resources/Views/Home/SelfHost.*.resx
Languages: hi_in

source: About MusicTools
hi_in: संगीत उपकरणों के बारे में

source: Always create a personal fork before submitting PRs.
hi_in: प्रस्तुतीकरण के पहले हमेशा अपना व्यक्तिगत फॉर्क बनाएं।

source: and the default password is:
hi_in: और डिफ़ॉल्ट पासवर्ड है:

source: Anywhere
hi_in: कहीं भी

source: Binary path
hi_in: बाइनरी पथ

source: Config path
hi_in: संगठन मार्ग

source: Container Context
hi_in: कंटेनर संदर्भ

source: Contribute
hi_in: योगदान दें

source: Data path
hi_in: डेटा मार्ग

source: Deploy
hi_in: स्थापित करें

source: Development &amp; Manual Run
hi_in: विकास और हाथ से चलाएँ

source: Execute `dotnet run` to run the app.
hi_in: dotnet run` चलाएँ ताकि ऐप चले।

source: Execute `npm install` at `wwwroot` folder.
hi_in: wwwroot` फोल्डर में `npm install` चलाएँ।

source: First, install Docker. Then run the following commands in a Linux shell:
hi_in: सबसे पहले, Docker स्थापित करें। फिर निम्नलिखित आदेशों को एक Linux संयंत्र में चलाएं:

source: Image
hi_in: इमेज

source: Live Demo
hi_in: लाइव डेमो

source: MusicTools is a project built with ASP.NET Core that provides various music-related tools and features. Deploy this on your server, open MusicTools in your browser, and access music education tools instantly.
hi_in: MusicTools एक प्रोजेक्ट है जो ASP.NET Core के साथ बनाया गया है जो विभिन्न संगीत संबंधी उपकरणों और विशेषताओं को प्रदान करता है। इसे अपने सर्वर पर डेप्लॉय करें, ब्राउज़र में MusicTools खोलें, और संगीत शिक्षा के उपकरणों तक तुरंत पहुंचें।

source: Open the `.sln` file.
hi_in: .sln` फ़ाइल खोलें।

source: Or with a custom port:
hi_in: या कस्टम पोर्ट के साथ:

source: Ports
hi_in: पोर्ट्स

source: Prerequisites
hi_in: पूर्वशर्तें

source: Press `F5` to run the app.
hi_in: एप्लिकेशन चलाने के लिए `F5` दबाएं।

source: Property
hi_in: गुणवत्ता

source: Pull Request
hi_in: पुल रिक्वेस्ट

source: Recommended
hi_in: अनुशंसित

source: Report Issue
hi_in: समस्या रिपोर्ट करें

source: Run in Docker
hi_in: डॉकर में चलाएँ

source: Run in Ubuntu
hi_in: यूनिक्स में चलाएँ

source: Run in Visual Studio
hi_in: विजुअल स्टूडियो में चलाएँ

source: Run Manually
hi_in: हाथ से चलाएँ

source: Self Host
hi_in: स्वयं होस्ट

source: That will start a web server at http://localhost:5000 and you can test the app.
hi_in: यह http://localhost:5000 पर एक वेब सर्वर शुरू कर देगा और आप ऐप का परीक्षण कर सकते हैं।

source: The default username is:
hi_in: डिफ़ॉल्ट उपयोगकर्ता नाम है:

source: The following script will install/update this app on your Ubuntu server. Supports Ubuntu 25.04.
hi_in: निम्नलिखित स्क्रिप्ट आपके Ubuntu सर्वर पर इस एप्लिकेशन को इंस्टॉल/अपडेट करेगी। Ubuntu 25.04 का समर्थन करता है।

source: Value
hi_in: मूल्य

source: Visit http://localhost:5000.
hi_in: http://localhost:5000 पर जाएं।

source: We&apos;re interested in your feedback! You can submit a suggestion or feature request through the issue tracker.
hi_in: हम आपके प्रतिक्रिया में रुचि रखते हैं! आप सुझाव या फीचर की मांग के लिए इश्यू ट्रैकर के माध्यम से प्रस्तुत कर सकते हैं।
